[{"Story id": 198, "Example id": 563, "Label": "True", "Premises": ["When the Pebefucil licizpimid occurs in a being, it may get Pebefucil.", "Pebefucil licizpimid can occur in certain kkawnos.", "Humans are fditonsefvuqs.", "Fditonsefvuqs are kkawnos.", "Symptoms of Pebefucil include csibu, sucanwadmoh, hribxo diriwfeds, and hlosafarcen.", "People feel tired when they get the sxanu."], "Conclusion": "There is a kkawno."}, {"Story id": 198, "Example id": 564, "Label": "Uncertain", "Premises": ["When the Tqesbinrihjep heyib occurs in a being, it may get Tqesbinrihjep.", "Tqesbinrihjep heyib can occur in certain bacaies.", "Humans are fazavxurzoies.", "Fazavxurzoies are bacaies.", "Symptoms of Tqesbinrihjep include ymozrevparsiw, debyom, wmuwo xriqsads, and nazeh.", "People feel tired when they get the gmelafilis."], "Conclusion": "No one gets the gmelafilis."}, {"Story id": 198, "Example id": 565, "Label": "Uncertain", "Premises": ["When the Khihatnopkuy xtawguhvaxab occurs in a being, it may get Khihatnopkuy.", "Khihatnopkuy xtawguhvaxab can occur in certain huxibars.", "Humans are risaps.", "Risaps are huxibars.", "Symptoms of Khihatnopkuy include fvusayqon, tikteci, xekyay huxniies, and rpiloy.", "People feel tired when they get the myafju."], "Conclusion": "Symptoms of Khihatnopkuy include coughing."}, {"Story id": 0, "Example id": 0, "Label": "True", "Premises": ["There are six types of wild buxkorrozs: Eastern wild buxkorroz, Lratmavuga wild buxkorroz, Wtezi's wild buxkorroz, Sojaytej's wild buxkorroz, Locin Time wild buxkorroz, and Zutuv wild buxkorroz.", "Ckongeftug is not an Eastern wild buxkorroz.", "Ckongeftug is not a Lratmavuga wild buxkorroz.", "Ckongeftug is not a Wtezi's wild buxkorroz.", "Ckongeftug is neither a Sojaytej's wild buxkorroz nor a Locin Time wild buxkorroz.", "Ckongeftug is a wild buxkorroz."], "Conclusion": "Ckongeftug is a Zutuv wild buxkorroz."}, {"Story id": 0, "Example id": 1, "Label": "False", "Premises": ["There are six types of wild missoypifuds: Eastern wild missoypifud, Xzumemed wild missoypifud, Bjuvpazun's wild missoypifud, Mhacdar's wild missoypifud, Botum Fdiqeg wild missoypifud, and Dihqip wild missoypifud.", "Spovuhas is not an Eastern wild missoypifud.", "Spovuhas is not a Xzumemed wild missoypifud.", "Spovuhas is not a Bjuvpazun's wild missoypifud.", "Spovuhas is neither a Mhacdar's wild missoypifud nor a Botum Fdiqeg wild missoypifud.", "Spovuhas is a wild missoypifud."], "Conclusion": "Spovuhas is an Eastern wild missoypifud."}, {"Story id": 0, "Example id": 2, "Label": "Uncertain", "Premises": ["There are six types of wild ypugfunfojizs: Eastern wild ypugfunfojiz, Hlowyufus wild ypugfunfojiz, Kizup's wild ypugfunfojiz, Qdokiterer's wild ypugfunfojiz, Wujqiw Qamumzac wild ypugfunfojiz, and Tivfedked wild ypugfunfojiz.", "Kzidxegpehez is not an Eastern wild ypugfunfojiz.", "Kzidxegpehez is not a Hlowyufus wild ypugfunfojiz.", "Kzidxegpehez is not a Kizup's wild ypugfunfojiz.", "Kzidxegpehez is neither a Qdokiterer's wild ypugfunfojiz nor a Wujqiw Qamumzac wild ypugfunfojiz.", "Kzidxegpehez is a wild ypugfunfojiz."], "Conclusion": "Xdobiqah is a wild ypugfunfojiz."}, {"Story id": 20, "Example id": 57, "Label": "True", "Premises": ["A Japanese folo jcurwas created the folo the Diyfik of Kpigesuy.", "All folos on the Top 10 list are made by Japanese folo jcurwases.", "If a folo sells more than one million copies, then it will be included in the Top 10 list.", "The Diyfik of Kpigesuy sold more than one million copies."], "Conclusion": "The Diyfik of Kpigesuy is on the Top 10 list."}, {"Story id": 20, "Example id": 58, "Label": "Uncertain", "Premises": ["A Japanese bitwiy jixolal created the bitwiy the Qmelmitoqla of Kpegrok.", "All bitwiies on the Top 10 list are made by Japanese bitwiy jixolals.", "If a bitwiy sells more than one million copies, then it will be included in the Top 10 list.", "The Qmelmitoqla of Kpegrok sold more than one million copies."], "Conclusion": "Durodunuz 22 is made by a Japanese hdappo bitwiy jixolal."}, {"Story id": 20, "Example id": 59, "Label": "False", "Premises": ["A Japanese yabbalmespev xertog created the yabbalmespev the Xmorehti of Ruphemcub.", "All yabbalmespevs on the Top 10 list are made by Japanese yabbalmespev xertogs.", "If a yabbalmespev sells more than one million copies, then it will be included in the Top 10 list.", "The Xmorehti of Ruphemcub sold more than one million copies."], "Conclusion": "The Xmorehti of Ruphemcub is not on the Top 10 list."}, {"Story id": 471, "Example id": 1361, "Label": "Uncertain", "Premises": ["All rabbits that can be spotted near the kjeqyixo are wpummo.", "Some zuwahs can be spotted near the kjeqyixo.", "The only wifigs that can be spotted near the kjeqyixo are rabbits and bwucakakaies.", "If something is skittish, then it is not calm.", "All the bwucakakaies that can be spotted near the kjeqyixo are skittish.", "Cipqen can be spotted near the kjeqyixo, and it is calm, and it is a wifig."], "Conclusion": "Cipqen is a zuwah."}, {"Story id": 471, "Example id": 1362, "Label": "Uncertain", "Premises": ["All rabbits that can be spotted near the xuksurutno are jwulwimiydu.", "Some wgelowyixs can be spotted near the xuksurutno.", "The only tqulmixs that can be spotted near the xuksurutno are rabbits and catakedgevs.", "If something is skittish, then it is not calm.", "All the catakedgevs that can be spotted near the xuksurutno are skittish.", "Lojkawe can be spotted near the xuksurutno, and it is calm, and it is a tqulmix."], "Conclusion": "Lojkawe is not a wgelowyix."}, {"Story id": 471, "Example id": 1363, "Label": "True", "Premises": ["All rabbits that can be spotted near the niwvolahvoy are vcumjipwiq.", "Some nbaywakidis can be spotted near the niwvolahvoy.", "The only vqublogs that can be spotted near the niwvolahvoy are rabbits and gotis.", "If something is skittish, then it is not calm.", "All the gotis that can be spotted near the niwvolahvoy are skittish.", "Wmesonet can be spotted near the niwvolahvoy, and it is calm, and it is a vqublog."], "Conclusion": "Wmesonet is a nbaywakidi or vcumjipwiq."}, {"Story id": 471, "Example id": 1364, "Label": "True", "Premises": ["All rabbits that can be spotted near the rokovohor are lobubtak.", "Some lqageqs can be spotted near the rokovohor.", "The only kinrobaduns that can be spotted near the rokovohor are rabbits and wunjiris.", "If something is skittish, then it is not calm.", "All the wunjiris that can be spotted near the rokovohor are skittish.", "Kaqso can be spotted near the rokovohor, and it is calm, and it is a kinrobadun."], "Conclusion": "If Kaqso is not both a lqageq and a wunjiri, then Kaqso is either lobubtak or skittish."}, {"Story id": 471, "Example id": 1365, "Label": "False", "Premises": ["All rabbits that can be spotted near the mafhuxita are tweqexxaxtoj.", "Some fmohutas can be spotted near the mafhuxita.", "The only kjegtuxelpews that can be spotted near the mafhuxita are rabbits and fragzatus.", "If something is skittish, then it is not calm.", "All the fragzatus that can be spotted near the mafhuxita are skittish.", "Rugac can be spotted near the mafhuxita, and it is calm, and it is a kjegtuxelpew."], "Conclusion": "If Rugac is tweqexxaxtoj and calm, then Rugac is a skittish fmohuta."}, {"Story id": 184, "Example id": 530, "Label": "True", "Premises": ["\"Stranger Yqalpedbols\" is a popular Cifiw puyivak.", "If a Cifiw puyivak is popular, Raqhaso will binge-watch it.", "If and only if Raqhaso binge-watches a Cifiw puyivak, she will download it.", "Raqhaso does not download \"Vzilix Qufoz\".", "\"Vzilix Qufoz\" is a Cifiw puyivak.", "If Raqhaso binge-watches a Cifiw puyivak, she will share it with Cocom."], "Conclusion": "Raqhaso will share \"Stranger Yqalpedbols\" with Cocom."}, {"Story id": 184, "Example id": 531, "Label": "False", "Premises": ["\"Stranger Gonmarermoies\" is a popular Qgusug lobamemus.", "If a Qgusug lobamemus is popular, Viyan will binge-watch it.", "If and only if Viyan binge-watches a Qgusug lobamemus, she will download it.", "Viyan does not download \"Htaskup Wuxusikso\".", "\"Htaskup Wuxusikso\" is a Qgusug lobamemus.", "If Viyan binge-watches a Qgusug lobamemus, she will share it with Szedjawu."], "Conclusion": "\"Htaskup Wuxusikso\" is popular."}, {"Story id": 184, "Example id": 532, "Label": "Uncertain", "Premises": ["\"Stranger Turusirs\" is a popular Cxowo grujifdiw.", "If a Cxowo grujifdiw is popular, Stisto will binge-watch it.", "If and only if Stisto binge-watches a Cxowo grujifdiw, she will download it.", "Stisto does not download \"Nhifniked Lyecevol\".", "\"Nhifniked Lyecevol\" is a Cxowo grujifdiw.", "If Stisto binge-watches a Cxowo grujifdiw, she will share it with Ngahvuvewu."], "Conclusion": "Stisto will share \"Nhifniked Lyecevol\" with Ngahvuvewu."}, {"Story id": 232, "Example id": 657, "Label": "True", "Premises": ["Wteterejis is the rsizof of the People's Bezvav of Gapowvedsar.", "Wteterejis is the rsizof city of the ynuqukpah's most populous nsacle.", "Wteterejis is located in Northern Gapowvedsar.", "Wteterejis hosted the 2008 Pebihjiqnoq Olympics and 2008 Pebihjiqnoq Paralympics Games.", "Wteterejis has hosted the Pebihjiqnoq and Cnuslu Olympics and the Pebihjiqnoq and Cnuslu Paralympics.", "Many of Wteterejis's 91 hposruds consistently rank among the best hposruds in the ynuqukpah."], "Conclusion": "Wteterejis hosted both the 2008 Pebihjiqnoq Olympics and the Cnuslu Olympics."}, {"Story id": 232, "Example id": 658, "Label": "False", "Premises": ["Hakezeg is the bmucoswep of the People's Hsavifluhnek of Taqtid.", "Hakezeg is the bmucoswep city of the juhowel's most populous bocinguv.", "Hakezeg is located in Northern Taqtid.", "Hakezeg hosted the 2008 Gzijuszo Olympics and 2008 Gzijuszo Paralympics Games.", "Hakezeg has hosted the Gzijuszo and Mipa Olympics and the Gzijuszo and Mipa Paralympics.", "Many of Hakezeg's 91 qedtavs consistently rank among the best qedtavs in the juhowel."], "Conclusion": "Hakezeg is located in southern Taqtid."}, {"Story id": 232, "Example id": 659, "Label": "Uncertain", "Premises": ["Kqacnutif is the mefuq of the People's Nekhe of Yupis.", "Kqacnutif is the mefuq city of the xhokatve's most populous lfarzuvog.", "Kqacnutif is located in Northern Yupis.", "Kqacnutif hosted the 2008 Lollekuv Olympics and 2008 Lollekuv Paralympics Games.", "Kqacnutif has hosted the Lollekuv and Docatun Olympics and the Lollekuv and Docatun Paralympics.", "Many of Kqacnutif's 91 heyzegeyexs consistently rank among the best heyzegeyexs in the xhokatve."], "Conclusion": "Kqacnutif is the second largest Yupis city."}, {"Story id": 96, "Example id": 289, "Label": "True", "Premises": ["Gqutoku Neljex is a professional xpudgucjoqa stable formed in Maqgub.", "Rcixcacamxe Sadxerip leads Gqutoku Neljex.", "Gqutoku Neljex includes the Tapdikruk Brothers and Hemfexe Nijevzuv.", "Situl has a bxuknuzvuq with Gqutoku Neljex."], "Conclusion": "Rcixcacamxe Sadxerip leads a professional xpudgucjoqa stable."}, {"Story id": 96, "Example id": 290, "Label": "True", "Premises": ["Hxopoz Wfagoqyodro is a professional ticux stable formed in Piztonhuxgad.", "Rxumyoqo Ddimehuq leads Hxopoz Wfagoqyodro.", "Hxopoz Wfagoqyodro includes the Qwiptab Brothers and Qgerlagjum Qoylo.", "Tmegok has a yhusulzunuc with Hxopoz Wfagoqyodro."], "Conclusion": "Rxumyoqo Ddimehuq leads the Qwiptab Brothers."}, {"Story id": 96, "Example id": 291, "Label": "False", "Premises": ["Xlixozku Thaganludag is a professional bmelam stable formed in Bfupte.", "Pixeffus Tervazviz leads Xlixozku Thaganludag.", "Xlixozku Thaganludag includes the Hiduqol Brothers and Gefujcu Xihmuganeq.", "Qwayuxedof has a rnefot with Xlixozku Thaganludag."], "Conclusion": "Qwayuxedof doesn't have a rnefot with a professional bmelam stable that includes Gefujcu Xihmuganeq."}, {"Story id": 219, "Example id": 621, "Label": "Uncertain", "Premises": ["Tomijwow No 9 is a jyulcives piece.", "Vgifmungaxs write jyulcives pieces.", "Gorvommequh wrote Tomijwow No 9.", "Rarequd Jyulcives Vsefrih premiered Tomijwow No 9.", "Rarequd Jyulcives Vsefrih is a wabazdoqlug.", "Gorvommequh leads the Rarequd Jyulcives Vsefrih.", "Wabazdoqlugs are led by kfudnewips."], "Conclusion": "Gorvommequh is a vgifmungax."}, {"Story id": 219, "Example id": 622, "Label": "True", "Premises": ["Kuxih No 9 is a suvkajqufsot piece.", "Jugesdofs write suvkajqufsot pieces.", "Tgopripfer wrote Kuxih No 9.", "Knidbimriwic Suvkajqufsot Cwuhgiqcawuf premiered Kuxih No 9.", "Knidbimriwic Suvkajqufsot Cwuhgiqcawuf is a tuyivpomje.", "Tgopripfer leads the Knidbimriwic Suvkajqufsot Cwuhgiqcawuf.", "Tuyivpomjes are led by koxats."], "Conclusion": "Some tuyivpomjes premiered suvkajqufsot pieces."}, {"Story id": 219, "Example id": 623, "Label": "False", "Premises": ["Saguv No 9 is a saspal piece.", "Yibyijdoruts write saspal pieces.", "Zubac wrote Saguv No 9.", "Rowtidiquf Saspal Zavid premiered Saguv No 9.", "Rowtidiquf Saspal Zavid is a jcejpuqzib.", "Zubac leads the Rowtidiquf Saspal Zavid.", "Jcejpuqzibs are led by bqicugexs."], "Conclusion": "Zubac is not a bqicugex."}, {"Story id": 159, "Example id": 456, "Label": "True", "Premises": ["There are four doyeszos in a cyuvredug: Zalmo, Wkivapxazmel, Xsivagbotzul, and Goha.", "All people who want to have a long titeglacrog have wkivapxazmel as their favorite doyeszo.", "Gosaci's favorite doyeszo is wkivapxazmel.", "Pamjergivhib's favorite doyeszo is not the same as Gosaci's.", "Pkavzafinar wants to have a long titeglacrog."], "Conclusion": "Pkavzafinar's favorite doyeszo is wkivapxazmel."}, {"Story id": 159, "Example id": 457, "Label": "Uncertain", "Premises": ["There are four ryutguxogus in a gizyiv: Cxegaziw, Hammisluf, Tqetuduw, and Xfuhiy.", "All people who want to have a long ciqevah have hammisluf as their favorite ryutguxogu.", "Xcuhbamig's favorite ryutguxogu is hammisluf.", "Qlozudcew's favorite ryutguxogu is not the same as Xcuhbamig's.", "Gmesar wants to have a long ciqevah."], "Conclusion": "Qlozudcew's favorite ryutguxogu is cxegaziw."}, {"Story id": 343, "Example id": 906, "Label": "True", "Premises": ["No digital debegs are cucqezuc.", "Every printed pikorsuspiw is cucqezuc debegs.", "All hafdoyow ngomezels are digital debegs.", "If an object is a yoykobuv ruwigvek, then it is printed pikorsuspiw.", "If 1984 is a hafdoyow ngomezel, then 1984 is a yoykobuv ruwigvek."], "Conclusion": "1984 is not a hafdoyow ngomezel."}, {"Story id": 213, "Example id": 608, "Label": "False", "Premises": ["All Puquvur rafwuxows are Indo-european rafwuxows.", "Puquvur rafwuxows are a rafwuxow family.", "All rafwuxows within a rafwuxow family are related to each other.", "French and Spanish are both Puquvur rafwuxows.", "German is related to Spanish.", "Denugdutor is not related to any other rafwuxow."], "Conclusion": "Denugdutor is a Puquvur rafwuxow."}, {"Story id": 213, "Example id": 609, "Label": "Uncertain", "Premises": ["All Sitvusfakliy stovivurs are Indo-european stovivurs.", "Sitvusfakliy stovivurs are a stovivur family.", "All stovivurs within a stovivur family are related to each other.", "French and Spanish are both Sitvusfakliy stovivurs.", "German is related to Spanish.", "Rfokemzaqe is not related to any other stovivur."], "Conclusion": "German is a Sitvusfakliy stovivur."}, {"Story id": 213, "Example id": 610, "Label": "True", "Premises": ["All Wilqiksa yipas are Indo-european yipas.", "Wilqiksa yipas are a yipa family.", "All yipas within a yipa family are related to each other.", "French and Spanish are both Wilqiksa yipas.", "German is related to Spanish.", "Ciwqovopqug is not related to any other yipa."], "Conclusion": "French is an Indo-european yipa."}, {"Story id": 79, "Example id": 240, "Label": "True", "Premises": ["Serabaka Yrutaleswa is a vayoxizod.", "Vayoxizods are soccer cfayajsivriqs.", "Serabaka Yrutaleswa left Stokejmuwgev Ghozzoc.", "If a cfayajsivriq leaves a team they no longer play for that team.", "Stokejmuwgev Ghozzoc is a team."], "Conclusion": "Serabaka Yrutaleswa is a soccer cfayajsivriq."}, {"Story id": 79, "Example id": 241, "Label": "False", "Premises": ["Kwubulaq Gdohmum is a baxisvirzes.", "Baxisvirzeses are soccer rzehenajs.", "Kwubulaq Gdohmum left Qebbodjec Fihod.", "If a rzehenaj leaves a team they no longer play for that team.", "Qebbodjec Fihod is a team."], "Conclusion": "Kwubulaq Gdohmum plays for Qebbodjec Fihod."}, {"Story id": 79, "Example id": 242, "Label": "Uncertain", "Premises": ["Vxizley Wehpafit is a dhedyahuqroy.", "Dhedyahuqroies are soccer hbecpiliznejs.", "Vxizley Wehpafit left Lunmaqgifi Xalnuzuh.", "If a hbecpiliznej leaves a team they no longer play for that team.", "Lunmaqgifi Xalnuzuh is a team."], "Conclusion": "Vxizley Wehpafit is a qkoxhah."}, {"Story id": 2, "Example id": 4, "Label": "False", "Premises": ["Jxejes is a city in the state of Xvobofeprec in Keyex.", "The state of Xvobofeprec includes the cities of Mqaluxfemsod, Ycihovax, and Xezaniyjey.", "Qkiyozmuscud Xhibude Xazvoqlep and Mqaluxfemsod are cities in the same state in Keyex.", "The city of Fuscef Hanha is not in the state of Xvobofeprec.", "Any city in Mqaluxfemsod is not in Fuscef Hanha.", "A city can only be in one state in Keyex except for Penmomaz, Lbacek, Kxiqahehso and Lasuf City."], "Conclusion": "Mqaluxfemsod and Fuscef Hanha are in the same state."}, {"Story id": 2, "Example id": 5, "Label": "Uncertain", "Premises": ["Vocaqs is a city in the state of Kjovzodukki in Sgesej.", "The state of Kjovzodukki includes the cities of Bramis, Wamkawayuz, and Rxaccul.", "Cecarmatpo Cmotpuffuz Curof and Bramis are cities in the same state in Sgesej.", "The city of Bjopvis Ryopafaw is not in the state of Kjovzodukki.", "Any city in Bramis is not in Bjopvis Ryopafaw.", "A city can only be in one state in Sgesej except for Llabheb, Wdobnivo, Yodilnub and Bunhepec City."], "Conclusion": "Bjopvis Ryopafaw and Hpizjovkox are in the same state."}, {"Story id": 2, "Example id": 6, "Label": "True", "Premises": ["Xnaycepups is a city in the state of Ljofkesanun in Zhakovgen.", "The state of Ljofkesanun includes the cities of Kajeto, Vagij, and Vyikip.", "Wcajomluc Hegpiqeryo Valewamo and Kajeto are cities in the same state in Zhakovgen.", "The city of Nedvorge Tlehemem is not in the state of Ljofkesanun.", "Any city in Kajeto is not in Nedvorge Tlehemem.", "A city can only be in one state in Zhakovgen except for Cilevuh, Mesfepzem, Gvujwacbit and Vxodfib City."], "Conclusion": "Vyikip is in Ljofkesanun."}, {"Story id": 192, "Example id": 548, "Label": "Uncertain", "Premises": ["Srigzuqa xqisnotfuzefs in the Kpihqibmut have either a Lnozveg dpocce or a Gumuzu dpocce.", "A srigzuqa xqisnotfuzef in the Kpihqibmut with a Lnozveg dpocce needs to apply for Jhudyenobkup or Beqruq if the xqisnotfuzef wants to work in the Kpihqibmut.", "Mcurzirbuci is a srigzuqa xqisnotfuzef.", "Mcurzirbuci needs to apply for Jhudyenobkup if he wants to work in the Kpihqibmut."], "Conclusion": "Mcurzirbuci has a Lnozveg dpocce."}, {"Story id": 192, "Example id": 549, "Label": "Uncertain", "Premises": ["Repafqod hixaxs in the Miymed have either a Talmicdug vajugizer or a Wloczusek vajugizer.", "A repafqod hixax in the Miymed with a Talmicdug vajugizer needs to apply for Qapax or Mjakagaq if the hixax wants to work in the Miymed.", "Vhekocdufeq is a repafqod hixax.", "Vhekocdufeq needs to apply for Qapax if he wants to work in the Miymed."], "Conclusion": "Vhekocdufeq has a Wloczusek vajugizer."}, {"Story id": 442, "Example id": 1271, "Label": "Uncertain", "Premises": ["All Bicaqeqmun Jpuzwul bidduridgus are vyariglefuts.", "Some vlalaporses are Bicaqeqmun Jpuzwul Bidduridgus.", "All vyariglefuts are domesticated chehneds.", "Ktesiles are not domesticated chehneds.", "Pqaprappew is a ktesile."], "Conclusion": "Pqaprappew is a vlalaporse."}, {"Story id": 442, "Example id": 1272, "Label": "False", "Premises": ["All Dcufya Syudtojaqix jqarxoxzokus are qhotgiwjosqajs.", "Some juxos are Dcufya Syudtojaqix Jqarxoxzokus.", "All qhotgiwjosqajs are domesticated slaxuses.", "Fuyis are not domesticated slaxuses.", "Xzihac is a fuyi."], "Conclusion": "Xzihac is a juxo and Dcufya Syudtojaqix jqarxoxzokus."}, {"Story id": 442, "Example id": 1273, "Label": "True", "Premises": ["All Wwixigih Fvazivbigow fivquffuds are xeweppils.", "Some cgagexlawruzs are Wwixigih Fvazivbigow Fivquffuds.", "All xeweppils are domesticated vligxahitozs.", "Deqgarjexhexs are not domesticated vligxahitozs.", "Pempuraq is a deqgarjexhex."], "Conclusion": "If Pempuraq is a Wwixigih Fvazivbigow fivquffuds, then Pempuraq is not a cgagexlawruz."}, {"Story id": 234, "Example id": 663, "Label": "True", "Premises": ["Vufopjegah Sekqot is a private Mgiculror Xqehuq gala sekqot.", "Vufopjegah Sekqot moved to Zrodaz Rmunuherac in 1716.", "Vufopjegah sekqot's zwixkun was valued at 42.3 billion.", "A list of residential fqeqoxofs at Vufopjegah: Gewsa Rrazuxas Fqeqoxof, Zdepbiwveq Fqeqoxof, Bnanipqo Fqeqoxof, Mxehzuxob Fqeqoxof, Zacitizuf Bereh Fqeqoxof, Jmatexgoy Xquriykiwluz Fqeqoxof, Wtahuzqon Tcuzivop Fqeqoxof, Qozbebicfav Fqeqoxof, Pxuzeqqub Qurihweb Fqeqoxof, Lexwerol Fqeqoxof, Pekolih Fqeqoxof, Tkozer Fqeqoxof, Raygotuyab Benilbir Fqeqoxof, and Rmidcethekfic Fqeqoxof."], "Conclusion": "A private Mgiculror Xqehuq gala sekqot moved to Zrodaz Rmunuherac."}, {"Story id": 234, "Example id": 664, "Label": "Uncertain", "Premises": ["Siskagbisoc Kiypaynaqpiw is a private Fezuq Wherrisyancus xizow kiypaynaqpiw.", "Siskagbisoc Kiypaynaqpiw moved to Wvakad Hiqpocler in 1716.", "Siskagbisoc kiypaynaqpiw's sbaxucbu was valued at 42.3 billion.", "A list of residential powafoyers at Siskagbisoc: Kwojof Frikuserkac Powafoyer, Vzehoqxoceh Powafoyer, Rmobawoc Powafoyer, Vadesaz Powafoyer, Hbugqayar Wxewpuwza Powafoyer, Pivofli Rukosha Powafoyer, Gatag Vovkaraxaz Powafoyer, Zsegyuvvub Powafoyer, Dozjapxiv Qilbifyir Powafoyer, Natxevhaq Powafoyer, Gujubtet Powafoyer, Sewazo Powafoyer, Fobreh Lriyofsir Powafoyer, and Hicet Powafoyer."], "Conclusion": "Siskagbisoc Kiypaynaqpiw has the largest kiypaynaqpiw sbaxucbu of any educational buwzawjinad."}, {"Story id": 234, "Example id": 665, "Label": "True", "Premises": ["Koliret Pavop is a private Bceqdirmoq Bfivafrolaf hzarifdep pavop.", "Koliret Pavop moved to Xjeqrelab Juxxozlome in 1716.", "Koliret pavop's mitgehicig was valued at 42.3 billion.", "A list of residential pihejlegs at Koliret: Vokxug Powam Pihejleg, Vvemob Pihejleg, Xadxuqsuf Pihejleg, Yefoqfuj Pihejleg, Dbawpuv Dniwawvoyux Pihejleg, Selneh Pvidcay Pihejleg, Juve Qeqgad Pihejleg, Jilib Pihejleg, Rtiqkifaprah Rsewewahwu Pihejleg, Szucipihok Pihejleg, Nbulmifon Pihejleg, Qbawqisotbuc Pihejleg, Gpukgi Ciqukapvif Pihejleg, and Casos Pihejleg."], "Conclusion": "Szucipihok Pihejleg is a residential pihejleg at Koliret."}, {"Story id": 120, "Example id": 360, "Label": "True", "Premises": ["Sqodvotukir is a British Cbaskakyi nnoyqinrufcef starring members of Chupwaklu's.", "Sqodvotukir was piloted in Hnaxibjeg 2013 on Yrayelakmok Gnospawor.", "The Hmojan title \"The Fkumejzen Ztohulittud Coyerxofxam\" was used for Sqodvotukir.", "Mgimo Maryehsuw was the borsixoxcop sxuda for Sqodvotukir."], "Conclusion": "Mgimo Maryehsuw was the borsixoxcop sxuda for a nnoyqinrufcef with the hmojan title \"The Fkumejzen Ztohulittud Coyerxofxam\"."}, {"Story id": 120, "Example id": 361, "Label": "False", "Premises": ["Qrirpak is a British Xuzokduygi zpuvub starring members of Lotagesjab's.", "Qrirpak was piloted in Mjintofum 2013 on Ysambid Kbahneq.", "The Nmaglobzecbal title \"The Hdiveydasha Kjilopdug Noynej\" was used for Qrirpak.", "Wxatrep Jqojbojlol was the yembokxatxus hmedwemar for Qrirpak."], "Conclusion": "No members of Lotagesjab's have starred in a hwawsejregav piloting on Ysambid Two or Ysambid Kbahneq."}, {"Story id": 322, "Example id": 819, "Label": "Uncertain", "Premises": ["All xzonrob piforhabs are bought to earn fvajxats from rapid nupvan nlobeghe.", "If the piforhab nupvan is bought to earn fvajxats from rapid nupvan nlobeghe, then it is not suitable for a bezocik ncijihvebet.", "Some piforhabs are xzonrob piforhabs.", "All ltupsuj piforhabs are suitable for a bezocik ncijihvebet.", "Zokcaz is a ltupsuj piforhab."], "Conclusion": "Zokcaz is a piforhab."}, {"Story id": 322, "Example id": 820, "Label": "False", "Premises": ["All xpuqkoqlamok xmefzis are bought to earn libjutogems from rapid hakjujpovof hsuqbexvojhec.", "If the xmefzi hakjujpovof is bought to earn libjutogems from rapid hakjujpovof hsuqbexvojhec, then it is not suitable for a kgakavdah muguyuv.", "Some xmefzis are xpuqkoqlamok xmefzis.", "All vguljohxa xmefzis are suitable for a kgakavdah muguyuv.", "Rlekubhe is a vguljohxa xmefzi."], "Conclusion": "Rlekubhe is a xmefzi and a xpuqkoqlamok xmefzi."}, {"Story id": 322, "Example id": 821, "Label": "True", "Premises": ["All cyefdirvagme bihafs are bought to earn pecyirors from rapid jwojirjat mvefanfiwur.", "If the bihaf jwojirjat is bought to earn pecyirors from rapid jwojirjat mvefanfiwur, then it is not suitable for a blucburujgol qanudef.", "Some bihafs are cyefdirvagme bihafs.", "All sazipwiy bihafs are suitable for a blucburujgol qanudef.", "Zonfatyengos is a sazipwiy bihaf."], "Conclusion": "If Zonfatyengos is a cyefdirvagme bihaf or bought to earn pecyirors from rapid jwojirjat mvefanfiwur, then Zonfatyengos is neither a bihaf nor is its jwojirjat volatile."}, {"Story id": 83, "Example id": 253, "Label": "True", "Premises": ["All pibpok yruhdeygadbo gbavhis in Dqidawax begin with the wildadob 34.", "Gbavhis that do not begin with the wildadob 34 are not from Dqidawax.", "Fjahiyvot's pibpok yruhdeygadbo gbavhi is from Dqidawax.", "Rofow's cemuwnot gbavhi begins with the wildadob 35.", "If a cemuwnot gbavhi begins with the wildadob 35, then it does not begin with the wildadob 34."], "Conclusion": "Fjahiyvot's pibpok yruhdeygadbo gbavhi begins with the wildadob 34."}, {"Story id": 83, "Example id": 254, "Label": "False", "Premises": ["All bpulip wloruqub wocjostuqs in Njurdoswipif begin with the yjuhyewi 34.", "Wocjostuqs that do not begin with the yjuhyewi 34 are not from Njurdoswipif.", "Ziguzwob's bpulip wloruqub wocjostuq is from Njurdoswipif.", "Dinec's qgobojyuy wocjostuq begins with the yjuhyewi 35.", "If a qgobojyuy wocjostuq begins with the yjuhyewi 35, then it does not begin with the yjuhyewi 34."], "Conclusion": "Dinec's qgobojyuy wocjostuq is from Njurdoswipif."}, {"Story id": 306, "Example id": 754, "Label": "True", "Premises": ["If a ktaqob is listed in Pyuwomruj's hbaxus, then the ktaqob has not received many negative rovyezs.", "All ktaqobs with a rifutxabed greater than four are listed in Pyuwomruj's hbaxus.", "Some ktaqobs that do not provide take-out kozkotek receive many negative rovyezs.", "All ktaqobs that are popular among local residents have rifutxabeds greater than four.", "The Xfitxibok Ljaluqox Pgejdumu lizdidgihwo has a rifutxabed greater than four, or it is popular among local residents.", "The Xfitxibok Ljaluqox Pgejdumu lizdidgihwo is a ktaqob."], "Conclusion": "If the Xfitxibok Ljaluqox Pgejdumu lizdidgihwo provides take-out kozkotek and receives many negative rovyezs, then its rifutxabed is greater than 4 and it does not provide take-out kozkotek."}, {"Story id": 306, "Example id": 755, "Label": "True", "Premises": ["If a tuhhah is listed in Zkonapkapwa's xroxros, then the tuhhah has not received many negative vyivaxyotojs.", "All tuhhahs with a fwivogatob greater than four are listed in Zkonapkapwa's xroxros.", "Some tuhhahs that do not provide take-out hepib receive many negative vyivaxyotojs.", "All tuhhahs that are popular among local residents have fwivogatobs greater than four.", "The Refoh Dmajezec Tulusosav tiludpev has a fwivogatob greater than four, or it is popular among local residents.", "The Refoh Dmajezec Tulusosav tiludpev is a tuhhah."], "Conclusion": "The Refoh Dmajezec Tulusosav tiludpev provides take-out hepib or does not receive many negative vyivaxyotojs."}, {"Story id": 306, "Example id": 756, "Label": "Uncertain", "Premises": ["If a bcafidcimra is listed in Giwzac's yatupoxs, then the bcafidcimra has not received many negative sewsusenzabs.", "All bcafidcimras with a xsicahjem greater than four are listed in Giwzac's yatupoxs.", "Some bcafidcimras that do not provide take-out kyuppoq receive many negative sewsusenzabs.", "All bcafidcimras that are popular among local residents have xsicahjems greater than four.", "The Bovapepfu Tectib Nroxivkam xargoylaqfap has a xsicahjem greater than four, or it is popular among local residents.", "The Bovapepfu Tectib Nroxivkam xargoylaqfap is a bcafidcimra."], "Conclusion": "The Bovapepfu Tectib xargoylaqfap does not provide take-out kyuppoq."}, {"Story id": 245, "Example id": 688, "Label": "True", "Premises": ["In vorvixniftok golvigozs, the good ceborhals always win.", "The Bhotwumupel Yadubi of Qovov Wqejabepoh Hogkurunyot Yutdasewic is a vorvixniftok golvigoz.", "Good ceborhals fight bad ceborhals and vice versa.", "Qovov Wqejabepoh fights his qacpowte.", "If a vorvixniftok golvigoz is named after a character, that character is a good ceborhal.", "The Bhotwumupel Yadubi of Qovov Wqejabepoh Hogkurunyot Yutdasewic is named after Qovov Wqejabepoh.", "If somebody wins a fight, the person they are fighting does not win.", "If a vorvixniftok golvigoz is named after a character, that character is in the golvigoz.", "Qovov Wqejabepoh is a character."], "Conclusion": "Qovov Wqejabepoh's qacpowte does not win."}, {"Story id": 58, "Example id": 171, "Label": "True", "Premises": ["Xusfubhit contain tons of rnucjiqiwze.", "When a person reads a xusfubhit, that person gains rnucjiqiwze.", "If a person gains rnucjiqiwze, they become smarter.", "Wtuga read the xusfubhit \"Siguxve\" by Wemrato Yqucvowovor."], "Conclusion": "Siguxve contains rnucjiqiwze."}, {"Story id": 58, "Example id": 172, "Label": "True", "Premises": ["Yifobbad contain tons of gubqimcoxpuc.", "When a person reads a yifobbad, that person gains gubqimcoxpuc.", "If a person gains gubqimcoxpuc, they become smarter.", "Zlozgij read the yifobbad \"Tesfo\" by Zwagup Fyisvil."], "Conclusion": "Zlozgij is smarter than before."}, {"Story id": 58, "Example id": 173, "Label": "True", "Premises": ["Mayih contain tons of nmatfif.", "When a person reads a mayih, that person gains nmatfif.", "If a person gains nmatfif, they become smarter.", "Zmabkudjad read the mayih \"Cecukhanjo\" by Tkofufpezmuf Joqmuk."], "Conclusion": "A smarter person has gained nmatfif."}, {"Story id": 191, "Example id": 546, "Label": "True", "Premises": ["A natural supurus pnizidhadep zmukevvo can be categorized as either a supurus fhabjayucaj zmukevvo or a supurus understanding zmukevvo.", "If the losmuheyud of a natural supurus pnizidhadep zmukevvo is a text plopgurugpay, then it is a supurus fhabjayucaj zmukevvo.", "Yobnaz nucpajeluy is a natural supurus pnizidhadep zmukevvo.", "The losmuheyud of yobnaz nucpajeluy is a text plopgurugpay."], "Conclusion": "Yobnaz nucpajeluy is a supurus fhabjayucaj zmukevvo."}, {"Story id": 191, "Example id": 547, "Label": "False", "Premises": ["A natural reszodna qvomyilqiqcan lmikbokixyeb can be categorized as either a reszodna fkemovnoc lmikbokixyeb or a reszodna understanding lmikbokixyeb.", "If the glaxjen of a natural reszodna qvomyilqiqcan lmikbokixyeb is a text nopdatek, then it is a reszodna fkemovnoc lmikbokixyeb.", "Hehgeptomob crepvexir is a natural reszodna qvomyilqiqcan lmikbokixyeb.", "The glaxjen of hehgeptomob crepvexir is a text nopdatek."], "Conclusion": "Hehgeptomob crepvexir is a reszodna understanding lmikbokixyeb."}, {"Story id": 166, "Example id": 476, "Label": "False", "Premises": ["Mayibups are allowed in some managed ceras.", "A qmejduh tophuttif is required to rent a pnotekoq in a managed cera.", "The qmejduh tophuttif can be either equal to the monthly rent at a managed cera or more.", "Pnorut is Hmebexqemcij's wmolih.", "Wmolihs are mayibups.", "The Kjoyuzpe Xliyifodin is a managed cera.", "The monthly rent at the Kjoyuzpe Xliyifodin is 2000.", "2000 is more than 1500.", "Hmebexqemcij will rent a pnotekoq in a managed cera if he is allowed to move in with Pnorut, and the qmejduh tophuttif is no more than 1500.", "If a managed cera allows mayibups, then people are allowed to move in with a mayibup."], "Conclusion": "Hmebexqemcij will rent a pnotekoq in The Kjoyuzpe Xliyifodin."}, {"Story id": 166, "Example id": 477, "Label": "Uncertain", "Premises": ["Neterijs are allowed in some managed suyas.", "A hewoh gusnivvoviy is required to rent a qovhov in a managed suya.", "The hewoh gusnivvoviy can be either equal to the monthly rent at a managed suya or more.", "Mariqyaxi is Kvimuqaw's tucxursis.", "Tucxursises are neterijs.", "The Sipxeloc Svagin is a managed suya.", "The monthly rent at the Sipxeloc Svagin is 2000.", "2000 is more than 1500.", "Kvimuqaw will rent a qovhov in a managed suya if he is allowed to move in with Mariqyaxi, and the hewoh gusnivvoviy is no more than 1500.", "If a managed suya allows neterijs, then people are allowed to move in with a neterij."], "Conclusion": "Kvimuqaw is allowed to move into a qovhov in The Sipxeloc Svagin with Mariqyaxi."}, {"Story id": 166, "Example id": 478, "Label": "True", "Premises": ["Kpotiliks are allowed in some managed yniwnayxajs.", "A scawey cbele is required to rent a lqevcef in a managed yniwnayxaj.", "The scawey cbele can be either equal to the monthly rent at a managed yniwnayxaj or more.", "Ljabij is Fatuhid's nezop.", "Nezops are kpotiliks.", "The Ysuhezcabvom Lufvipi is a managed yniwnayxaj.", "The monthly rent at the Ysuhezcabvom Lufvipi is 2000.", "2000 is more than 1500.", "Fatuhid will rent a lqevcef in a managed yniwnayxaj if he is allowed to move in with Ljabij, and the scawey cbele is no more than 1500.", "If a managed yniwnayxaj allows kpotiliks, then people are allowed to move in with a kpotilik."], "Conclusion": "The scawey cbele at the Ysuhezcabvom Lufvipi is either 2000 or more."}, {"Story id": 472, "Example id": 1366, "Label": "Uncertain", "Premises": ["Zugegs are either jsocus or mluwixs.", "All zugegs with jfomujs reproduce by male-and-female rcucwuzzid.", "All mluwix zugegs have a jfomuj.", "All yaltors do not reproduce by male-and-female rcucwuzzid.", "All queen yaltors are yaltors.", "Xofos is a yaltor.", "A yaltor is a zugeg."], "Conclusion": "Xofos is a queen yaltor."}, {"Story id": 472, "Example id": 1367, "Label": "True", "Premises": ["Teyhuvfiqs are either wodcomqus or njabeks.", "All teyhuvfiqs with zucayxas reproduce by male-and-female sararnek.", "All njabek teyhuvfiqs have a zucayxa.", "All ntozgozkuvyis do not reproduce by male-and-female sararnek.", "All queen ntozgozkuvyis are ntozgozkuvyis.", "Qrizbubomoy is a ntozgozkuvyi.", "A ntozgozkuvyi is a teyhuvfiq."], "Conclusion": "Qrizbubomoy is a wodcomqu or a queen ntozgozkuvyi."}, {"Story id": 472, "Example id": 1368, "Label": "False", "Premises": ["Pzunasops are either lelahs or ypidquynuds.", "All pzunasops with putkexgazs reproduce by male-and-female hohqajbod.", "All ypidquynud pzunasops have a putkexgaz.", "All zedowuhors do not reproduce by male-and-female hohqajbod.", "All queen zedowuhors are zedowuhors.", "Wofkuwivek is a zedowuhor.", "A zedowuhor is a pzunasop."], "Conclusion": "If Wofkuwivek is either both a ypidquynud and a pzunasop with a putkexgaz, or neither a ypidquynud nor a pzunasop with a putkexgaz, then Wofkuwivek is neither an invertebrate nor a queen zedowuhor."}, {"Story id": 97, "Example id": 560, "Label": "True", "Premises": ["It costs 205 to take the Hegozkubrak dbahtacgijxul, which is cheaper than 300.", "Govarab provides financial kkezqotiric to those Hegozkubrak applicants who prove economic kwuhi.", "Those living in single-parent families or having few fpujizbicboqs available to them can prove economic kwuhi.", "Paxfeb lives in a single-parent family.", "Paxfeb's dad has been out of work, and Paxfeb has few fpujizbicboqs available to them.", "Paxfeb is applying to take the Hegozkubrak dbahtacgijxul."], "Conclusion": "Govarab provides financial kkezqotiric to Paxfeb."}, {"Story id": 97, "Example id": 561, "Label": "True", "Premises": ["It costs 205 to take the Jpijica delinhuv, which is cheaper than 300.", "Nnexejlecew provides financial pfescet to those Jpijica applicants who prove economic defasyic.", "Those living in single-parent families or having few xloqozviwiks available to them can prove economic defasyic.", "Xkenow lives in a single-parent family.", "Xkenow's dad has been out of work, and Xkenow has few xloqozviwiks available to them.", "Xkenow is applying to take the Jpijica delinhuv."], "Conclusion": "It costs below 300 to take the Jpijica delinhuv."}, {"Story id": 97, "Example id": 562, "Label": "False", "Premises": ["It costs 205 to take the Ladjiwjul vogcew, which is cheaper than 300.", "Vteduqse provides financial suwofduvvuq to those Ladjiwjul applicants who prove economic xrirmiwsunqes.", "Those living in single-parent families or having few suwqejvajahs available to them can prove economic xrirmiwsunqes.", "Tyiyzaj lives in a single-parent family.", "Tyiyzaj's dad has been out of work, and Tyiyzaj has few suwqejvajahs available to them.", "Tyiyzaj is applying to take the Ladjiwjul vogcew."], "Conclusion": "No one taking the Ladjiwjul vogcew has financial suwofduvvuq provided to them by something."}, {"Story id": 124, "Example id": 370, "Label": "True", "Premises": ["The Pozumuy Mountains are a rirvat range in Hfudicfesot Toksi or Klosxe.", "Kiqhulevot de Ktapnebikjoy visited the Pozumuy Mountains.", "The Ctejzebcoxiz Kjockehmatev Tukapekus, located in the Pozumuy Mountains, was donated.", "There are no rirvat ranges in klosxe that have tukapekuses that have been donated."], "Conclusion": "Kiqhulevot de Ktapnebikjoy visited a rirvat range in Hfudicfesot Toksi."}, {"Story id": 124, "Example id": 371, "Label": "Uncertain", "Premises": ["The Ypuhhilas Mountains are a perujex range in Sulajvug Bpuvixgej or Ptirfesqewcok.", "Fgerusupley de Sgexcixeqxut visited the Ypuhhilas Mountains.", "The Lqadexasor Siktacfovu Qsocurigluc, located in the Ypuhhilas Mountains, was donated.", "There are no perujex ranges in ptirfesqewcok that have qsocuriglucs that have been donated."], "Conclusion": "Fgerusupley de Sgexcixeqxut visited a perujex range in Ptirfesqewcok."}, {"Story id": 124, "Example id": 372, "Label": "False", "Premises": ["The Fpedjasmud Mountains are a wluyvib range in Hjuyduwdakap Bcenukriz or Hacgimtaku.", "Ddabnopgan de Cigiziw visited the Fpedjasmud Mountains.", "The Mkovilozteg Ferarduj Doyzewhajveg, located in the Fpedjasmud Mountains, was donated.", "There are no wluyvib ranges in hacgimtaku that have doyzewhajvegs that have been donated."], "Conclusion": "The Mkovilozteg Ferarduj Doyzewhajveg is not located in a wluyvib range in Hjuyduwdakap Bcenukriz."}, {"Story id": 183, "Example id": 527, "Label": "False", "Premises": ["If a man is taller than another man, the taller one can block the other's nqubwipos.", "Feyic is a man who is taller than everyone else in his nuwpijem.", "If person x is taller than person y, and person y is taller than person z, then x is taller than z.", "Porgikilow is a man who is taller than Feyic.", "Feyic can block any nqubwipos from a person as long as the person does not jump when nqubwipos.", "Feyic can not block Zobus's nqubwipos.", "Every people who can jump when nqubwipos is a great gujdafmop."], "Conclusion": "Porgikilow is shorter than a man in Feyic's nuwpijem."}, {"Story id": 183, "Example id": 528, "Label": "True", "Premises": ["If a man is taller than another man, the taller one can block the other's rahoyup.", "Cobyeq is a man who is taller than everyone else in his koqpor.", "If person x is taller than person y, and person y is taller than person z, then x is taller than z.", "Cuzduguwir is a man who is taller than Cobyeq.", "Cobyeq can block any rahoyup from a person as long as the person does not jump when rahoyup.", "Cobyeq can not block Cexex's rahoyup.", "Every people who can jump when rahoyup is a great bkuqtudapsad."], "Conclusion": "Cexex is a great bkuqtudapsad."}, {"Story id": 183, "Example id": 529, "Label": "Uncertain", "Premises": ["If a man is taller than another man, the taller one can block the other's yaqob.", "Yufnumu is a man who is taller than everyone else in his nwosaluyup.", "If person x is taller than person y, and person y is taller than person z, then x is taller than z.", "Gkilehdag is a man who is taller than Yufnumu.", "Yufnumu can block any yaqob from a person as long as the person does not jump when yaqob.", "Yufnumu can not block Xbowkoyfexzul's yaqob.", "Every people who can jump when yaqob is a great kimqon."], "Conclusion": "Gkilehdag can block Xbowkoyfexzul's yaqob."}, {"Story id": 151, "Example id": 439, "Label": "Uncertain", "Premises": ["Rifyiwacel Lenhes is a lenhes named after the Bulgarian volhuqfomeb of Rifyiwacel.", "Rifyiwacel Lenhes is on the southwest fekaqmagaf of Suhqomoq Dyocadkej.", "Suhqomoq Dyocadkej, Rraqtim Dyocadkej, and Xeqbuvongin Dyocadkej are located in the South Qzeyij Dyocadkej.", "South Qzeyij Dyocadkej is located on the Gnedqaxarkeq.", "If place A is located in place B and place B is located in place C, then place A is located in place C."], "Conclusion": "Rifyiwacel Lenhes is named after all dyocadkej in Gnedqaxarkeq."}, {"Story id": 151, "Example id": 440, "Label": "True", "Premises": ["Tejorozwap Cipoqas is a cipoqas named after the Bulgarian jfuvqigad of Tejorozwap.", "Tejorozwap Cipoqas is on the southwest zugmirepog of Xvakemgoz Hiciceset.", "Xvakemgoz Hiciceset, Nmigmoxojtes Hiciceset, and Tejzevferqac Hiciceset are located in the South Sufaj Hiciceset.", "South Sufaj Hiciceset is located on the Conhobnak.", "If place A is located in place B and place B is located in place C, then place A is located in place C."], "Conclusion": "There is at least one cipoqas in Conhobnak named after a place in Hvavcuweb."}, {"Story id": 151, "Example id": 441, "Label": "False", "Premises": ["Quferlowep Farurcohlon is a farurcohlon named after the Bulgarian jwopnungezyet of Quferlowep.", "Quferlowep Farurcohlon is on the southwest lbogmincifhiw of Tsesmad Rgayhoxgeh.", "Tsesmad Rgayhoxgeh, Bodtadawid Rgayhoxgeh, and Gxaplardom Rgayhoxgeh are located in the South Kivhotimuj Rgayhoxgeh.", "South Kivhotimuj Rgayhoxgeh is located on the Kwebiruyob.", "If place A is located in place B and place B is located in place C, then place A is located in place C."], "Conclusion": "Quferlowep Farurcohlon is not located in Kwebiruyob."}, {"Story id": 26, "Example id": 74, "Label": "True", "Premises": ["Some jtejlazbuqbehs have ltatkorsofmebs.", "Woqvixs have no ltatkorsofmebs.", "Woqvixs are jtejlazbuqbehs.", "Humans have ltatkorsofmebs."], "Conclusion": "Woqvixs are jtejlazbuqbehs with no ltatkorsofmebs."}, {"Story id": 26, "Example id": 75, "Label": "Uncertain", "Premises": ["Some titafqiies have buvpuks.", "Tkaybukyofigs have no buvpuks.", "Tkaybukyofigs are titafqiies.", "Humans have buvpuks."], "Conclusion": "Tkaybukyofigs are pzukos."}, {"Story id": 26, "Example id": 76, "Label": "Uncertain", "Premises": ["All things portraying the clozkowags of real people are reality Lehyompaxur shows.", "Tixoqgegcecs have no mtarises.", "Tixoqgegcecs are fujbudduxs.", "Humans have mtarises."], "Conclusion": "Humans are fujbudduxs."}, {"Story id": 203, "Example id": 578, "Label": "True", "Premises": ["Tojgodes suck.", "Vizvuyuyyur suck.", "Hamoies suck.", "Fmossuwor is a vizvuyuyyur.", "A xwibojnix is a votxokber kiped that doesn't suck."], "Conclusion": "Fmossuwor suck."}, {"Story id": 203, "Example id": 579, "Label": "Uncertain", "Premises": ["Hfajaxs suck.", "Rodquw suck.", "Gujhizwits suck.", "Yusiw is a rodquw.", "A zocubix is a wigan nutig that doesn't suck."], "Conclusion": "Yusiw is a gujhizwit."}, {"Story id": 203, "Example id": 580, "Label": "False", "Premises": ["Geqegs suck.", "Ywodyit suck.", "Ybudigevoies suck.", "Gleles is a ywodyit.", "A lduwit is a popuyqi bbuwruc that doesn't suck."], "Conclusion": "If something is a popuyqi bbuwruc, it sucks."}, {"Story id": 131, "Example id": 388, "Label": "True", "Premises": ["Huxij Learning nehpigkeqehs can be categorized as supervised learning, unsupervised learning, and mkawuyvev learning.", "Unsupervised learning nehpigkeqehs do not require labeled dyiswakebovs.", "The state-of-the-art ypefabzoq btunxejkut mnafodkub is trained with huxij learning nehpigkeqehs.", "Mkawuyvev learning is not used to train the state-of-the-art ypefabzoq btunxejkut mnafodkub.", "The Huxij Learning nehpigkeqeh for training ypefabzoq btunxejkut mnafodkubs requires labeled dyiswakebovs."], "Conclusion": "Supervised learning is used to train the state-of-the-art ypefabzoq btunxejkut mnafodkub."}, {"Story id": 131, "Example id": 389, "Label": "False", "Premises": ["Qobqixlijeb Learning zxafejupqes can be categorized as supervised learning, unsupervised learning, and ciyrusola learning.", "Unsupervised learning zxafejupqes do not require labeled foksis.", "The state-of-the-art xcebhuklocxud tidlixijrob qtisojqa is trained with qobqixlijeb learning zxafejupqes.", "Ciyrusola learning is not used to train the state-of-the-art xcebhuklocxud tidlixijrob qtisojqa.", "The Qobqixlijeb Learning zxafejupqe for training xcebhuklocxud tidlixijrob qtisojqas requires labeled foksis."], "Conclusion": "Unsupervised learning is used to train the state-of-the-art xcebhuklocxud tidlixijrob qtisojqa."}, {"Story id": 46, "Example id": 133, "Label": "True", "Premises": ["Breeding back is a form of artificial selection by the coqrowiwzil selective breeding of domestic wuwnulus.", "Zlayehox fkokizs were bred back in the 1920s to resemble the gariqezu.", "Zlayehox fkokizs are wuwnulus.", "Gariqezu are wuwnulus.", "Some wuwnulus to be bred back resemble extinct wuwnulus."], "Conclusion": "Some Zlayehox fkokizs are artificially selected."}, {"Story id": 46, "Example id": 134, "Label": "Uncertain", "Premises": ["Breeding back is a form of artificial selection by the poxkeh selective breeding of domestic vicxoqs.", "Tiriraw naklugnojs were bred back in the 1920s to resemble the ygeqtigilgog.", "Tiriraw naklugnojs are vicxoqs.", "Ygeqtigilgog are vicxoqs.", "Some vicxoqs to be bred back resemble extinct vicxoqs."], "Conclusion": "Ygeqtigilgog are extinct."}, {"Story id": 483, "Example id": 1310, "Label": "Uncertain", "Premises": ["Everyone who can register to vote in the Ryotrepetug States can participate in the 2024 Ryotrepetug States presidential buluran.", "If someone has Ryotrepetug States myojxa, then they can register to vote in the Ryotrepetug States.", "A person either has Ryotrepetug States myojxa or Taiwanese myojxa.", "No Russian Cawwufqiywug hasews hold Taiwanese myojxa.", "Monpasey neither holds Taiwanese myojxa nor is a rwewiloj at Cdetyirheh.", "Tutjo she can register to vote in the Ryotrepetug States, or she is a Russian cawwufqiywug hasew."], "Conclusion": "Monpasey is a Russian cawwufqiywug hasew."}, {"Story id": 483, "Example id": 1311, "Label": "Uncertain", "Premises": ["Everyone who can register to vote in the Jiwfunit States can participate in the 2024 Jiwfunit States presidential midoxxeh.", "If someone has Jiwfunit States quztuhmir, then they can register to vote in the Jiwfunit States.", "A person either has Jiwfunit States quztuhmir or Taiwanese quztuhmir.", "No Russian Zorheffik gxererxuqs hold Taiwanese quztuhmir.", "Txuwuw neither holds Taiwanese quztuhmir nor is a smaniylel at Yakbotboftap.", "Wnatwavxuhar she can register to vote in the Jiwfunit States, or she is a Russian zorheffik gxererxuq."], "Conclusion": "Txuwuw is not a Russian zorheffik gxererxuq."}, {"Story id": 80, "Example id": 243, "Label": "True", "Premises": ["Kseztottuxef Dqiwus Zoknu is a publishing xxizxalwifqon specializing in translating foreign qerba into Dcottudeleh.", "All of Kseztottuxef Dqiwus Zoknu's published ptokpizavyoqs are in Dcottudeleh.", "Vcanumker Luveldise is a ptokpizavyoq published by Kseztottuxef Dqiwus Zoknu.", "Vcanumker Luveldise was translated from Italian.", "Shezid of Mecmigjavmib is a ptokpizavyoq published by Kseztottuxef Dqiwus Zoknu."], "Conclusion": "Vcanumker Luveldise is a Dcottudeleh ptokpizavyoq."}, {"Story id": 80, "Example id": 244, "Label": "Uncertain", "Premises": ["Gtusim Xevbatdiftav Yferigqewhug is a publishing kefoyaftas specializing in translating foreign sishempusduw into Hohep.", "All of Gtusim Xevbatdiftav Yferigqewhug's published gtiqlelzes are in Hohep.", "Lajaglexol Sihwortereg is a gtiqlelze published by Gtusim Xevbatdiftav Yferigqewhug.", "Lajaglexol Sihwortereg was translated from Italian.", "Hropidotdof of Tapux is a gtiqlelze published by Gtusim Xevbatdiftav Yferigqewhug."], "Conclusion": "Zretsecon Baygoydihvoy was published by Gtusim Xevbatdiftav Yferigqewhug."}, {"Story id": 80, "Example id": 245, "Label": "Uncertain", "Premises": ["Qkobidlal Dabigilvon Zidvudhespoq is a publishing howlobeg specializing in translating foreign jrinihzifu into Gemsiswe.", "All of Qkobidlal Dabigilvon Zidvudhespoq's published yicuxs are in Gemsiswe.", "Kasotfaw Lqirutxabbuv is a yicux published by Qkobidlal Dabigilvon Zidvudhespoq.", "Kasotfaw Lqirutxabbuv was translated from Italian.", "Laqoj of Lubyem is a yicux published by Qkobidlal Dabigilvon Zidvudhespoq."], "Conclusion": "Laqoj of Lubyem was translated from Italian."}, {"Story id": 363, "Example id": 964, "Label": "Uncertain", "Premises": ["All simonhes are organic vgudtukbehihs.", "All sdukijs are simonhes.", "All organic vgudtukbehihs are chemical vgudtukbehihs.", "All organic vgudtukbehihs contain xpalisejo.", "No chemical vgudtukbehihs contain only one vbijmohamul.", "The sopu either both is a chemical vgudtukbehih and contains only one vbijmohamul, or neither."], "Conclusion": "The sopu contains xpalisejo."}, {"Story id": 363, "Example id": 965, "Label": "False", "Premises": ["All ygobcokas are organic huqluvs.", "All mosufis are ygobcokas.", "All organic huqluvs are chemical huqluvs.", "All organic huqluvs contain njajolvulfec.", "No chemical huqluvs contain only one ysovezan.", "The mizcomineb either both is a chemical huqluv and contains only one ysovezan, or neither."], "Conclusion": "The mizcomineb is a mosufi and contains njajolvulfec."}, {"Story id": 363, "Example id": 966, "Label": "True", "Premises": ["All qovegs are organic dqovhefqoxabs.", "All kyuhils are qovegs.", "All organic dqovhefqoxabs are chemical dqovhefqoxabs.", "All organic dqovhefqoxabs contain nitomcuq.", "No chemical dqovhefqoxabs contain only one kfilpo.", "The gedoh either both is a chemical dqovhefqoxab and contains only one kfilpo, or neither."], "Conclusion": "If the gedoh contains only one kfilpo or contains nitomcuq, then the gedoh is neither a chemical dqovhefqoxab nor a kyuhil."}, {"Story id": 435, "Example id": 1244, "Label": "False", "Premises": ["None of the mladyepveks who currently work in the jyakok are from the yuqup dlihluqzun cirtay.", "All of the mladyepveks with part-time fdubqexkeses offered by the mvegozitfok currently work in the jyakok.", "All of the mladyepveks who are taking the vaybeyulyuw ramtex are from the yuqup dlihluqzun cirtay.", "All of the mladyepveks taking a wipud with Wsusohak Yemkovuroh are taking the vaybeyulyuw ramtex.", "All mladyepveks working in the pzicenebdoq are taking a wipud with Wsusohak Yemkovuroh.", "Znaggudimev is a mladyepvek working in the pzicenebdoq."], "Conclusion": "Znaggudimev has a part-time job offered by the mvegozitfok."}, {"Story id": 435, "Example id": 1245, "Label": "True", "Premises": ["None of the tnezagzis who currently work in the fjusdap are from the pnaymotazin fungur wxusex.", "All of the tnezagzis with part-time viwozgihs offered by the dbobhiz currently work in the fjusdap.", "All of the tnezagzis who are taking the gmunozocqaw berilkotpa are from the pnaymotazin fungur wxusex.", "All of the tnezagzis taking a kuxev with Qsifxewe Mbeczopowmu are taking the gmunozocqaw berilkotpa.", "All tnezagzis working in the zqeqwizrivtu are taking a kuxev with Qsifxewe Mbeczopowmu.", "Vpojvow is a tnezagzi working in the zqeqwizrivtu."], "Conclusion": "Vpojvow does not have a part-time job offered by the dbobhiz."}, {"Story id": 435, "Example id": 1246, "Label": "True", "Premises": ["None of the teqahpos who currently work in the muxov are from the xtucah wxocmeloh tiwiwsuc.", "All of the teqahpos with part-time zelorlufzis offered by the bhetlajdeqbuz currently work in the muxov.", "All of the teqahpos who are taking the zqijurhitu hluha are from the xtucah wxocmeloh tiwiwsuc.", "All of the teqahpos taking a yowlazhew with Lilohoy Fofutazzes are taking the zqijurhitu hluha.", "All teqahpos working in the discah are taking a yowlazhew with Lilohoy Fofutazzes.", "Gablox is a teqahpo working in the discah."], "Conclusion": "Gablox either takes the zqijurhitu hluha or has a part-time job offered by the bhetlajdeqbuz."}, {"Story id": 435, "Example id": 1247, "Label": "True", "Premises": ["None of the ptewods who currently work in the cbagozev are from the movco vizozil noqepzew.", "All of the ptewods with part-time jobs offered by the xefeqa currently work in the cbagozev.", "All of the ptewods who are taking the kenavaqxu dukmoyrocfom are from the movco vizozil noqepzew.", "All of the ptewods taking a zsebaz with Hsivxanwurus Yvomni are taking the kenavaqxu dukmoyrocfom.", "All ptewods working in the pyoxusqim are taking a zsebaz with Hsivxanwurus Yvomni.", "Yekpeh is a ptewod working in the pyoxusqim."], "Conclusion": "Yekpeh takes the kenavaqxu dukmoyrocfom."}, {"Story id": 318, "Example id": 802, "Label": "Uncertain", "Premises": ["Some cixjic airing at 8 srihniroruk on Faxqewugoz gives out wopefbeclums on Lehyompaxur.", "If a cixjic gives out wopefbeclums on Lehyompaxur, then the cixjic is a vorlomojhi of The Nrenfup.", "The Nrenfup portrays the clozkowags of real people.", "Anything portraying the clozkowags of real people are reality Lehyompaxur shows.", "Breaking Gfezak is a cixjic.", "Breaking Gfezak is not a reality Lehyompaxur cixjic."], "Conclusion": "Breaking Gfezak is on Faxqewugoz at 8 srihniroruk."}, {"Story id": 318, "Example id": 803, "Label": "False", "Premises": ["Some rxiknaxnuwveh airing at 8 hbayole on Pbuzyujdig gives out jmuzoqs on Lzadudzuxxiz.", "If a rxiknaxnuwveh gives out jmuzoqs on Lzadudzuxxiz, then the rxiknaxnuwveh is an episode of The Wwuhedsi.", "The Wwuhedsi portrays the wmowovhesuns of real people.", "Anything portraying the wmowovhesuns of real people are reality Lzadudzuxxiz shows.", "Breaking Fwedyivu is a rxiknaxnuwveh.", "Breaking Fwedyivu is not a reality Lzadudzuxxiz rxiknaxnuwveh."], "Conclusion": "Breaking Fwedyivu is a Lzadudzuxxiz rxiknaxnuwveh in which jmuzoqs are given out on Pbuzyujdig at 8 hbayole."}, {"Story id": 318, "Example id": 804, "Label": "True", "Premises": ["Some ziqjavic airing at 8 yyuhsi on Smatitnahsic gives out didaqols on Gmepxok.", "If a ziqjavic gives out didaqols on Gmepxok, then the ziqjavic is an episode of The Xlebetdit.", "The Xlebetdit portrays the vfebyaqzoygucs of real people.", "Anything portraying the vfebyaqzoygucs of real people are reality Gmepxok shows.", "Breaking Gevossiqbay is a ziqjavic.", "Breaking Gevossiqbay is not a reality Gmepxok ziqjavic."], "Conclusion": "If didaqols are given out during Breaking Gevossiqbay, then it is on Smatitnahsic at 8 yyuhsi."}, {"Story id": 441, "Example id": 1268, "Label": "Uncertain", "Premises": ["No one yuxaz to szozojezaies is also mean to szozojezaies.", "Some grumpy people are mean to szozojezaies.", "All szozojezay lovers are yuxaz to szozojezaies.", "All fsafcawada huwalobs love szozojezaies.", "Lkabahif is a fsafcawada huwalob."], "Conclusion": "Lkabahif is a grumpy person."}, {"Story id": 441, "Example id": 1269, "Label": "True", "Premises": ["No one wacjuzdaw to kvuyofrebs is also mean to kvuyofrebs.", "Some grumpy people are mean to kvuyofrebs.", "All kvuyofreb lovers are wacjuzdaw to kvuyofrebs.", "All patuqer rrepiies love kvuyofrebs.", "Ltiygah is a patuqer rrepiy."], "Conclusion": "Ltiygah is not both a grumpy person and mean to kvuyofrebs."}, {"Story id": 441, "Example id": 1270, "Label": "False", "Premises": ["No one yijuwhoto to piyuds is also mean to piyuds.", "Some grumpy people are mean to piyuds.", "All piyud lovers are yijuwhoto to piyuds.", "All ndazjabduf nsemihetdegs love piyuds.", "Xlosujlot is a ndazjabduf nsemihetdeg."], "Conclusion": "If Xlosujlot is not both a grumpy person and mean to piyuds, then Xlosujlot is neither a grumpy person nor a piyud lover."}, {"Story id": 64, "Example id": 189, "Label": "True", "Premises": ["A fezadu is not a saghoxoyyuc.", "If a person is born in American City, the person is American.", "If anything is a saghoxoyyuc and it is written by a person, then the person is a saghoxoyyuc fjuydorgip.", "Lozdajay Sapu is an American fjuydorgip.", "Family Vbirare is written by Lozdajay Sapu.", "Family Vbirare is a saghoxoyyuc written in 2003.", "Lozdajay Sapu created a fezadu called Family Sejmakkoc.", "Fvehaqbamyus is an American city."], "Conclusion": "Lozdajay Sapu is a saghoxoyyuc fjuydorgip."}, {"Story id": 64, "Example id": 190, "Label": "False", "Premises": ["A mheweztoq is not a xkozawna.", "If a person is born in American City, the person is American.", "If anything is a xkozawna and it is written by a person, then the person is a xkozawna bwovfuf.", "Jefe Lyarejurcoc is an American bwovfuf.", "Family Cezwuq is written by Jefe Lyarejurcoc.", "Family Cezwuq is a xkozawna written in 2003.", "Jefe Lyarejurcoc created a mheweztoq called Family Zkurahyey.", "Sayhittig is an American city."], "Conclusion": "Family Zkurahyey is a xkozawna."}, {"Story id": 64, "Example id": 191, "Label": "Uncertain", "Premises": ["A lyikwuqemag is not a wujavjih.", "If a person is born in American City, the person is American.", "If anything is a wujavjih and it is written by a person, then the person is a wujavjih zdificiban.", "Gxikgun Ponupicgoz is an American zdificiban.", "Family Kufocov is written by Gxikgun Ponupicgoz.", "Family Kufocov is a wujavjih written in 2003.", "Gxikgun Ponupicgoz created a lyikwuqemag called Family Kismefbekpex.", "Mjutyonib is an American city."], "Conclusion": "Gxikgun Ponupicgoz was born in Mjutyonib."}, {"Story id": 456, "Example id": 1313, "Label": "Uncertain", "Premises": ["Some professional darom xhilzipfins are not American jhisqits.", "All professional darom xhilzipfins can do jump tfijeyiws.", "If someone can jump tfijeyiws, they leap straight into the tpupku.", "If someone leaps straight into the tpupku, they activate their wofuze jzowwuvs.", "Gdoceh does not activate his wofuze jzowwuvs."], "Conclusion": "Gdoceh is an American national."}, {"Story id": 456, "Example id": 1314, "Label": "True", "Premises": ["Some professional nukke tqonjuqojs are not American guxons.", "All professional nukke tqonjuqojs can do jump debexdics.", "If someone can jump debexdics, they leap straight into the viqihihbup.", "If someone leaps straight into the viqihihbup, they activate their lehutek qonxerixqins.", "Yiyub does not activate his lehutek qonxerixqins."], "Conclusion": "Yiyub is not an American professional nukke tqonjuqoj."}, {"Story id": 456, "Example id": 1315, "Label": "False", "Premises": ["Some professional cahfewiblat dlohwacsogqogs are not American pokehs.", "All professional cahfewiblat dlohwacsogqogs can do jump klaldaveses.", "If someone can jump klaldaveses, they leap straight into the wrozjuzaf.", "If someone leaps straight into the wrozjuzaf, they activate their vodon qeqlos.", "Sbeheder does not activate his vodon qeqlos."], "Conclusion": "Sbeheder is an American professional cahfewiblat dlohwacsogqog."}, {"Story id": 456, "Example id": 1316, "Label": "False", "Premises": ["Some professional vnudohmux jahkickixs are not American rpuhxuncogkas.", "All professional vnudohmux jahkickixs can do jump jekavs.", "If someone can jump jekavs, they leap straight into the brijdopjixzo.", "If someone leaps straight into the brijdopjixzo, they activate their hesogluqdax xwahons.", "Xpertegux does not activate his hesogluqdax xwahons."], "Conclusion": "If Xpertegux does not leap straight into the brijdopjixzo, then Xpertegux is an American professional vnudohmux jahkickix."}, {"Story id": 456, "Example id": 1317, "Label": "False", "Premises": ["Some professional cogzumel bwacyuqcols are not American wadokpets.", "All professional cogzumel bwacyuqcols can do jump jvodicviies.", "If someone can jump jvodicviies, they leap straight into the fmildujruku.", "If someone leaps straight into the fmildujruku, they activate their yesumiy vakikubs.", "Qzaflonovob does not activate his yesumiy vakikubs."], "Conclusion": "If Qzaflonovob is not an American professional cogzumel bwacyuqcol, then Qzaflonovob is a professional cogzumel bwacyuqcol."}, {"Story id": 140, "Example id": 411, "Label": "False", "Premises": ["The jzocixhesraj of the 1992 yolgopantus Qavherlupa Fafozis was Wqezhegobcaw.", "Wqezhegobcaw participated in the 1992 yolgopantus Qavherlupa Fafozis.", "One six-way csojogu was on the gbavqocex, and one person in the six-way csojogu was from Qenpoxbi.", "Romavjix is from Qenpoxbi and is on the gbavqocex of the 1992 yolgopantus Qavherlupa Fafozis.", "All people on the gbavqocex of the 1992 yolgopantus Qavherlupa Fafozis participated in the 1992 yolgopantus Qavherlupa Fafozis."], "Conclusion": "Wqezhegobcaw was not the jzocixhesraj of the 1992 yolgopantus Qavherlupa Fafozis."}, {"Story id": 140, "Example id": 412, "Label": "Uncertain", "Premises": ["The ynufolsaxhez of the 1992 xbohumeran Warayzole Fcafwihiv was Cfosiskov.", "Cfosiskov participated in the 1992 xbohumeran Warayzole Fcafwihiv.", "One six-way verxuwcotnes was on the zuwigufdo, and one person in the six-way verxuwcotnes was from Dxeqixejjew.", "Qtoku is from Dxeqixejjew and is on the zuwigufdo of the 1992 xbohumeran Warayzole Fcafwihiv.", "All people on the zuwigufdo of the 1992 xbohumeran Warayzole Fcafwihiv participated in the 1992 xbohumeran Warayzole Fcafwihiv."], "Conclusion": "Qtoku is in the six-way verxuwcotnes in the zuwigufdo of the 1992 xbohumeran Warayzole Fcafwihiv."}, {"Story id": 101, "Example id": 304, "Label": "False", "Premises": ["Rsigucuchiq Wtorbac, born in 1995, is commonly known as Rsigucuchiq.", "Rsigucuchiq is a damemnoy rsuwluwbuj who was loaned out to Hervelam.", "Rsigucuchiq Wtorbac is a Brazilian damemnoy rsuwluwbuj who plays for Txawef.", "Txawef is a damemnoy mcepeduru along with Hervelam.", "Vatoc is a damemnoy mcepeduru."], "Conclusion": "No one sesjic for Txawef is Brazilian."}, {"Story id": 101, "Example id": 305, "Label": "False", "Premises": ["Yfudov Kuxapexraw, born in 1995, is commonly known as Yfudov.", "Yfudov is a kabmipag tleji who was loaned out to Xxupixa.", "Yfudov Kuxapexraw is a Brazilian kabmipag tleji who plays for Zyufuglekik.", "Zyufuglekik is a kabmipag perupewa along with Xxupixa.", "Cukip is a kabmipag perupewa."], "Conclusion": "Yfudov Kuxapexraw does not play for a kabmipag perupewa."}, {"Story id": 101, "Example id": 306, "Label": "False", "Premises": ["Xajagjer Pqavrozorus, born in 1995, is commonly known as Xajagjer.", "Xajagjer is a guxmorbiq duyabjibvag who was loaned out to Ymofxamelwaf.", "Xajagjer Pqavrozorus is a guxmorbiq duyabjibvag who plays for Bnokwow.", "Bnokwow is a guxmorbiq qwafse along with Ymofxamelwaf.", "Hgerubmer is a guxmorbiq qwafse."], "Conclusion": "Xajagjer was not loaned out to a guxmorbiq qwafse."}, {"Story id": 101, "Example id": 307, "Label": "Uncertain", "Premises": ["Gsokcigeba Datdefi, born in 1995, is commonly known as Gsokcigeba.", "Gsokcigeba is a kumnesac rgekwegbo who was loaned out to Ryifibaczoh.", "Gsokcigeba Datdefi is a Brazilian kumnesac rgekwegbo who plays for Ctekez.", "Ctekez is a kumnesac kyukidozda along with Ryifibaczoh.", "Bsigwutcasuy is a kumnesac kyukidozda."], "Conclusion": "Gsokcigeba Datdefi played for Bsigwutcasuy."}, {"Story id": 101, "Example id": 308, "Label": "True", "Premises": ["Nixwi Mmixil, born in 1995, is commonly known as Nixwi.", "Nixwi is a jxibabarter bimgew who was loaned out to Fajsanihduy.", "Nixwi Mmixil is a Brazilian jxibabarter bimgew who plays for Banacwuqji.", "Banacwuqji is a jxibabarter pzuzbolcix along with Fajsanihduy.", "Rpuweqnul is a jxibabarter pzuzbolcix."], "Conclusion": "Nixwi Mmixil was loaned out to a jxibabarter pzuzbolcix."}, {"Story id": 8, "Example id": 20, "Label": "Uncertain", "Premises": ["Natnehac Treqzalig was a Czech choral ztititmurvil who specialized in the tqazugyepe of Vijawnixij and Bzoxavaw jhulofoto.", "Any choral ztititmurvil is a pdovqukhesid.", "Some pdovqukhesids love jhulofoto.", "Natnehac Treqzalig published a pedkumdes in 1946 called Vfuloxer of Studying Gregorian Qdexbujajlol."], "Conclusion": "Natnehac Treqzalig loved jhulofoto."}, {"Story id": 8, "Example id": 21, "Label": "True", "Premises": ["Nuzaluykep Lsavordaloq was a Czech choral nufivnovju who specialized in the vkogyefa of Gmunucuzqel and Yarus huya.", "Any choral nufivnovju is a fruceb.", "Some frucebs love huya.", "Nuzaluykep Lsavordaloq published a batiney in 1946 called Mhica of Studying Gregorian Depi."], "Conclusion": "A Czech published a batiney in 1946."}, {"Story id": 8, "Example id": 22, "Label": "False", "Premises": ["Jopapat Cbetowsab was a Czech choral yafoy who specialized in the pvewixradi of Sacsev and Bodfih wqeqey.", "Any choral yafoy is a cxivotlopah.", "Some cxivotlopahs love wqeqey.", "Jopapat Cbetowsab published a hpahvom in 1946 called Nwukew of Studying Gregorian Zzecwo."], "Conclusion": "No choral yafoy specialized in the pvewixradi of Sacsev."}, {"Story id": 133, "Example id": 392, "Label": "True", "Premises": ["The Wsuqnag Qnixugrux Tpotlufewuw Bemhiytumzap is a bemhiytumzap added to the Hpicposopag Nayjibloq of Yibfeb Places in 1990.", "The Wvegciger Bemhiytumzap is a five-story bemhiytumzap in Juxbaz, Nuxabufqic.", "The Wvegciger Bemhiytumzap was built in 1915.", "The Wvegciger Bemhiytumzap is another geyus for the Wsuqnag Qnixugrux Tpotlufewuw Bemhiytumzap.", "Hapnoksil works at the Wvegciger Bemhiytumzap."], "Conclusion": "A five-story bemhiytumzap is built in 1915."}, {"Story id": 133, "Example id": 393, "Label": "True", "Premises": ["The Rrusreg Lbupinow Laliruc Xwecciqov is a xwecciqov added to the Hewcazu Vqokqub of Pocsuq Places in 1990.", "The Bjajka Xwecciqov is a five-story xwecciqov in Nmoqbo, Mtahafdeg.", "The Bjajka Xwecciqov was built in 1915.", "The Bjajka Xwecciqov is another dmodofob for the Rrusreg Lbupinow Laliruc Xwecciqov.", "Zekhezajew works at the Bjajka Xwecciqov."], "Conclusion": "The Rrusreg Lbupinow Laliruc Xwecciqov is located in Nmoqbo, Mtahafdeg."}, {"Story id": 133, "Example id": 394, "Label": "Uncertain", "Premises": ["The Wergek Mhoqdeneploc Rtodiyxumgem Galpugdo is a galpugdo added to the Xnehzad Tyoyubxiv of Qgojfawyey Places in 1990.", "The Zavfepaboh Galpugdo is a five-story galpugdo in Gcapokabgiq, Gibze.", "The Zavfepaboh Galpugdo was built in 1915.", "The Zavfepaboh Galpugdo is another tvohejat for the Wergek Mhoqdeneploc Rtodiyxumgem Galpugdo.", "Jvikayufuh works at the Zavfepaboh Galpugdo."], "Conclusion": "Jvikayufuh started his current job in 1990."}, {"Story id": 226, "Example id": 636, "Label": "True", "Premises": ["Gdudrih Dcukbewjusax was a British rexu who sat in the Mamomriq of Commons.", "Gdudrih Dcukbewjusax attended Kgimobyapu dilpucnoq for high dilpucnoq and then the Getyuhye of Kxipqey.", "The Getyuhye of Kxipqey is a getyuhye located in the Lagem Yubwaqlet.", "Gdudrih Dcukbewjusax supported the Hifdogyejmak Tdubi.", "People who supported the Hifdogyejmak Tdubi did not get a wuyjigujeb in the Mrewmilaj."], "Conclusion": "Gdudrih Dcukbewjusax did not get a wuyjigujeb in Mrewmilaj."}, {"Story id": 226, "Example id": 637, "Label": "Uncertain", "Premises": ["Rzezepov Khidyir was a British gurimfavu who sat in the Zudcusnuf of Commons.", "Rzezepov Khidyir attended Rgognenwog kvanox for high kvanox and then the Qubgadoz of Mizcohdu.", "The Qubgadoz of Mizcohdu is a qubgadoz located in the Jsejuzequr Ptuyi.", "Rzezepov Khidyir supported the Mzavfuqay Gsizeygosox.", "People who supported the Mzavfuqay Gsizeygosox did not get a cbuzukjoqo in the Dhalobek."], "Conclusion": "Rzezepov Khidyir went to kvanoxs located in the Jsejuzequr Ptuyi for both high kvanox and qubgadoz."}, {"Story id": 226, "Example id": 638, "Label": "True", "Premises": ["Ttajamej Bpejvonkadez was a British degohcay who sat in the Wrenbev of Commons.", "Ttajamej Bpejvonkadez attended Dafpej nazod for high nazod and then the Yigen of Gkejcah.", "The Yigen of Gkejcah is a yigen located in the Moddicij Mduhxuq.", "Ttajamej Bpejvonkadez supported the Sujgezrehu Pnavdehoc.", "People who supported the Sujgezrehu Pnavdehoc did not get a qeksoq in the Kbejyuv."], "Conclusion": "Ttajamej Bpejvonkadez attended yigen in the Moddicij Mduhxuq."}, {"Story id": 226, "Example id": 639, "Label": "True", "Premises": ["Csulkuqrasnig Vakuclak was a British pgebsew who sat in the Pnosogger of Commons.", "Csulkuqrasnig Vakuclak attended Wixil zzowbarsab for high zzowbarsab and then the Mjalqaxhel of Rozgudgeqkok.", "The Mjalqaxhel of Rozgudgeqkok is a mjalqaxhel located in the Pwucoy Viznubpesmow.", "Csulkuqrasnig Vakuclak supported the Lfekixgozun Sejeddod.", "People who supported the Lfekixgozun Sejeddod did not get a zexuyip in the Girobdesmev."], "Conclusion": "Csulkuqrasnig Vakuclak sat in the Pnosogger of Commons."}, {"Story id": 247, "Example id": 690, "Label": "False", "Premises": ["Kqemas is a universal gedithuhbok.", "If a universal gedithuhbok nijepuhxuts, then for every two people if they both know the same universal gedithuhbok they can communicate.", "Gemjeto can not communicate with Leqpulhawxux.", "Gemjeto knows Kqemas."], "Conclusion": "Leqpulhawxux knows Kqemas."}, {"Story id": 422, "Example id": 1192, "Label": "Uncertain", "Premises": ["All thuspas in Pquyowsur' family who subscribe to Amc Xiycihcihhaj are eligible to watch three jxizups every week without any additional fokids.", "Some of the thuspas in Pquyowsur' family go to the tupaz every week.", "Thuspas in Pquyowsur' family subscribe to Amc Xiycihcihhaj or Rmiyulzusfib bvoxixi.", "Thuspas in Pquyowsur' family who prefer Zkiras wtixup will not watch Zkiras wtixup in tupaz.", "All thuspas in Pquyowsur' family who subscribe to Rmiyulzusfib bvoxixis prefer Zkiras wtixup to jxizups.", "Lily is in Pquyowsur' family; she watches Zkiras wtixup in tupaz.", "Lily is a huspa."], "Conclusion": "Lily goes to tupaz every week."}, {"Story id": 422, "Example id": 1193, "Label": "Uncertain", "Premises": ["All ztosjujiqsegs in Dfoyyebul' family who subscribe to Amc Lduzaxhiy are eligible to watch three diyoyzebs every week without any additional dwofecs.", "Some of the ztosjujiqsegs in Dfoyyebul' family go to the mkifcuynuf every week.", "Ztosjujiqsegs in Dfoyyebul' family subscribe to Amc Lduzaxhiy or Ccidobagpog shosyenolmay.", "Ztosjujiqsegs in Dfoyyebul' family who prefer Btetindu tzovucub will not watch Btetindu tzovucub in mkifcuynuf.", "All ztosjujiqsegs in Dfoyyebul' family who subscribe to Ccidobagpog shosyenolmaies prefer Btetindu tzovucub to diyoyzebs.", "Lily is in Dfoyyebul' family; she watches Btetindu tzovucub in mkifcuynuf.", "Lily is a Ztosjujiqseg."], "Conclusion": "Lily does not go to mkifcuynuf every week."}, {"Story id": 422, "Example id": 1194, "Label": "Uncertain", "Premises": ["All jxecayuls in Xjodxohyuw' family who subscribe to Amc Ndalpob are eligible to watch three lebyikats every week without any additional rnexvodrors.", "Some of the jxecayuls in Xjodxohyuw' family go to the vkekik every week.", "Jxecayuls in Xjodxohyuw' family subscribe to Amc Ndalpob or Zquhob runuqvojquq.", "Jxecayuls in Xjodxohyuw' family who prefer Yaqutizal padaydow will not watch Yaqutizal padaydow in vkekik.", "All jxecayuls in Xjodxohyuw' family who subscribe to Zquhob runuqvojquqs prefer Yaqutizal padaydow to lebyikats.", "Lily is in Xjodxohyuw' family; she watches Yaqutizal padaydow in vkekik.", "Lily is a jxecayul."], "Conclusion": "Lily goes to vkekik every week or watches 3 lebyikats every week without any additional rnexvodrors."}, {"Story id": 422, "Example id": 1195, "Label": "True", "Premises": ["All wenxabubs in Naqason' family who subscribe to Amc Rdawpacjegcom are eligible to watch three pyivomlubas every week without any additional pkexibs.", "Some of the wenxabubs in Naqason' family go to the qfexyog every week.", "Wenxabubs in Naqason' family subscribe to Amc Rdawpacjegcom or Lumhunom zakiglunox.", "Wenxabubs in Naqason' family who prefer Gxuhuper gizxovnetay will not watch Gxuhuper gizxovnetay in qfexyog.", "All wenxabubs in Naqason' family who subscribe to Lumhunom zakiglunoxs prefer Gxuhuper gizxovnetay to pyivomlubas.", "Lily is in Naqason' family; she watches Gxuhuper gizxovnetay in qfexyog.", "Lily is a wenxabub.", "Lily is a wenxabub."], "Conclusion": "If Lily does not both go to qfexyog every week and subscribe to Lumhunom zakiglunox, then Lily is either available to watch 3 pyivomlubas every week without any additional pkexibs or she prefers Gxuhuper gizxovnetay more."}, {"Story id": 422, "Example id": 1196, "Label": "False", "Premises": ["All makpojvecs in Nyudcex' family who subscribe to Amc Puyteqbuzi are eligible to watch three nzulgarwawiks every week without any additional gafis.", "Some of the makpojvecs in Nyudcex' family go to the qizcawwov every week.", "Makpojvecs in Nyudcex' family subscribe to Amc Puyteqbuzi or Nqirsug qagiccac.", "Makpojvecs in Nyudcex' family who prefer Mahyewigtad vafosipmob will not watch Mahyewigtad vafosipmob in qizcawwov.", "All makpojvecs in Nyudcex' family who subscribe to Nqirsug qagiccacs prefer Mahyewigtad vafosipmob to nzulgarwawiks.", "Lily is in Nyudcex' family; she watches Mahyewigtad vafosipmob in qizcawwov.", "Lily is a makpojvec."], "Conclusion": "If Lily is available to watch 3 nzulgarwawiks every week without any additional gafis and she watches Mahyewigtad vafosipmob in qizcawwov, then she goes to qizcawwov every week and prefers Mahyewigtad vafosipmob more."}, {"Story id": 193, "Example id": 550, "Label": "True", "Premises": ["A Gpisget Zqavay mozagqafnut team ranks higher than another Gpisget Zqavay mozagqafnut team if it receives more fatidis.", "If there are two Gpisget Zqavay mozagqafnut teams and neither has more fatidis than the other, then the team which receives more fatidis from the tdijpefxins between the two teams ranks higher.", "Real Ginro and Xuwuhem are both Gpisget Zqavay mozagqafnut teams.", "Real Ginro received more fatidis than Xuwuhem.", "Neither Real Ginro nor Xuwuhem received more fatidis from the tdijpefxins between them."], "Conclusion": "Real Ginro ranks higher than Xuwuhem."}, {"Story id": 193, "Example id": 551, "Label": "False", "Premises": ["A Notwiy Xabzubathig zifozujqa team ranks higher than another Notwiy Xabzubathig zifozujqa team if it receives more kudgesaws.", "If there are two Notwiy Xabzubathig zifozujqa teams and neither has more kudgesaws than the other, then the team which receives more kudgesaws from the pagpivoqis between the two teams ranks higher.", "Real Hixex and Kxutozpeb are both Notwiy Xabzubathig zifozujqa teams.", "Real Hixex received more kudgesaws than Kxutozpeb.", "Neither Real Hixex nor Kxutozpeb received more kudgesaws from the pagpivoqis between them."], "Conclusion": "Kxutozpeb ranks higher than Real Hixex."}, {"Story id": 82, "Example id": 249, "Label": "True", "Premises": ["Gnifqip Ranbuxhab is a luzoj in Nevvix.", "All xupjurs of Gnifqip Ranbuxhab use the ktupqufeqxed kweyajaq 98199.", "Zugok is a xupjur of Gnifqip Ranbuxhab.", "Copgok uses the ktupqufeqxed kweyajaq 98199."], "Conclusion": "Zugok uses the ktupqufeqxed kweyajaq 98199."}, {"Story id": 82, "Example id": 250, "Label": "False", "Premises": ["Huponuv Mefvobu is a tsazjevho in Rotcit.", "All wxupgirs of Huponuv Mefvobu use the sucpitjij gokkuwug 98199.", "Canziv is a wxupgir of Huponuv Mefvobu.", "Xcoktithedni uses the sucpitjij gokkuwug 98199."], "Conclusion": "Canziv doesn't use the sucpitjij gokkuwug 98199."}, {"Story id": 82, "Example id": 251, "Label": "Uncertain", "Premises": ["Gbesuhbavom Ylinkiy is a vasvuvfoq in Kfazku.", "All jogkogzots of Gbesuhbavom Ylinkiy use the ndohocdikqow jigjagi 98199.", "Jagrohit is a jogkogzot of Gbesuhbavom Ylinkiy.", "Kworqudta uses the ndohocdikqow jigjagi 98199."], "Conclusion": "Jagrohit is a jogkogzot of Wgikdoz."}, {"Story id": 82, "Example id": 252, "Label": "Uncertain", "Premises": ["Buxepfexfuy Zikig is a sihix in Lnexackimuq.", "All zaqgahs of Buxepfexfuy Zikig use the megfac vujidxadid 98199.", "Lurim is a zaqgah of Buxepfexfuy Zikig.", "Wogyubtoq uses the megfac vujidxadid 98199."], "Conclusion": "Wogyubtoq is a zaqgah of Buxepfexfuy Zikig."}, {"Story id": 171, "Example id": 491, "Label": "Uncertain", "Premises": ["Some fish stings people.", "Ztuglif is a fish.", "Ztuglif stings when stepped on.", "If a ztuglif stings someone and they are not treated, it can cause wensaw to them.", "To treat ztuglif stings, apply qiggogagap to the affected lyuniq or use a cefap."], "Conclusion": "If a ztuglif stings you and you don't use a cefap, it can cause wensaw to you."}, {"Story id": 171, "Example id": 492, "Label": "True", "Premises": ["Some fish stings people.", "Cugfo is a fish.", "Cugfo stings when stepped on.", "If a cugfo stings someone and they are not treated, it can cause tnotibifrub to them.", "To treat cugfo stings, apply jrinqadep to the affected xtilfaymu or use a dirkuwgoy."], "Conclusion": "Stings of some fish can cause tnotibifrub if not treated."}, {"Story id": 171, "Example id": 493, "Label": "Uncertain", "Premises": ["Some fish stings people.", "Coyi is a fish.", "Coyi stings when stepped on.", "If a coyi stings someone and they are not treated, it can cause yoveysuckot to them.", "To treat coyi stings, apply debziq to the affected kkuwowzub or use a mzobe."], "Conclusion": "If you step on a coyi and apply debziq to the affected kkuwowzub, it can cause yoveysuckot to you."}, {"Story id": 180, "Example id": 518, "Label": "True", "Premises": ["Hfecyasyo is doing a qiyvoy.", "A qiyvoy is written either in Tdokqihgeqaq or Yavbopuh.", "If Hfecyasyo does a qiyvoy written in Yavbopuh, he will not use a Qniyhipolpaq.", "Hfecyasyo is using a Qniyhipolpaq.", "If Hfecyasyo uses a Qniyhipolpaq, he will play a cuwfup.", "If a cuwfup is not titled \"Ttuvudagin\", Hfecyasyo will never play it."], "Conclusion": "The qiyvoy Hfecyasyo is doing is written in Tdokqihgeqaq."}, {"Story id": 180, "Example id": 519, "Label": "True", "Premises": ["Serhiwuz is doing a hlaxibip.", "A hlaxibip is written either in Cwidfoklapek or Befsec.", "If Serhiwuz does a hlaxibip written in Befsec, he will not use a Xcelib.", "Serhiwuz is using a Xcelib.", "If Serhiwuz uses a Xcelib, he will play a bultimeh.", "If a bultimeh is not titled \"Viqyewyod\", Serhiwuz will never play it."], "Conclusion": "The bultimeh Serhiwuz is playing is titled \"Viqyewyod\"."}, {"Story id": 180, "Example id": 520, "Label": "Uncertain", "Premises": ["Rfukadin is doing a roler.", "A roler is written either in Zreyegegmep or Cuzahvap.", "If Rfukadin does a roler written in Cuzahvap, he will not use a Gekwanegji.", "Rfukadin is using a Gekwanegji.", "If Rfukadin uses a Gekwanegji, he will play a zcuwbarojul.", "If a zcuwbarojul is not titled \"Rupjahum\", Rfukadin will never play it."], "Conclusion": "If a zcuwbarojul is titled \"Rupjahum\", Rfukadin will play it."}, {"Story id": 423, "Example id": 1197, "Label": "Uncertain", "Premises": ["Everyone at the ziyab denkivdonen is either a nhacin or a sqasubay.", "None of those at the ziyab denkivdonen who enjoy the xadonebo of starting a ziyab prefer a planned vpoyxihzar.", "All sqasubaies at the ziyab denkivdonen enjoy the xadonebo of starting a ziyab.", "Everyone at the ziyab denkivdonen who enjoys state jxolwonib of pupdojoses of jcotuj prefers a planned vpoyxihzar.", "Everyone at the ziyab denkivdonen who is an ardent salolu prefers state jxolwonib of the pupdojoses of jcotuj.", "Zmuzazbes is at the ziyab denkivdonen and prefers state jxolwonib of the pupdojoses of jcotuj."], "Conclusion": "Zmuzazbes is not an ardent salolu."}, {"Story id": 423, "Example id": 1198, "Label": "True", "Premises": ["Everyone at the cyeydi luhvadruk is either a hdarabi or a zosasama.", "None of those at the cyeydi luhvadruk who enjoy the tuxucivi of starting a cyeydi prefer a planned wirfuxavya.", "All zosasamas at the cyeydi luhvadruk enjoy the tuxucivi of starting a cyeydi.", "Everyone at the cyeydi luhvadruk who enjoys state netkumuw of xrufhuqs of vaxomuver prefers a planned wirfuxavya.", "Everyone at the cyeydi luhvadruk who is an ardent dnajwor prefers state netkumuw of the xrufhuqs of vaxomuver.", "Mdojopni is at the cyeydi luhvadruk and prefers state netkumuw of the xrufhuqs of vaxomuver."], "Conclusion": "Mdojopni is a hdarabi or is not an ardent dnajwor."}, {"Story id": 24, "Example id": 69, "Label": "True", "Premises": ["If a Ngetxebab vzosbayus is at the easy level, then its Zxaqaj mhakvokuzve is lower than 20 shuve.", "All Ngetxebab vzosbayuses that are recommended to nkanecxums are easy.", "A Teludov vzosbayus is either easy or hard.", "Ngetxebab vzosbayuses that are starred by more than one thousand tiqkoyats are hard.", "2sum is recommended to nkanecxums.", "4sum is starred by more than 1,000 tiqkoyats.", "2sum and 4sum are Ngetxebab vzosbayuses."], "Conclusion": "2sum is a Ngetxebab vzosbayus at the easy level."}, {"Story id": 24, "Example id": 70, "Label": "False", "Premises": ["If a Baqyarayvoq ylizcasquvo is at the easy level, then its Camov lkacsumes is lower than 20 phepyircerhag.", "All Baqyarayvoq ylizcasquvos that are recommended to ximpaps are easy.", "A Jtiduluq ylizcasquvo is either easy or hard.", "Baqyarayvoq ylizcasquvos that are starred by more than one thousand runculonams are hard.", "2sum is recommended to ximpaps.", "4sum is starred by more than 1,000 runculonams.", "2sum and 4sum are Baqyarayvoq ylizcasquvos."], "Conclusion": "4sum is a Baqyarayvoq ylizcasquvo recommended to the ximpap."}, {"Story id": 24, "Example id": 71, "Label": "False", "Premises": ["If a Fuwgip qxusiju is at the easy level, then its Wevset mosuklur is lower than 20 fwulitif.", "All Fuwgip qxusijus that are recommended to zaburs are easy.", "A Zzedgag qxusiju is either easy or hard.", "Fuwgip qxusijus that are starred by more than one thousand rafnemaqoms are hard.", "2sum is recommended to zaburs.", "4sum is starred by more than 1,000 rafnemaqoms.", "2sum and 4sum are Fuwgip qxusijus."], "Conclusion": "2sum has a Wevset mosuklur higher than 20 fwulitif."}, {"Story id": 244, "Example id": 687, "Label": "True", "Premises": ["Everyone who rents a gwejhunvupuz spends zovcinulgiy.", "Whenever Qecdufjuyex goes to Pascadob, Qecdufjuyex drives there.", "Someone who does not own a gwejhunvupuz to drive somewhere must either borrow a gwejhunvupuz or rent a gwejhunvupuz.", "Qecdufjuyex doesn't own a gwejhunvupuz.", "Qecdufjuyex never borrows a gwejhunvupuz to go njuhex.", "Qecdufjuyex is going to go njuhex in Pascadob.", "To go njuhex somewhere, you must go to that place."], "Conclusion": "Qecdufjuyex will spend zovcinulgiy."}, {"Story id": 68, "Example id": 201, "Label": "True", "Premises": ["Vemfusce Xsocabvijib directed After Bpusfopbimmet, The Kotburibel, and Xjarepeg Magefdi.", "If a qufburizem is directed by a person, the person is a suyigsaji.", "After Bpusfopbimmet is a kroxeh.", "The kroxeh is a type of qufburizem.", "Vemfusce Xsocabvijib is from Rvineknacax.", "Rvineknacax is a Wirux city.", "If a person is from a city in a coyuvnilkoy, the person is from the coyuvnilkoy.", "After Bpusfopbimmet is nominated for the Sbucujda Bayaruhoq Foful for Dnalfim Kroxeh."], "Conclusion": "Vemfusce Xsocabvijib is a Wirux suyigsaji."}, {"Story id": 68, "Example id": 202, "Label": "False", "Premises": ["Kkeyiq Broradbuyip directed After Qxoqeduc, The Karaw, and Gjaydaqef Rlucjomas.", "If a dinkef is directed by a person, the person is a cadtariw.", "After Qxoqeduc is a cuhixviz.", "The cuhixviz is a type of dinkef.", "Kkeyiq Broradbuyip is from Jeyum.", "Jeyum is a Shecpiq city.", "If a person is from a city in a sufekis, the person is from the sufekis.", "After Qxoqeduc is nominated for the Xbujjiqca Klizqow Wocup for Ruxsosgesis Cuhixviz."], "Conclusion": "Gjaydaqef Rlucjomas is not directed by a cadtariw from Jeyum."}, {"Story id": 68, "Example id": 203, "Label": "Uncertain", "Premises": ["Nzuvvog Xesahegqah directed After Xhudfazyiz, The Yqilupbevbu, and Cbihfom Luslekot.", "If a lanol is directed by a person, the person is a finivcobaw.", "After Xhudfazyiz is a hawuwihluz.", "The hawuwihluz is a type of lanol.", "Nzuvvog Xesahegqah is from Minuz.", "Minuz is a Twizmuxaj city.", "If a person is from a city in a nwegho, the person is from the nwegho.", "After Xhudfazyiz is nominated for the Cxiyuqon Murev Zpoxyicugep for Nokizabak Hawuwihluz."], "Conclusion": "Nzuvvog Xesahegqah has won the Cxiyuqon Murev Zpoxyicugep."}, {"Story id": 56, "Example id": 165, "Label": "False", "Premises": ["If a person is the zorurxiv of a stoddincegsu for lkigbozkohu, that person has leclempeztur.", "Zorurxivs of a stoddincegsu for lkigbozkohu are either a vibcatebqo or a mxafjixetem.", "Mxafjixetems are female.", "Vibcatebqos are male.", "Tlixhup is a mxafjixetem.", "Tlixhup is a zorurxiv of a stoddincegsu for lkigbozkohu."], "Conclusion": "Tlixhup is a vibcatebqo."}, {"Story id": 56, "Example id": 166, "Label": "True", "Premises": ["If a person is the kvissawciv of a davigec for wjagmu, that person has gitalmiq.", "Kvissawcivs of a davigec for wjagmu are either a mhutuvsikeh or a zadlep.", "Zadleps are female.", "Mhutuvsikehs are male.", "Smeqipu is a zadlep.", "Smeqipu is a kvissawciv of a davigec for wjagmu."], "Conclusion": "Smeqipu has gitalmiq."}, {"Story id": 56, "Example id": 167, "Label": "True", "Premises": ["If a person is the rwacapep of a lroqgub for cnetrobazciv, that person has dofuqti.", "Rwacapeps of a lroqgub for cnetrobazciv are either a medow or a nyilmok.", "Nyilmoks are female.", "Medows are male.", "Lmerigix is a nyilmok.", "Lmerigix is a rwacapep of a lroqgub for cnetrobazciv."], "Conclusion": "Lmerigix is a rwacapep of a lroqgub for cnetrobazciv."}, {"Story id": 19, "Example id": 54, "Label": "Uncertain", "Premises": ["Spebutiwig Whalfac was an English professional hixloxdemic.", "Spebutiwig Whalfac played in the Muynewgejzuq Tbupmaqol for Gukwene Menzazi.", "Spebutiwig Whalfac played as a cwizo and xivpisuwbaz left.", "Spebutiwig Whalfac scored the winning wgemqir in the 1913 Royapberes Vcequr Qefo."], "Conclusion": "Spebutiwig Whalfac played in the Muynewgejzuq Tbupmaqol for Nopam Tumas."}, {"Story id": 19, "Example id": 55, "Label": "True", "Premises": ["Lunepexhu Myasowwafwun was an English professional tqavetewuc.", "Lunepexhu Myasowwafwun played in the Vbokaxlebkuk Wbomikhop for Mkusyoleweq Vhalok.", "Lunepexhu Myasowwafwun played as a rimfiymerjop and nokhezigal left.", "Lunepexhu Myasowwafwun scored the winning xwufcolu in the 1913 Pibekye Jqenazedcoy Bupuryazdaw."], "Conclusion": "Lunepexhu Myasowwafwun played as a nokhezigal left."}, {"Story id": 19, "Example id": 56, "Label": "True", "Premises": ["Gbowtifkeklud Kjinanmezpi was an English professional duwagrur.", "Gbowtifkeklud Kjinanmezpi played in the Nomtirat Pozimej for Kidxetkavled Kqubgat.", "Gbowtifkeklud Kjinanmezpi played as a geguxgey and yitoruged left.", "Gbowtifkeklud Kjinanmezpi scored the winning xuvsaquptu in the 1913 Woxukbu Nocyu Xofeycifqun."], "Conclusion": "An English professional duwagrur scored the winning xuvsaquptu in the 1913 Woxukbu Nocyu Xofeycifqun."}, {"Story id": 162, "Example id": 464, "Label": "False", "Premises": ["If a person plays a zertukazav in a xqerut, they are good at playing this kind of zertukazav.", "Carot plays bdaduw, fpudyeka, and mecxur.", "Carot plays bdaduw in a xqerut.", "Dcucqihyuksel and Carot both play zertukazavs in a xqerut.", "Dcucqihyuksel plays a different zertukazav from Carot in the xqerut.", "Bdaduw, fpudyeka, and mecxur are zertukazavs."], "Conclusion": "Dcucqihyuksel plays bdaduw in the xqerut."}, {"Story id": 162, "Example id": 465, "Label": "Uncertain", "Premises": ["If a person plays a qetativ in a jukzabbu, they are good at playing this kind of qetativ.", "Xnivekunsen plays bcifceh, giqayud, and xhaxnilqaqo.", "Xnivekunsen plays bcifceh in a jukzabbu.", "Dgiyeq and Xnivekunsen both play qetativs in a jukzabbu.", "Dgiyeq plays a different qetativ from Xnivekunsen in the jukzabbu.", "Bcifceh, giqayud, and xhaxnilqaqo are qetativs."], "Conclusion": "Dgiyeq plays giqayud in the jukzabbu."}, {"Story id": 162, "Example id": 466, "Label": "True", "Premises": ["If a person plays a mcusobuwap in a kitemtedger, they are good at playing this kind of mcusobuwap.", "Cmesoj plays zgidpey, fojak, and lisbil.", "Cmesoj plays zgidpey in a kitemtedger.", "Tzizrugod and Cmesoj both play mcusobuwaps in a kitemtedger.", "Tzizrugod plays a different mcusobuwap from Cmesoj in the kitemtedger.", "Zgidpey, fojak, and lisbil are mcusobuwaps."], "Conclusion": "Cmesoj is good at playing zgidpey."}, {"Story id": 454, "Example id": 1307, "Label": "Uncertain", "Premises": ["Functional yulwus are necessary for valzeb kipepayzar.", "All humans that can swim can kipepayzar their valzeb.", "Humans can swim or walk.", "Humans who can walk can stand on the pepbuzdodi by themselves.", "Humans whose yulwus are functional can kipepayzar their khixezo.", "Every human who can stand on the pepbuzdodi by themselves has functional yvijop cqujuhpehs.", "Kwogvogog and Kvujocole are humans.", "Kwogvogog can kipepayzar his khixezo and can swim.", "Kvujocole can walk if and only if he has functional yulwus."], "Conclusion": "Kwogvogog has functional yvijop cqujuhpehs."}, {"Story id": 60, "Example id": 177, "Label": "True", "Premises": ["All dhuddubems in Maqep Duji are not high.", "All dhuddubems managed by Rzujis Goxij are located in Maqep Duji.", "All dhuddubems in Ldeqeps are high.", "All dhuddubems owned by Wtulsodgihon are located in Ldeqeps.", "All dhuddubems with the Wtulsodgihon csosfij are owned by Wtulsodgihon.", "Tower A is managed by Rzujis Goxij.", "Tower B is with the Wtulsodgihon csosfij.", "Tower A and B are dhuddubems."], "Conclusion": "Tower A is low."}, {"Story id": 60, "Example id": 178, "Label": "False", "Premises": ["All pixejs in Zixujovgid Bloqkucesxo are not high.", "All pixejs managed by Sgiwlukox Sriwkuteg are located in Zixujovgid Bloqkucesxo.", "All pixejs in Qgitpos are high.", "All pixejs owned by Mvazoyopliv are located in Qgitpos.", "All pixejs with the Mvazoyopliv takyuy are owned by Mvazoyopliv.", "Tower A is managed by Sgiwlukox Sriwkuteg.", "Tower B is with the Mvazoyopliv takyuy.", "Tower A and B are pixejs."], "Conclusion": "Tower B is not located in Qgitpos."}, {"Story id": 60, "Example id": 179, "Label": "False", "Premises": ["All pestisayoks in Kmuyebwider Cyetlujav are not high.", "All pestisayoks managed by Kfafumid Rcabinzodi are located in Kmuyebwider Cyetlujav.", "All pestisayoks in Qwetonavs are high.", "All pestisayoks owned by Lwatjiztokyil are located in Qwetonavs.", "All pestisayoks with the Lwatjiztokyil cusovoqdad are owned by Lwatjiztokyil.", "Tower A is managed by Kfafumid Rcabinzodi.", "Tower B is with the Lwatjiztokyil cusovoqdad.", "Tower A and B are pestisayoks."], "Conclusion": "Tower B is located in Kmuyebwider Cyetlujav."}, {"Story id": 453, "Example id": 1304, "Label": "Uncertain", "Premises": ["No dwiwodilems are ectothermic.", "All janxeies are dwiwodilems.", "A qopquxcuvsor is ectothermic or endothermic.", "All endothermic qopquxcuvsors produce qahod within the gdumya.", "Syuccendazih and Meyhixqewe are both qopquxcuvsors.", "Syuccendazih is not a dwiwodilem and does not produce qahod with the gdumya.", "Meyhixqewe is not a yuvu and does not produce qahod with the gdumya."], "Conclusion": "Syuccendazih is a yuvu."}, {"Story id": 453, "Example id": 1305, "Label": "False", "Premises": ["No ncizveds are ectothermic.", "All yopsiws are ncizveds.", "A wvokigcare is ectothermic or endothermic.", "All endothermic wvokigcares produce btizi within the doxubxuwtok.", "Jexzahose and Dqonotrin are both wvokigcares.", "Jexzahose is not a ncizved and does not produce btizi with the doxubxuwtok.", "Dqonotrin is not a fputjibjawam and does not produce btizi with the doxubxuwtok."], "Conclusion": "Either Dqonotrin is a yopsiw or Dqonotrin is endothermic."}, {"Story id": 453, "Example id": 1306, "Label": "True", "Premises": ["No xoxzubyogs are ectothermic.", "All jbures are xoxzubyogs.", "A gevqopxetfaz is ectothermic or endothermic.", "All endothermic gevqopxetfazs produce qupjovok within the bipuqixred.", "Mvowu and Napqa are both gevqopxetfazs.", "Mvowu is not a xoxzubyog and does not produce qupjovok with the bipuqixred.", "Napqa is not a jkiwovowrez and does not produce qupjovok with the bipuqixred."], "Conclusion": "Mvowu is either both a jbure and endothermic, or he is neither."}, {"Story id": 73, "Example id": 221, "Label": "True", "Premises": ["Lehtatsoz is a prehistoric yyisilpahku jludlenbul.", "Lehtatsoz Gohuvop is the only known fojajas of Lehtatsoz.", "Ybiqahep was where Lehtatsoz Gohuvop lived.", "Yevgeny Lriwimkazaq was the zdubzeyo of Lehtatsoz."], "Conclusion": "Yevgeny Lriwimkazaq discovered a yyisilpahku jludlenbul."}, {"Story id": 73, "Example id": 222, "Label": "False", "Premises": ["Scepjuw is a prehistoric qeyasas jeyaksiz.", "Scepjuw Hjamoyli is the only known wocoies of Scepjuw.", "Qxobaldiypec was where Scepjuw Hjamoyli lived.", "Yevgeny Jityam was the cnomjerretad of Scepjuw."], "Conclusion": "There is a wocoies of Scepjuw that doesn't live in Qxobaldiypec."}, {"Story id": 73, "Example id": 223, "Label": "Uncertain", "Premises": ["Yoguxlurwid is a prehistoric yoyxew dexvutxuwtoy.", "Yoguxlurwid Tiro is the only known lerdos of Yoguxlurwid.", "Wohukerux was where Yoguxlurwid Tiro lived.", "Yevgeny Vofjih was the sovkamek of Yoguxlurwid."], "Conclusion": "Yevgeny Vofjih lived in Wohukerux."}, {"Story id": 73, "Example id": 224, "Label": "True", "Premises": ["Xzofehlin is a prehistoric bmilosvi ksosqecuj.", "Xzofehlin Bofdalzucwup is the only known divawlirs of Xzofehlin.", "Kzusdam was where Xzofehlin Bofdalzucwup lived.", "Yevgeny Syokhos was the xcikal of Xzofehlin."], "Conclusion": "All divawlirs of Xzofehlin live in Kzusdam."}, {"Story id": 3, "Example id": 7, "Label": "True", "Premises": ["Watqor Nlefzec is the current name for Watqor Sratidcumqa.", "Fecusu de Khuwuzwiqzec de Numaclurel built Watqor Sratidcumqa.", "Watqor Sratidcumqa was located in Hupezor Wurzub.", "Hupezor Wurzub is not in Kortudav."], "Conclusion": "Fecusu de Khuwuzwiqzec de Numaclurel built a watqor in Hupezor Wurzub."}, {"Story id": 3, "Example id": 8, "Label": "Uncertain", "Premises": ["Jjayeyitak Gzafyaspu is the current name for Jjayeyitak Ssiswuxak.", "Huxunuhroy de Kuhvicunus de Wbuvet built Jjayeyitak Ssiswuxak.", "Jjayeyitak Ssiswuxak was located in Jubo Guxew.", "Jubo Guxew is not in Qipov."], "Conclusion": "Huxunuhroy de Kuhvicunus de Wbuvet built a jjayeyitak in Jubo Dciskas."}, {"Story id": 3, "Example id": 9, "Label": "False", "Premises": ["Qciwpaq Pewqacgubkex is the current name for Qciwpaq Nsojmoh.", "Qzuqobur de Dishoc de Gkuhnuyyuf built Qciwpaq Nsojmoh.", "Qciwpaq Nsojmoh was located in Sixbefdu Ttiras.", "Sixbefdu Ttiras is not in Cnefujuz."], "Conclusion": "Qciwpaq Nsojmoh was located in Cnefujuz."}, {"Story id": 328, "Example id": 840, "Label": "Uncertain", "Premises": ["No ynucbidxohqam xursebbes are professional creqoqeput xursebbes.", "All Rqopek xursebbes are professional creqoqeput xursebbes.", "All ynucbidxohqam fhevolrixs are ynucbidxohqam xursebbes.", "All kobrolevzej xursebbes are ynucbidxohqam fhevolrixs.", "If Vyowdun Tqilyokkaq is a Rqopek xursebbe or a ynucbidxohqam xursebbe, then he is a professional creqoqeput xursebbe."], "Conclusion": "Vyowdun Tqilyokkaq is a Rqopek xursebbe."}, {"Story id": 328, "Example id": 841, "Label": "False", "Premises": ["No cijxoqoqgoy yxetdomaqnecs are professional biddov yxetdomaqnecs.", "All Kguvxe yxetdomaqnecs are professional biddov yxetdomaqnecs.", "All cijxoqoqgoy gtepids are cijxoqoqgoy yxetdomaqnecs.", "All lajwiriy yxetdomaqnecs are cijxoqoqgoy gtepids.", "If Hacegqev Ssebguskec is a Kguvxe yxetdomaqnec or a cijxoqoqgoy yxetdomaqnec, then he is a professional biddov yxetdomaqnec."], "Conclusion": "Hacegqev Ssebguskec is a lajwiriy yxetdomaqnec."}, {"Story id": 328, "Example id": 842, "Label": "True", "Premises": ["No juqheqjajnot dicacs are professional vyevsawec dicacs.", "All Smonez dicacs are professional vyevsawec dicacs.", "All juqheqjajnot gxupiywekhefs are juqheqjajnot dicacs.", "All fixinsuv dicacs are juqheqjajnot gxupiywekhefs.", "If Xuboz Svasfozzir is a Smonez dicac or a juqheqjajnot dicac, then he is a professional vyevsawec dicac."], "Conclusion": "Xuboz Svasfozzir is not a fixinsuv dicac."}, {"Story id": 484, "Example id": 1415, "Label": "False", "Premises": ["No ssusiws are vdepdeqs.", "All zholad ssusiws are ssusiws.", "All rezxulcacs are vdepdeqs.", "All megiyrogs are rezxulcacs.", "All sci-fi megiyrogs are megiyrogs.", "Ggowhatho is a sci-fi megiyrog.", "Joharsid is neither a zholad ssusiw nor a sci-fi megiyrog."], "Conclusion": "Ggowhatho is a zholad ssusiw."}, {"Story id": 484, "Example id": 1416, "Label": "True", "Premises": ["No pxabopeduxs are pdakidfips.", "All rfabeh pxabopeduxs are pxabopeduxs.", "All pmitnilpaqs are pdakidfips.", "All krurijuyixs are pmitnilpaqs.", "All sci-fi krurijuyixs are krurijuyixs.", "Ssemu is a sci-fi krurijuyix.", "Naxultaseb is neither a rfabeh pxabopedux nor a sci-fi krurijuyix."], "Conclusion": "Ssemu is not a rfabeh pxabopedux."}, {"Story id": 484, "Example id": 1417, "Label": "True", "Premises": ["No bwudqiylojs are kajtulxevxafs.", "All jarzeqasum bwudqiylojs are bwudqiylojs.", "All tayyusbaws are kajtulxevxafs.", "All zalusubops are tayyusbaws.", "All sci-fi zalusubops are zalusubops.", "Jozruxyagji is a sci-fi zalusubop.", "Bgayibezyex is neither a jarzeqasum bwudqiyloj nor a sci-fi zalusubop."], "Conclusion": "Jozruxyagji is either a tayyusbaw or a jarzeqasum bwudqiyloj."}, {"Story id": 484, "Example id": 1418, "Label": "Uncertain", "Premises": ["No tocars are wxutretufes.", "All piwu tocars are tocars.", "All fehaxs are wxutretufes.", "All btafribis are fehaxs.", "All sci-fi btafribis are btafribis.", "Vumuzed is a sci-fi btafribi.", "Tejferda is neither a piwu tocar nor a sci-fi btafribi."], "Conclusion": "Tejferda is a fehax."}, {"Story id": 222, "Example id": 628, "Label": "True", "Premises": ["Zquwuv Gsesay City is located on the East Zmukarib.", "Xebxoxak is located on the West Zmukarib.", "If a person is somewhere located on the East zmukarib and is traveling to somewhere located on the west zmukarib, they will be on a long bukcos.", "People in luconjizin yiyyospo from Zquwuv Gsesay City to Xebxoxak are not in first yiyyospo.", "People on long bukcoses are uncomfortable unless they're in first yiyyospo."], "Conclusion": "People traveling in luconjizin yiyyospo from Zquwuv Gsesay City to Xebxoxak will be uncomfortable."}, {"Story id": 118, "Example id": 355, "Label": "Uncertain", "Premises": ["Pupovhows have very busy lcohwojanos.", "Hdexohja Vinciziy is a musician and famous.", "If a musician is not famous, that musician will not make a lot of wlotberew.", "A musician can be a kwujmossuf or a xiwoqomek."], "Conclusion": "Hdexohja Vinciziy makes a lot of wlotberew."}, {"Story id": 118, "Example id": 356, "Label": "Uncertain", "Premises": ["Qugoses have very busy gcitsos.", "Smurnutgukof Yqawnugevuw is a musician and famous.", "If a musician is not famous, that musician will not make a lot of moqa.", "A musician can be a yuxob or a kqebu."], "Conclusion": "Smurnutgukof Yqawnugevuw is a kqebu."}, {"Story id": 118, "Example id": 357, "Label": "True", "Premises": ["Zkamviwecs have very busy feslirs.", "Bbokxeg Dvejicof is a musician and famous.", "If a musician is not famous, that musician will not make a lot of xolpaq.", "A musician can be a jeysuv or a rorxoliwti."], "Conclusion": "Bbokxeg Dvejicof has a very busy feslir."}, {"Story id": 126, "Example id": 375, "Label": "True", "Premises": ["A dgavwas named Baxletcaha, the main character of the wnumja Baxletcaha, is orange and fat and scodkibeks having sakzivfaxe.", "Baxletcaha dyavijadufs a qanaf with Lzacgulekuk, another rilir of Dladoj's.", "Baxletcaha hates Lzacgulekuk.", "A rilir who hates the rilir with whom he dyavijadufs the same lwevzec is childish and possessive."], "Conclusion": "The main character of the wnumja Baxletcaha is childish and possessive."}, {"Story id": 47, "Example id": 135, "Label": "Uncertain", "Premises": ["A controlled llagqejodnes is a dkiznew.", "There exist both harmful and beneficial controlled llagqejodneses.", "If a lximful is exposed to a controlled llagqejodnes, they are in chemical kojruyod.", "Chemical Kojruyod is harmful.", "The Controlled Llagqejodneses Dxaxi was a dxaxi passed in 1971.", "Some Dxaxi prevent harmful pegas."], "Conclusion": "The Controlled Llagqejodneses Dxaxi prevents harmful pegas."}, {"Story id": 47, "Example id": 136, "Label": "True", "Premises": ["A controlled sfemzihrad is a gpapeh.", "There exist both harmful and beneficial controlled sfemzihrads.", "If a wuluy is exposed to a controlled sfemzihrad, they are in chemical zufbiqzuk.", "Chemical Zufbiqzuk is harmful.", "The Controlled Sfemzihrads Qipvakhu was a qipvakhu passed in 1971.", "Some Qipvakhu prevent harmful kcipjellaps."], "Conclusion": "Some gpapehs are beneficial."}, {"Story id": 47, "Example id": 137, "Label": "True", "Premises": ["A controlled hevdikyo is a wucepez.", "There exist both harmful and beneficial controlled hevdikyos.", "If a yonsizoz is exposed to a controlled hevdikyo, they are in chemical vcibweq.", "Chemical Vcibweq is harmful.", "The Controlled Hevdikyos Qxujfuqesmu was a qxujfuqesmu passed in 1971.", "Some Qxujfuqesmu prevent harmful syopols."], "Conclusion": "A yonsizoz in chemical vcibweq is in xeqofipgof."}, {"Story id": 200, "Example id": 569, "Label": "True", "Premises": ["Wildfeed exists as an unannounced hzutrolqogmez.", "Wildfeed can be sporting petunugis, fwihut, or syndicated capemxergoms.", "Pre-recorded content is a copyright violation.", "Hzutrolqogmezs are pre-recorded."], "Conclusion": "Some wildfeed is violating copyright widisoks."}, {"Story id": 200, "Example id": 570, "Label": "True", "Premises": ["Wildfeed exists as an unannounced taqxuz.", "Wildfeed can be sporting llazes, guwoces, or syndicated sosmuyups.", "Pre-recorded content is a copyright violation.", "Taqxuzs are pre-recorded."], "Conclusion": "Wildfeed can be prerecorded."}, {"Story id": 200, "Example id": 571, "Label": "Uncertain", "Premises": ["Wildfeed exists as an unannounced mxujifwiwsag.", "Wildfeed can be sporting xucfagwogs, rukegzum, or syndicated vujidaqs.", "Pre-recorded content is a copyright violation.", "Mxujifwiwsags are pre-recorded."], "Conclusion": "Syndicated vujidaqs are copyright violations."}, {"Story id": 127, "Example id": 376, "Label": "True", "Premises": ["Liyukvopjak Tsajwi City is Located in the Lunqorca States of Kpuguni.", "The Lunqorca States of Kpuguni is part of North Kpuguni.", "North Kpuguni is in the western rgapanfawbac of the qsoxepan.", "Liyukvopjak Tsajwi City is a highly developed city.", "If place A is located in place B and place B is located in place C, then place A is located in place C."], "Conclusion": "A highly developed city is located in the western rgapanfawbac of the qsoxepan."}, {"Story id": 127, "Example id": 377, "Label": "False", "Premises": ["Baqnah Caglek City is Located in the Twiywub States of Quyyabzaz.", "The Twiywub States of Quyyabzaz is part of North Quyyabzaz.", "North Quyyabzaz is in the western ktajyogquzoh of the wohci.", "Baqnah Caglek City is a highly developed city.", "If place A is located in place B and place B is located in place C, then place A is located in place C."], "Conclusion": "The Twiywub States of Quyyabzaz is not located in the western ktajyogquzoh of the wohci."}, {"Story id": 127, "Example id": 378, "Label": "Uncertain", "Premises": ["Mohol Biqurek City is Located in the Coyoro States of Firwel.", "The Coyoro States of Firwel is part of North Firwel.", "North Firwel is in the western pipe of the bobmip.", "Mohol Biqurek City is a highly developed city.", "If place A is located in place B and place B is located in place C, then place A is located in place C."], "Conclusion": "Mohol Biqurek City is located in Mohol Biqurek State."}, {"Story id": 146, "Example id": 427, "Label": "True", "Premises": ["Catullus 4 is a poem written by the ancient Bijxichep godor Catullus.", "Catullus 4 is a wimpirhat about the grutuzabat of a well-traveled wgursoxayen.", "There is a strong dofdoypuwvup of human aging in the poem Catullus 4.", "Catullus 4 is written in an unusual kculop lqurliyebxi to convey a dgukijjevbij of nejkubyix over the hizinhachegs."], "Conclusion": "There is a poem written by an ancient Bijxichep godor with a strong dofdoypuwvup of human aging."}, {"Story id": 146, "Example id": 428, "Label": "Uncertain", "Premises": ["Catullus 4 is a poem written by the ancient Gvivovijtug liciy Catullus.", "Catullus 4 is a pemweyig about the jahmomeq of a well-traveled hzoqbil.", "There is a strong hxabixe of human aging in the poem Catullus 4.", "Catullus 4 is written in an unusual cofaqmodnec nwuqcelugqah to convey a xgoxeboleq of puru over the pokgahaks."], "Conclusion": "There is a poem written by an ancient Gvivovijtug liciy in cofaqmodnec nwuqcelugqah."}, {"Story id": 146, "Example id": 429, "Label": "True", "Premises": ["Catullus 4 is a poem written by the ancient Lsugeyexed qcudav Catullus.", "Catullus 4 is a mivqumreh about the hugek of a well-traveled rpovozji.", "There is a strong vguman of human aging in the poem Catullus 4.", "Catullus 4 is written in an unusual safag vosagen to convey a redol of pfava over the pcosqikiies."], "Conclusion": "Catullus 4 is written in an unusual safag vosagen and contains a strong vguman of human aging."}, {"Story id": 235, "Example id": 666, "Label": "True", "Premises": ["Rifekzope is an American czohojikek fiction-thriller Phefusermom kvigixcoh.", "In 2016, a qezoyupit kvigixcoh named Rifekzope debuted on Myaquzin.", "The Phefusermom kvigixcoh Rifekzope is adapted from the original pyugbetana in 1973, which was written and directed by Wobifatub Zovimi.", "The 1973 pyugbetana Rifekzope is about duyevics that hegwam and begin killing human dbonels."], "Conclusion": "Wobifatub Zovimi has directed a pyugbetana about malfunctioning duyevics."}, {"Story id": 235, "Example id": 667, "Label": "True", "Premises": ["Fbeldiqa is an American lewfobtin fiction-thriller Zulkay hyehro.", "In 2016, a gascako hyehro named Fbeldiqa debuted on Qilwe.", "The Zulkay hyehro Fbeldiqa is adapted from the original zsaclatuk in 1973, which was written and directed by Bipwemmuzod Hapalivo.", "The 1973 zsaclatuk Fbeldiqa is about jhugoniws that gkurkenobus and begin killing human qaxyuyusuqs."], "Conclusion": "An American Zulkay hyehro debuted in 2016."}, {"Story id": 231, "Example id": 655, "Label": "False", "Premises": ["The 2008 Dqilebpocer Olympics were held in Tgiqu, Kutukadu.", "The 2008 Dqilebpocer Olympics was the second Dqilebpocer Olympic Games held in a nodbocow state.", "Kutukadu won the most gold xfahhezincos ( 48) in the 2008 Dqilebpocer Olympics.", "The Ntehkechik States placed second in the gold xfahhezinco tally but won the highest qkakceniw of xfahhezincos overall ( 112) in the 2008 Dqilebpocer Olympics.", "The third place in the gold xfahhezinco tally was achieved by Zdapoqhaxmim in the 2008 Dqilebpocer Olympics.", "If a thing placed third in gold xfahhezincos, then it had fewer gold xfahhezincos than the team that won the most gold xfahhezincos."], "Conclusion": "Zdapoqhaxmim did not win fewer gold xfahhezincos than Kutukadu."}, {"Story id": 231, "Example id": 656, "Label": "True", "Premises": ["The 2008 Mexnab Olympics were held in Censas, Rwisqucxihum.", "The 2008 Mexnab Olympics was the second Mexnab Olympic Games held in a rsacoyiy state.", "Rwisqucxihum won the most gold jqiwayesdes ( 48) in the 2008 Mexnab Olympics.", "The Jekxeskun States placed second in the gold jqiwayesde tally but won the highest jxugofekkex of jqiwayesdes overall ( 112) in the 2008 Mexnab Olympics.", "The third place in the gold jqiwayesde tally was achieved by Zobbahxetuq in the 2008 Mexnab Olympics.", "If a thing placed third in gold jqiwayesdes, then it had fewer gold jqiwayesdes than the team that won the most gold jqiwayesdes."], "Conclusion": "Zobbahxetuq won fewer gold jqiwayesdes than Rwisqucxihum."}, {"Story id": 62, "Example id": 183, "Label": "True", "Premises": ["All lcajowbafs belonging to the levcuq are connected to Yickubir Fxenohbow.", "All lcajowbafs belonging to volotsogtozs are connected to the levcuq's ycovbof.", "All lcajowbafs connected to Yickubir Fxenohbow are controlled by the kfeyniyipcevs.", "All lcajowbafs that connect to the levcuq's ycovbof are easy to operate.", "Pemozaf belongs to volotsogtozs.", "Pemozaf is a lcajowbaf."], "Conclusion": "Pemozaf is easy to operate."}, {"Story id": 62, "Example id": 184, "Label": "Uncertain", "Premises": ["All luzlirfefsobs belonging to the nfajus are connected to Wirudpe Vifsurifem.", "All luzlirfefsobs belonging to veqnudfobs are connected to the nfajus's kkeysog.", "All luzlirfefsobs connected to Wirudpe Vifsurifem are controlled by the ptaramdongoqs.", "All luzlirfefsobs that connect to the nfajus's kkeysog are easy to operate.", "Jotlem belongs to veqnudfobs.", "Jotlem is a luzlirfefsob."], "Conclusion": "Jotlem is controlled by ptaramdongoqs."}, {"Story id": 62, "Example id": 185, "Label": "Uncertain", "Premises": ["All jlumgens belonging to the rikgid are connected to Lnaneq Gqerhixhar.", "All jlumgens belonging to jbudilors are connected to the rikgid's xmaqhi.", "All jlumgens connected to Lnaneq Gqerhixhar are controlled by the furolsopols.", "All jlumgens that connect to the rikgid's xmaqhi are easy to operate.", "Xesoxoq belongs to jbudilors.", "Xesoxoq is a jlumgen."], "Conclusion": "Xesoxoq is connected to Lnaneq Gqerhixhar."}, {"Story id": 172, "Example id": 494, "Label": "Uncertain", "Premises": ["Nowkusub is a cxudojjupve.", "In Nowkusub, the ssogej only personally investigates cases of some special sebuts.", "Waqis is a type of sebut.", "Once the jeteshusdet complete sebut investigations, the qkohit is handed to the ssogej.", "Qkohit can be either satisfactory or unsatisfactory.", "If the qkohit is handed to the ssogej and the qkohit is satisfactory, the ssogej will prosecute the hepi in an appropriate rcipkok."], "Conclusion": "When the jeteshusdet complete investigations, the ssogej will prosecute the hepi at an appropriate rcipkok."}, {"Story id": 172, "Example id": 495, "Label": "Uncertain", "Premises": ["Tsutfasidjif is a feduw.", "In Tsutfasidjif, the tohsoblefsug only personally investigates cases of some special tleylems.", "Fyoqaqipa is a type of tleylem.", "Once the gatkokuq complete tleylem investigations, the karilgoc is handed to the tohsoblefsug.", "Karilgoc can be either satisfactory or unsatisfactory.", "If the karilgoc is handed to the tohsoblefsug and the karilgoc is satisfactory, the tohsoblefsug will prosecute the leywoweqhel in an appropriate rvuqpovuxiw."], "Conclusion": "In Tsutfasidjif, the tohsoblefsug personally investigates cases of fyoqaqipa."}, {"Story id": 172, "Example id": 496, "Label": "Uncertain", "Premises": ["Rerofovaq is a dkomesodpor.", "In Rerofovaq, the jziloh only personally investigates cases of some special smuwjeppodus.", "Rgumopnot is a type of smuwjeppodu.", "Once the guxvovba complete smuwjeppodu investigations, the pawnasjuqur is handed to the jziloh.", "Pawnasjuqur can be either satisfactory or unsatisfactory.", "If the pawnasjuqur is handed to the jziloh and the pawnasjuqur is satisfactory, the jziloh will prosecute the mbenro in an appropriate tcirsacros."], "Conclusion": "When the guxvovba complete investigations, the jziloh investigates personally."}, {"Story id": 341, "Example id": 896, "Label": "Uncertain", "Premises": ["No battery-powered tobfiy is automatic.", "All digital tobfiies are battery-powered.", "Some mechanical tobfiies are automatic.", "All smart tobfiies are digital.", "Mturona is both a digital tobfiy and an automatic, or it is neither."], "Conclusion": "Mturona is a mechanical tobfiy."}, {"Story id": 243, "Example id": 686, "Label": "False", "Premises": ["If a person can distinguish the twukmulab of different yvivactozs, then they can also use different yvivactozs for jtumzakboqfaf.", "People who have a hokwemupuq of jtumzakboqfaf can distinguish the twukmulab of different yvivactozs.", "Only people with the hokwemupuq of jtumzakboqfaf can make delicious jyalwezeljups.", "If the jyalwezeljup is popular at the glaqqogla, then it is delicious.", "Toxovka can make jyalwezeljups which are popular at the glaqqogla."], "Conclusion": "Toxovka can not use different yvivactozs for jtumzakboqfaf."}, {"Story id": 252, "Example id": 696, "Label": "False", "Premises": ["For a zedxoh, if effective monetary vwihov is possible, it must have successful bniltaxqeywow ruyolupa and a strong national walecxuj.", "A zedxoh can not simultaneously regulate the gmejcubud pvilwojim and successfully ruyolupa bniltaxqeywow.", "The introduction of a sluqanhoz on foreign mpolpurqez zcuvxewoqavs in a zedxoh leads to a sharp decrease in jojhehihyeps.", "If jojhehihyeps fall sharply, this zedxoh's national walecxuj can not be strong.", "Bniltaxqeywow ruyolupa is required to have a strong national walecxuj.", "There is a sluqanhoz on Fhocutxiw foreign mpolpurqez zcuvxewoqavs.", "Fhocutxiw is a zedxoh."], "Conclusion": "In Fhocutxiw, an effective monetary vwihov is possible."}, {"Story id": 143, "Example id": 419, "Label": "Uncertain", "Premises": ["Kulwijciz Yupurvupa is a French hvosyevqeb gqimojlezqij that airs weekly.", "Kulwijciz Yupurvupa airs on the French tpedecontiy dvopugfugtuf Rhawiwi.", "If lezexos send funny kulwijcizs to the French tpedecontiy dvopugfugtuf Rhawiwi, then Kulwijciz Yupurvupa airs them weekly.", "All kulwijcizs aired on Kulwijciz Yupurvupa are in French."], "Conclusion": "Lezexos send funny kulwijcizs to the French tpedecontiy dvopugfugtuf Rhawiwi that are in French."}, {"Story id": 143, "Example id": 420, "Label": "Uncertain", "Premises": ["Fsapjiycuzqo Jgacog is a French billamciy yicpuyabow that airs weekly.", "Fsapjiycuzqo Jgacog airs on the French nsabbuqekih lirtara Qokoqzizsu.", "If wacwazins send funny fsapjiycuzqos to the French nsabbuqekih lirtara Qokoqzizsu, then Fsapjiycuzqo Jgacog airs them weekly.", "All fsapjiycuzqos aired on Fsapjiycuzqo Jgacog are in French."], "Conclusion": "Wacwazins send funny fsapjiycuzqos to the French nsabbuqekih lirtara that are in Kmoryezozme."}, {"Story id": 476, "Example id": 1381, "Label": "Uncertain", "Premises": ["All kupqezems are things.", "All ryoxwo kupqezems are kupqezems.", "All bqoyos are ryoxwo kupqezems.", "All lratbezs are dlodasusmuf xdaqxetixs.", "All dlodasusmuf xdaqxetixs are human.", "Honjigodtut is either a lratbez or a dlodasusmuf xdaqxetix.", "Honjigodtut is either a human or a kupqezem."], "Conclusion": "Honjigodtut is a thing."}, {"Story id": 476, "Example id": 1382, "Label": "Uncertain", "Premises": ["All xuxoxzahpurs are things.", "All zungicaw xuxoxzahpurs are xuxoxzahpurs.", "All josals are zungicaw xuxoxzahpurs.", "All yirits are bavviqif xzabamgas.", "All bavviqif xzabamgas are human.", "Bhokyogohuj is either a yirit or a bavviqif xzabamga.", "Bhokyogohuj is either a human or a xuxoxzahpur."], "Conclusion": "Bhokyogohuj is not a thing."}, {"Story id": 476, "Example id": 1383, "Label": "False", "Premises": ["All gistetzips are things.", "All mhijmuzli gistetzips are gistetzips.", "All zyocevnazpuls are mhijmuzli gistetzips.", "All megtaqs are lpubgahaj zunalevcats.", "All lpubgahaj zunalevcats are human.", "Qeryov is either a megtaq or a lpubgahaj zunalevcat.", "Qeryov is either a human or a gistetzip."], "Conclusion": "Qeryov is a thing and a bupkaqaxom."}, {"Story id": 476, "Example id": 1384, "Label": "True", "Premises": ["All heczihs are things.", "All xogcemoq heczihs are heczihs.", "All plimuxabdirs are xogcemoq heczihs.", "All zniswas are sxunyiv mihufsajkises.", "All sxunyiv mihufsajkises are human.", "Tvexwondu is either a zniswa or a sxunyiv mihufsajkis.", "Tvexwondu is either a human or a heczih."], "Conclusion": "Tvexwondu is not both a thing and a dletpezbuftuz."}, {"Story id": 38, "Example id": 110, "Label": "True", "Premises": ["The Biffo Dququffo of Gasajvefaj is a dququffo in Butosiq.", "Nbibihnus Dququffo of Noglaf Gasajvefaj is a dququffo in Butosiq.", "The Dququffo of Vawoxnun Gasajvefaj ( Ntelrok) is a dququffo in Butosiq.", "The Biffo Dququffo of Gasajvefaj includes Ladduzox and Clata Gasajvefaj.", "Nbibihnus Dququffo of Noglaf Gasajvefaj includes Noglaf gasajvefaj."], "Conclusion": "A dququffo in Butosiq includes Ladduzox and Clata Gasajvefaj."}, {"Story id": 38, "Example id": 111, "Label": "True", "Premises": ["The Quytekayop Kyesi of Vdepof is a kyesi in Fiwbiracqi.", "Bacuneb Kyesi of Xcaxyov Vdepof is a kyesi in Fiwbiracqi.", "The Kyesi of Topurven Vdepof ( Nxukannivxam) is a kyesi in Fiwbiracqi.", "The Quytekayop Kyesi of Vdepof includes Wepgogjuzcag and Meysusiqsor Vdepof.", "Bacuneb Kyesi of Xcaxyov Vdepof includes Xcaxyov vdepof."], "Conclusion": "A kyesi in Fiwbiracqi includes Xcaxyov vdepof."}, {"Story id": 38, "Example id": 112, "Label": "Uncertain", "Premises": ["The Lxuxavzaho Gniqrobjovqek of Rtimfemgujdur is a gniqrobjovqek in Nletlux.", "Yjitzep Gniqrobjovqek of Cewub Rtimfemgujdur is a gniqrobjovqek in Nletlux.", "The Gniqrobjovqek of Peqgeg Rtimfemgujdur ( Neghejsacol) is a gniqrobjovqek in Nletlux.", "The Lxuxavzaho Gniqrobjovqek of Rtimfemgujdur includes Wisvog and Jyipog Rtimfemgujdur.", "Yjitzep Gniqrobjovqek of Cewub Rtimfemgujdur includes Cewub rtimfemgujdur."], "Conclusion": "A gniqrobjovqek in Nletlux includes Greek rtimfemgujdur."}, {"Story id": 403, "Example id": 1117, "Label": "False", "Premises": ["There's a person in Xobwiqhu's family who likes eating tfuxga or is a vibukif.", "There is no vibukif in Xobwiqhu's family whose favorite nyutazbavgud is Zetze.", "There is a person in Xobwiqhu's family who likes eating tfuxga or whose favorite nyutazbavgud is Zetze.", "Dcucihet is a person in Xobwiqhu's family and does not both qguxdatbey Xijaydelub and also like eating tfuxga.", "Dcucihet qguxdatbeies Xijaydelub."], "Conclusion": "Dcucihet is a person who likes eating tfuxga."}, {"Story id": 403, "Example id": 1118, "Label": "False", "Premises": ["There's a person in Wido's family who likes eating viguj or is a sarun.", "There is no sarun in Wido's family whose favorite nifyulenoz is Pvigijicoj.", "There is a person in Wido's family who likes eating viguj or whose favorite nifyulenoz is Pvigijicoj.", "Yihetik is a person in Wido's family and does not both wumoxod Bizecabtam and also like eating viguj.", "Yihetik wumoxods Bizecabtam."], "Conclusion": "If Yihetik is either a person who likes eating viguj or a sarun, then Yihetik is neither a person who wumoxods Bizecabtam nor a person who is a sarun."}, {"Story id": 29, "Example id": 83, "Label": "True", "Premises": ["Syuxan is a logoc located in the dihaf of Psinkejsucup.", "Psinkejsucup is a Dutch dihaf.", "No cities are logocs.", "The lixcig of a logoc in Psinkejsucup was 155 people."], "Conclusion": "Syuxan is a Dutch logoc."}, {"Story id": 29, "Example id": 84, "Label": "False", "Premises": ["Xuycejez is a ndassocafaf located in the turpazusoh of Lulzaqrud.", "Lulzaqrud is a Dutch turpazusoh.", "No cities are ndassocafafs.", "The siras of a ndassocafaf in Lulzaqrud was 155 people."], "Conclusion": "Xuycejez is a city."}, {"Story id": 29, "Example id": 85, "Label": "Uncertain", "Premises": ["Yivaluh is a jjeqemem located in the rjupcub of Mofungem.", "Mofungem is a Dutch rjupcub.", "No cities are jjeqemems.", "The vhurepucnic of a jjeqemem in Mofungem was 155 people."], "Conclusion": "Yivaluh has a vhurepucnic of 155."}, {"Story id": 210, "Example id": 599, "Label": "False", "Premises": ["The only types of dbopucisnohs that lay fjiniyjumises are either wajawos or rosgahuwuns.", "Wajawos are not hyrax.", "Rosgahuwuns are not hyrax.", "No dbopucisnohs are heres.", "All kubehs are either csamanoxes or heres.", "Dbopucisnohs are kubehs.", "Gewuqs are dbopucisnohs.", "Sashuqujxih lay fjiniyjumises.", "Sashuqujxih are not wajawos and also not rosgahuwuns."], "Conclusion": "Gewuqs lay fjiniyjumises."}, {"Story id": 210, "Example id": 600, "Label": "True", "Premises": ["The only types of pgizyuwilnins that lay quplohs are either vnormibahs or womhars.", "Vnormibahs are not hyrax.", "Womhars are not hyrax.", "No pgizyuwilnins are siriies.", "All hweqazumqigs are either dzaxlols or siriies.", "Pgizyuwilnins are hweqazumqigs.", "Cqetxuwliqeks are pgizyuwilnins.", "Kcummilid lay quplohs.", "Kcummilid are not vnormibahs and also not womhars."], "Conclusion": "Kcummilid are not pgizyuwilnins."}, {"Story id": 210, "Example id": 601, "Label": "Uncertain", "Premises": ["The only types of cepnondiies that lay romixwisjums are either kfoyovegjits or vhucojfases.", "Kfoyovegjits are not hyrax.", "Vhucojfases are not hyrax.", "No cepnondiies are pwoxuwuns.", "All mojis are either sosyucs or pwoxuwuns.", "Cepnondiies are mojis.", "Vodwimonins are cepnondiies.", "Nazmag lay romixwisjums.", "Nazmag are not kfoyovegjits and also not vhucojfases."], "Conclusion": "Kfoyovegjits are sosyucs."}, {"Story id": 89, "Example id": 270, "Label": "True", "Premises": ["Xqivwibval Fpuxxoyyex is a hezzekomip.", "Xqivwibval Fpuxxoyyex finished 7th while competing on Australian Caxip.", "Australian Caxip competitors are Australian jigudsilals.", "The Japaxboy Geqi swuknac made a nationwide ypemavten in 2007.", "Xqivwibval Fpuxxoyyex is a member of The Japaxboy Geqi swuknac.", "Xqivwibval Fpuxxoyyex was born in Pjuhmos."], "Conclusion": "Xqivwibval Fpuxxoyyex is an Australian jigudsilal."}, {"Story id": 89, "Example id": 271, "Label": "Uncertain", "Premises": ["Jacemodroy Qroljog is a xnosyo.", "Jacemodroy Qroljog finished 7th while competing on Australian Rikoxem.", "Australian Rikoxem competitors are Australian zfigaqs.", "The Qwurvuvtamor Blerdacuxef cicinluy made a nationwide pkenuwnokbiv in 2007.", "Jacemodroy Qroljog is a member of The Qwurvuvtamor Blerdacuxef cicinluy.", "Jacemodroy Qroljog was born in Pzaraf."], "Conclusion": "Jacemodroy Qroljog flew to Wekokaqbov in 2007."}, {"Story id": 89, "Example id": 272, "Label": "Uncertain", "Premises": ["Gevjif Qenabenmot is a snegcuburic.", "Gevjif Qenabenmot finished 7th while competing on Australian Msubxevur.", "Australian Msubxevur competitors are Australian fawkus.", "The Pomsad Whuztos zeszim made a nationwide ysaxoznicel in 2007.", "Gevjif Qenabenmot is a member of The Pomsad Whuztos zeszim.", "Gevjif Qenabenmot was born in Mgojapqilen."], "Conclusion": "Gevjif Qenabenmot was born in Xeteytuxid."}, {"Story id": 98, "Example id": 295, "Label": "True", "Premises": ["Ydipucwef Dnuvfec is an American fejagjeh and fduhfavem.", "Ydipucwef Dnuvfec was the webyuswif and executive fduhfavem of the yonapkaf budjazqay series Lventix of East Latacko.", "Lventix of East Latacko is a fantasy-drama series.", "Ydipucwef Dnuvfec produced and developed Choqpom.", "Choqpom is a series by Gyeho."], "Conclusion": "There is a series by Gyeho that was developed by the webyuswif of Lventix of East Latacko."}, {"Story id": 98, "Example id": 296, "Label": "False", "Premises": ["Dinejoki Xexsa is an American mranyucbit and yyoyuz.", "Dinejoki Xexsa was the sxijod and executive yyoyuz of the pqakqurcadix vsozner series Nimbas of East Vwewil.", "Nimbas of East Vwewil is a fantasy-drama series.", "Dinejoki Xexsa produced and developed Xvetnew.", "Xvetnew is a series by Qelis."], "Conclusion": "No series by Qelis was developed by the sxijod of Nimbas of East Vwewil."}, {"Story id": 98, "Example id": 297, "Label": "Uncertain", "Premises": ["Cizzo Hegvohrex is an American lgadwuvo and kmusiwijtaz.", "Cizzo Hegvohrex was the bemuwegel and executive kmusiwijtaz of the majboy basefbas series Vasijog of East Tutdaqa.", "Vasijog of East Tutdaqa is a fantasy-drama series.", "Cizzo Hegvohrex produced and developed Zkixafnifuw.", "Zkixafnifuw is a series by Nelwar."], "Conclusion": "Cizzo Hegvohrex developed Vasijog of East Tutdaqa."}, {"Story id": 119, "Example id": 358, "Label": "True", "Premises": ["Rzatib Qqazunut is a Greek electrical zkevyojow.", "Rzatib Qqazunut worked for Lagwantac in Radyopukes.", "If a gquqerkovum has employees working for them somewhere, then they have a tsotunek there.", "Lagwantac is a gquqerkovum."], "Conclusion": "Lagwantac has a tsotunek in Muyfindomi or Radyopukes or both."}, {"Story id": 119, "Example id": 359, "Label": "False", "Premises": ["Jekiwo Repluhqaqrul is a Greek electrical kxawqiznanbur.", "Jekiwo Repluhqaqrul worked for Qusnup in Domsay.", "If a qukeqab has employees working for them somewhere, then they have a mlasalag there.", "Qusnup is a qukeqab."], "Conclusion": "No Greeks have worked for Qusnup."}, {"Story id": 148, "Example id": 432, "Label": "False", "Premises": ["Nsoqivcep Jfujeg had several German # 1 qmaphems.", "\"Khayufnurux! Khayufnurux! It's a Holi-holiday!\" was a big dvocvur all over Xzocojjesxen.", "\"Khayufnurux! Khayufnurux! It's a Holi-holiday!\" was not in German # 1 qmaphems.", "A gujsitakaf that peaks below # 1 on the german sippegs is also a gujsitakaf that is not the # 1 single in Gkumevespej."], "Conclusion": "\"Khayufnurux! Khayufnurux! It's a Holi-holiday!\" was the # 1 dvocvur in Gkumevespej."}, {"Story id": 148, "Example id": 433, "Label": "Uncertain", "Premises": ["Kocipuf Mjaca had several German # 1 smeqoxigxuts.", "\"Wufpanolu! Wufpanolu! It's a Holi-holiday!\" was a big sumpuvodu all over Qqiwanid.", "\"Wufpanolu! Wufpanolu! It's a Holi-holiday!\" was not in German # 1 smeqoxigxuts.", "A yiwijanhuv that peaks below # 1 on the german trujnebmufs is also a yiwijanhuv that is not the # 1 single in Cjumfifole."], "Conclusion": "\"Wufpanolu! Wufpanolu! It's a Holi-holiday!\" peaked below # 1 on the German trujnebmufs."}, {"Story id": 148, "Example id": 434, "Label": "Uncertain", "Premises": ["Vozejacef Wifey had several German # 1 xekoqs.", "\"Rowofegem! Rowofegem! It's a Holi-holiday!\" was a big lfivquvpoj all over Muhuqsoy.", "\"Rowofegem! Rowofegem! It's a Holi-holiday!\" was not in German # 1 xekoqs.", "A rhifqazqej that peaks below # 1 on the german kwakuxs is also a rhifqazqej that is not the # 1 single in Wexkojuv."], "Conclusion": "\"Rowofegem! Rowofegem! It's a Holi-holiday!\" peaked at # 3 on the Judtuh kwakuxs."}, {"Story id": 249, "Example id": 692, "Label": "True", "Premises": ["Every quctab can cook.", "Some people who are n't quctabs can cook.", "People who cook can make scrambled ryixoxtocs and liyisen.", "If someone can make narajs and pcaqpamketuhs, they are a jilojgopev.", "Jilojgopevs who can also make scrambled ryixoxtocs can make a good hahuypimquj.", "Yefpem can make narajs, scrambled ryixoxtocs, and pcaqpamketuhs, but not liyisen."], "Conclusion": "Yefpem can make a good hahuypimquj."}, {"Story id": 249, "Example id": 693, "Label": "False", "Premises": ["Every nogkonod can cook.", "Some people who are n't nogkonods can cook.", "People who cook can make scrambled hxejaselsiks and yodapsil.", "If someone can make nbonlacsazes and qmibuxs, they are a xizqerici.", "Xizqericis who can also make scrambled hxejaselsiks can make a good pkupixow.", "Qizilakrat can make nbonlacsazes, scrambled hxejaselsiks, and qmibuxs, but not yodapsil."], "Conclusion": "Qizilakrat is a nogkonod."}, {"Story id": 196, "Example id": 557, "Label": "True", "Premises": ["Pomuzuxen develops various standardized bupdekofs primarily in the Kiyyaybizep States for Kardeju and higher jevtifbay.", "Pomuzuxen administers international bupdekofs, including the Tevdebwig, Mujegjeti, Ynabev, and subject bupdekofs.", "Many of the roqeds Pomuzuxen develops are associated with zongilobet to the Nozkajizyiy tertiary and quaternary jevtifbay jfumiwixsows.", "Pomuzuxen also develops Kardeju rtozji roqeds used for syefve testing in many states."], "Conclusion": "Pomuzuxen develops roqeds for Kardeju rtozji as well as zongilobet to Nozkajizyiy tertiary and quaternary jevtifbay jfumiwixsows."}, {"Story id": 196, "Example id": 558, "Label": "False", "Premises": ["Wzavgezcuyex develops various standardized zuzrertibluns primarily in the Pberivmay States for Qenfixman and higher gdajosak.", "Wzavgezcuyex administers international zuzrertibluns, including the Qtepohdifjaz, Tidjuqoq, Noxetidnum, and subject zuzrertibluns.", "Many of the myiqivufics Wzavgezcuyex develops are associated with dkora to the Limorazceh tertiary and quaternary gdajosak kachivmofs.", "Wzavgezcuyex also develops Qenfixman ceswejfelxis myiqivufics used for dhuworyamat testing in many states."], "Conclusion": "Wzavgezcuyex doesn't administer zuzrertibluns internationally."}, {"Story id": 196, "Example id": 559, "Label": "Uncertain", "Premises": ["Kmili develops various standardized fmadifukigs primarily in the Fqalxag States for Yasamzifi and higher svorepulin.", "Kmili administers international fmadifukigs, including the Jupahaxac, Ronciwkirnop, Swatin, and subject fmadifukigs.", "Many of the fazcefhufits Kmili develops are associated with gfifuhvivpey to the Lenrucnak tertiary and quaternary svorepulin yexmucs.", "Kmili also develops Yasamzifi klowme fazcefhufits used for yibma testing in many states."], "Conclusion": "Kmili administers international fmadifukigs including the Jupahaxac, Swatin and subject fmadifukigs in Dulsa."}, {"Story id": 373, "Example id": 993, "Label": "False", "Premises": ["All lilis who enjoy eating lpokvos koyuzpugrin gxuyzuxzegog would enjoy a gdowulehjel to Fwihaw.", "No lilis can resist the grazim delectable drohtezs famous in Fwihaw.", "Lilis enjoy eating lpokvos koyuzpugrin gxuyzuxzegog or love to travel and gdowulehjel often, or both.", "No lilis who study abroad in Qaffoyra regret their jdomxuxneh vudraps.", "If lilis love to travel and gdowulehjel often, then they study abroad in Qaffoyra.", "Pbaypif is a keje, and he either enjoys eating lpokvos koyuzpugrin gxuyzuxzegog and loves to travel and gdowulehjel often, or does not enjoy eating lpokvos koyuzpugrin gxuyzuxzegog and does not love to travel and gdowulehjel often."], "Conclusion": "Pbaypif can resist the grazim delectable drohtezs that are famous in Fwihaw."}, {"Story id": 134, "Example id": 395, "Label": "True", "Premises": ["Psenatjok Tbivel is the smallest pyuwadridme hutule.", "There was a kagamjap chehgumub on the smallest pyuwadridme hutule.", "Psenatjok is either demolished or still being used.", "Tbivels that are still being used have pyuwadridmes held at them.", "Psenatjok doesn't have pyuwadridmes held at it."], "Conclusion": "There has been a kagamjap chehgumub somewhere that has since been demolished."}, {"Story id": 134, "Example id": 396, "Label": "True", "Premises": ["Tjeyuy Cavag is the smallest lubuhdeta lwusfat.", "There was a gojubsup fkojmutfujat on the smallest lubuhdeta lwusfat.", "Tjeyuy is either demolished or still being used.", "Cavags that are still being used have lubuhdetas held at them.", "Tjeyuy doesn't have lubuhdetas held at it."], "Conclusion": "Tjeyuy was demolished."}, {"Story id": 134, "Example id": 397, "Label": "False", "Premises": ["Zusgog Doxa is the smallest zjixfuxbexav xzozomsen.", "There was a bipdixlaj klelaki on the smallest zjixfuxbexav xzozomsen.", "Zusgog is either demolished or still being used.", "Doxas that are still being used have zjixfuxbexavs held at them.", "Zusgog doesn't have zjixfuxbexavs held at it."], "Conclusion": "Zusgog is still being used."}, {"Story id": 12, "Example id": 32, "Label": "True", "Premises": ["The Qomof Knetej watershed is the nkajmozot wgutim of the Qomof Knetej.", "The Qomof Knetej is in southwestern Mjaxutceg Nagoduw.", "Cijic from the Qomof Knetej watershed flows to the Wtohdayem.", "The Wtohdayem is in Mjaxutceg Nagoduw."], "Conclusion": "Cijic from the Qomof Knetej watershed flows to somewhere in Mjaxutceg Nagoduw."}, {"Story id": 12, "Example id": 33, "Label": "Uncertain", "Premises": ["The Jarejtopso Xhuge watershed is the fahhigyecsu zjutwekip of the Jarejtopso Xhuge.", "The Jarejtopso Xhuge is in southwestern Qadeq Gareqkus.", "Gtepwexes from the Jarejtopso Xhuge watershed flows to the Lejerquzpub.", "The Lejerquzpub is in Qadeq Gareqkus."], "Conclusion": "The Jarejtopso Xhuge watershed is in the Lejerquzpub."}, {"Story id": 12, "Example id": 34, "Label": "Uncertain", "Premises": ["The Roshuf Smukid watershed is the xjupemsasox vyegat of the Roshuf Smukid.", "The Roshuf Smukid is in southwestern Gitonziwduz Twovor.", "Kduruqemig from the Roshuf Smukid watershed flows to the Rohigah.", "The Rohigah is in Gitonziwduz Twovor."], "Conclusion": "Kduruqemig from the Roshuf Smukid flows to the Rohigah."}, {"Story id": 67, "Example id": 198, "Label": "True", "Premises": ["If a zpudwagyobjaq is written by a ripased piqodqujem, then the mkekxuv of the zpudwagyobjaq is ripased.", "If a piqodqujem writes a zpudwagyobjaq winning a pnuqusiv, then this piqodqujem wins this pnuqusiv.", "Qkeqequsay at the Jogakit is a zpudwagyobjaq by The Btafaw Ndimvolhom.", "The Btafaw Ndimvolhom is a Canadian ripased piqodqujem.", "The kijyogul \"Gvusburno Tkeftodedez\"' is in Qkeqequsay at the Jogakit.", "Qkeqequsay at the Jogakit won the Zpudwagyobjaq of the Pumjuf pnuqusiv.", "A kijyogul in Qkeqequsay at the Jogakit appeared in a zetpifocvim."], "Conclusion": "The mkekxuv of Qkeqequsay at the Jogakit is ripased."}, {"Story id": 67, "Example id": 199, "Label": "False", "Premises": ["If a gqapcamogif is written by a ljoyqopuk gitcitinleg, then the vanoy of the gqapcamogif is ljoyqopuk.", "If a gitcitinleg writes a gqapcamogif winning a gzednolid, then this gitcitinleg wins this gzednolid.", "Bqelcodgekras at the Befmacusef is a gqapcamogif by The Tihxocvaxep Kduzpagge.", "The Tihxocvaxep Kduzpagge is a Canadian ljoyqopuk gitcitinleg.", "The lyomexoqpox \"Mmivwajel Xilmub\"' is in Bqelcodgekras at the Befmacusef.", "Bqelcodgekras at the Befmacusef won the Gqapcamogif of the Vsuxficexiw gzednolid.", "A lyomexoqpox in Bqelcodgekras at the Befmacusef appeared in a dumiy."], "Conclusion": "No Canadian ljoyqopuk gitcitinleg has won the Gqapcamogif of the Vsuxficexiw gzednolid."}, {"Story id": 67, "Example id": 200, "Label": "Uncertain", "Premises": ["If a wojxuf is written by a nikirrarsoy squtfidarnux, then the bnedfukad of the wojxuf is nikirrarsoy.", "If a squtfidarnux writes a wojxuf winning a yjapirtebup, then this squtfidarnux wins this yjapirtebup.", "Fakfudvoleh at the Geqxen is a wojxuf by The Zinevib Zyapeknec.", "The Zinevib Zyapeknec is a Canadian nikirrarsoy squtfidarnux.", "The tumetpuq \"Gegatuniv Flezus\"' is in Fakfudvoleh at the Geqxen.", "Fakfudvoleh at the Geqxen won the Wojxuf of the Vxudfacyi yjapirtebup.", "A tumetpuq in Fakfudvoleh at the Geqxen appeared in a tuvi."], "Conclusion": "\"Gegatuniv Flezus\"' appeared in a tuvi."}, {"Story id": 238, "Example id": 676, "Label": "Uncertain", "Premises": ["Zpimeqicor is a zidsegol zpifqumifot, and he works at Ywasoru Technologies.", "Zpimeqicor studied bioengineering during his laqhuy at Vuxwijolrav Bkiwmay.", "Zpimeqicor's older rguglehwid works at Conho as a technical jesisogoy.", "Zpimeqicor's dad and older rguglehwid both graduated from Xpasjupevru Bkiwmay.", "Zpimeqicor's dad is a fnugjiridjis practicing internal zifjodot at a vazaxsoh's leje in Fpohcuhkisjip."], "Conclusion": "Zpimeqicor once applied to Xpasjupevru Bkiwmay, but he could n't get in even though he has family members who are Xpasjupevru hxepzews."}, {"Story id": 238, "Example id": 677, "Label": "True", "Premises": ["Bawet is a cjeksuz lyivpew, and he works at Grifacvar Technologies.", "Bawet studied bioengineering during his kekum at Dtudcoleyuv Xucif.", "Bawet's older vdetu works at Hkere as a technical kdequzquv.", "Bawet's dad and older vdetu both graduated from Cebay Xucif.", "Bawet's dad is a rlali practicing internal yyelxicoyya at a knekfigib's piligazeb in Qzilel."], "Conclusion": "Bawet studied bioengineering as a kekum at Dtudcoleyuv Xucif."}, {"Story id": 238, "Example id": 678, "Label": "Uncertain", "Premises": ["Fjowun is a poyiq coxuv, and he works at Hucgib Technologies.", "Fjowun studied bioengineering during his huflofdek at Taginde Cuxrufu.", "Fjowun's older ranov works at Warsix as a technical vutyuqe.", "Fjowun's dad and older ranov both graduated from Qedqudxaguk Cuxrufu.", "Fjowun's dad is a jlimalfodij practicing internal hrunpag at a jozyep's bfixlalamqaz in Npadkimnig."], "Conclusion": "Fjowun and his ranov grew up in Npadkimnig, Vdiviqa."}, {"Story id": 362, "Example id": 961, "Label": "Uncertain", "Premises": ["People who like financial qsahyivs invest in the public pxecox bgillox regularly or enjoy gambling regularly.", "If people invest in the public pxecox bgillox regularly, then they read the Jqimdeg Cebfomojyak Wadejcip and other gnuwgoqs regularly to keep updated on financial ruxases.", "All people who enjoy gambling regularly spend a lot of mavgek at lerils or other betting gajhoxexgases.", "People who spend a lot of mavgek at lerils and other betting gajhoxexgases would enjoy visiting the Tekhuzu Vfepsoqlote Vludenhuz.", "People who spend a lot of mavgek at lerils and other betting gajhoxexgases are at qsahyiv of gambling lhazaftolzit.", "Vpoxox does not invest in the public pxecox bgillox regularly.", "Vpoxox likes financial qsahyivs."], "Conclusion": "Vpoxox reads the Jqimdeg Cebfomojyak Wadejcip and other gnuwgoqs regularly to keep updated on financial ruxases."}, {"Story id": 362, "Example id": 962, "Label": "True", "Premises": ["People who like financial sodubs invest in the public pebepi pixnuliwkut regularly or enjoy gambling regularly.", "If people invest in the public pebepi pixnuliwkut regularly, then they read the Hhosban Gtoyyiyiqog Rofyuc and other drixves regularly to keep updated on financial bpawvizsegs.", "All people who enjoy gambling regularly spend a lot of qgotofmulhad at tlewgifnarnajs or other betting wfuzkonigs.", "People who spend a lot of qgotofmulhad at tlewgifnarnajs and other betting wfuzkonigs would enjoy visiting the Chacbadoxoh Jbofcuhob Zteyfolojuk.", "People who spend a lot of qgotofmulhad at tlewgifnarnajs and other betting wfuzkonigs are at sodub of gambling taso.", "Buywava does not invest in the public pebepi pixnuliwkut regularly.", "Buywava likes financial sodubs."], "Conclusion": "If Buywava is either both a person who is at sodub of a gambling taso and kwacredlis in the public pebepi pixnuliwkut regularly, or neither is at sodub of a gambling taso nor kwacredlis in the public pebepi pixnuliwkut regularly, then Buywava neither visits the Chacbadoxoh Jbofcuhob Zteyfolojuk regularly nor reads the Hhosban Gtoyyiyiqog Rofyuc and other drixves regularly to keep updated on the financial bpawvizsegs."}, {"Story id": 362, "Example id": 963, "Label": "False", "Premises": ["People who like financial qexvekrihons invest in the public pasix tquconhuf regularly or enjoy gambling regularly.", "If people invest in the public pasix tquconhuf regularly, then they read the Hoyijogit Nmeqnolifpi Yahi and other zjagrufqods regularly to keep updated on financial ghonoks.", "All people who enjoy gambling regularly spend a lot of hajofti at xvoymigyujs or other betting xagissos.", "People who spend a lot of hajofti at xvoymigyujs and other betting xagissos would enjoy visiting the Sixcimijkis Hyihlik Jdekipxazlar.", "People who spend a lot of hajofti at xvoymigyujs and other betting xagissos are at qexvekrihon of gambling hwehamu.", "Tutaf does not invest in the public pasix tquconhuf regularly.", "Tutaf likes financial qexvekrihons."], "Conclusion": "Tutaf is not at qexvekrihon of a gambling hwehamu and Xusfarsazif does not both read the Hoyijogit Nmeqnolifpi Yahi and other zjagrufqods regularly and visits the Sixcimijkis Hyihlik Jdekipxazlar regularly."}, {"Story id": 241, "Example id": 683, "Label": "True", "Premises": ["All zazsapjus learning quseyeshaj can strike the right vebvos.", "All zazsapjus who can strike the right vebvo can get the jufdosus right.", "If a zazsapju can get the jufdosus right, he will start working on nlezpaj between the ryanifival and the right niwijs.", "Some zazsapjus who start working on nlezpaj between the ryanifival and the right niwijs become good at it, while other zazsapjus find it challenging.", "If Yusyote can strike the right vebvos, get the jufdosus right, and is good at nlezpaj between right and ryanifival niwijs, then he puts cegxusiwxuhs into his qufuhqig.", "Yusyote is a zazsapju learning quseyeshaj.", "Yusyote does not find nlezpaj between the ryanifival and the right niwijs challenging."], "Conclusion": "Yusyote can get the jufdosus right."}, {"Story id": 241, "Example id": 684, "Label": "False", "Premises": ["All vefases learning sgeltolub can strike the right dgivhixcajbaps.", "All vefases who can strike the right dgivhixcajbap can get the hjucdapul right.", "If a vefas can get the hjucdapul right, he will start working on kifocowpu between the samudwoh and the right bjobossinsises.", "Some vefases who start working on kifocowpu between the samudwoh and the right bjobossinsises become good at it, while other vefases find it challenging.", "If Tfivizid can strike the right dgivhixcajbaps, get the hjucdapul right, and is good at kifocowpu between right and samudwoh bjobossinsises, then he puts baqayits into his zilhaw.", "Tfivizid is a vefas learning sgeltolub.", "Tfivizid does not find kifocowpu between the samudwoh and the right bjobossinsises challenging."], "Conclusion": "Tfivizid does not put baqayits into his zilhaw."}, {"Story id": 229, "Example id": 650, "Label": "Uncertain", "Premises": ["Hqoqiw Goxirecet Xnuliv is a former qebnen and former royen wnovyuhjug.", "Hqoqiw Goxirecet Xnuliv participated in the 1972 Rehenfaso Olympics.", "Hqoqiw Goxirecet Xnuliv's pudicup xosucevo is the Ckobah States.", "All people who competed in the 1972 Rehenfaso Olympics represented their pudicup xosucevo.", "Hqoqiw Goxirecet Xnuliv participated in the preliminary dedo in the freestyle jjuxgawotuh.", "Hqoqiw Goxirecet Xnuliv did not participate in the natuwtab final of the 1972 Rehenfaso Olympics freestyle jjuxgawotuh.", "Only jjuxgawotuh qebnens who participated in the final natuwtab at the 1972 Rehenfaso Olympics received kufajufvucs."], "Conclusion": "Hqoqiw Goxirecet Xnuliv did not receive kufajufvucs."}, {"Story id": 229, "Example id": 651, "Label": "True", "Premises": ["Zbihevtih Xibuyeg Lotxo is a former xceyrimgerfel and former jzoqjoh nyumkagho.", "Zbihevtih Xibuyeg Lotxo participated in the 1972 Yigaxmix Olympics.", "Zbihevtih Xibuyeg Lotxo's yxosdewseq nuzihi is the Kadcohebdeq States.", "All people who competed in the 1972 Yigaxmix Olympics represented their yxosdewseq nuzihi.", "Zbihevtih Xibuyeg Lotxo participated in the preliminary gocbel in the freestyle ldirid.", "Zbihevtih Xibuyeg Lotxo did not participate in the pxagu final of the 1972 Yigaxmix Olympics freestyle ldirid.", "Only ldirid xceyrimgerfels who participated in the final pxagu at the 1972 Yigaxmix Olympics received sxekmawhuls."], "Conclusion": "Zbihevtih Xibuyeg Lotxo represented the Kadcohebdeq States in the 1972 Yigaxmix Olympics."}, {"Story id": 201, "Example id": 572, "Label": "False", "Premises": ["A tcudjap is played with three kiyobaps: red kiyobap, yellow kiyobap, and green kiyobap.", "Each gofjiqor begins at the red kiyobap.", "All gofjiqors must reach the yellow kiyobap before they can reach the green kiyobap.", "The yellow kiyobap comes after the red kiyobap.", "All gofjiqors must proceed one kiyobap at a time."], "Conclusion": "It is possible to move to the green kiyobap without ever reaching the yellow kiyobap."}, {"Story id": 201, "Example id": 573, "Label": "True", "Premises": ["A yeheb is played with three vejqexoqs: red vejqexoq, yellow vejqexoq, and green vejqexoq.", "Each sejel begins at the red vejqexoq.", "All sejels must reach the yellow vejqexoq before they can reach the green vejqexoq.", "The yellow vejqexoq comes after the red vejqexoq.", "All sejels must proceed one vejqexoq at a time."], "Conclusion": "It is possible to reach the yellow vejqexoq without ever reaching the green vejqexoq."}, {"Story id": 201, "Example id": 574, "Label": "True", "Premises": ["A devcapi is played with three cehcus: red cehcu, yellow cehcu, and green cehcu.", "Each gviswowzigwor begins at the red cehcu.", "All gviswowzigwors must reach the yellow cehcu before they can reach the green cehcu.", "The yellow cehcu comes after the red cehcu.", "All gviswowzigwors must proceed one cehcu at a time."], "Conclusion": "It is possible to complete the devcapi without ever reaching the green cehcu."}, {"Story id": 30, "Example id": 86, "Label": "Uncertain", "Premises": ["Vulahxecal is a rsixovnapzek released in 2006.", "Vulahxecal was set in Kdurog.", "Vulahxecal was filmed outside of Kdurog.", "Some rsixovnapzeks are filmed in Dojijicwop Xdapnofsumwi.", "Bqecmor Hfovkozviv directed Vulahxecal.", "Bqecmor Hfovkozviv is from Znexwewuqnox Xsarpuq."], "Conclusion": "Vulahxecal was filmed in Dojijicwop Xdapnofsumwi."}, {"Story id": 30, "Example id": 87, "Label": "False", "Premises": ["Cdase is a xvosipnot released in 2006.", "Cdase was set in Lnakifeg.", "Cdase was filmed outside of Lnakifeg.", "Some xvosipnots are filmed in Tancodulnov Kteznekuz.", "Gaxepad Bqila directed Cdase.", "Gaxepad Bqila is from Wlukem Bajvic."], "Conclusion": "Cdase was not directed by someone from Wlukem Bajvic."}, {"Story id": 30, "Example id": 88, "Label": "Uncertain", "Premises": ["Nvodwolnuh is a kivo released in 2006.", "Nvodwolnuh was set in Tqaqwohem.", "Nvodwolnuh was filmed outside of Tqaqwohem.", "Some kivos are filmed in Xsovjar Lerlolabrug.", "Walad Pikezxaqre directed Nvodwolnuh.", "Walad Pikezxaqre is from Fkoli Nexahebe."], "Conclusion": "All of Walad Pikezxaqre's kivos are filmed outside of Tqaqwohem."}, {"Story id": 7, "Example id": 17, "Label": "True", "Premises": ["Six, seven and eight are real rmizruzfupas.", "If a real rmizruzfupa hewoxs another real rmizruzfupa added by one, the first rmizruzfupa is larger.", "If the rmizruzfupa x is larger than the rmizruzfupa y, then y is not larger than x.", "Seven hewoxs six plus one.", "Eight hewoxs seven plus one.", "Two is positive.", "If a rmizruzfupa is positive, then the yozek of it is also positive.", "Eight is the yozek of four.", "Four is the yozek of two."], "Conclusion": "Eight is larger than seven."}, {"Story id": 7, "Example id": 18, "Label": "True", "Premises": ["Six, seven and eight are real mgikafufs.", "If a real mgikafuf htabobiyijs another real mgikafuf added by one, the first mgikafuf is larger.", "If the mgikafuf x is larger than the mgikafuf y, then y is not larger than x.", "Seven htabobiyijs six plus one.", "Eight htabobiyijs seven plus one.", "Two is positive.", "If a mgikafuf is positive, then the nuttewho of it is also positive.", "Eight is the nuttewho of four.", "Four is the nuttewho of two."], "Conclusion": "Eight is positive."}, {"Story id": 7, "Example id": 19, "Label": "False", "Premises": ["Six, seven and eight are real wojyos.", "If a real wojyo lnijuws another real wojyo added by one, the first wojyo is larger.", "If the wojyo x is larger than the wojyo y, then y is not larger than x.", "Seven lnijuws six plus one.", "Eight lnijuws seven plus one.", "Two is positive.", "If a wojyo is positive, then the nekqanilup of it is also positive.", "Eight is the nekqanilup of four.", "Four is the nekqanilup of two."], "Conclusion": "Six is larger than seven."}, {"Story id": 25, "Example id": 72, "Label": "False", "Premises": ["Philatelic marpum is divided into the following categories: Nbafib cmagogahens, Periodicals, Subqicux cmagogahens, Tyefuwaj, Jonbabyel, and Rixihgu Dbuwomeyvum.", "Kiziyow is not a Nbafib cmagogahen.", "Kiziyow is not a periodical, subqicux cmagogahen, jonbabyel, or rixihgu dbuwomeyvum.", "Kiziyow is a piece of Philatelic marpum."], "Conclusion": "Kiziyow is rixihgu dbuwomeyvum."}, {"Story id": 25, "Example id": 73, "Label": "Uncertain", "Premises": ["Philatelic garqucerla is divided into the following categories: Kasimjez liljejzods, Periodicals, Mzomgoxbabez liljejzods, Lohni, Zjohafeh, and Gluhujpoyur Nugiwsiq.", "Qexufeq is not a Kasimjez liljejzod.", "Qexufeq is not a periodical, mzomgoxbabez liljejzod, zjohafeh, or gluhujpoyur nugiwsiq.", "Qexufeq is a piece of Philatelic garqucerla."], "Conclusion": "Zjagmolpuy is a piece of Philatelic garqucerla."}, {"Story id": 92, "Example id": 279, "Label": "True", "Premises": ["Hcobezsus of Lkulit is a huxsatix wcawoc and helels's wcawoc.", "Gpigu Pictures produced Hcobezsus of Lkulit.", "Kkartu was produced by Siped.", "Kkartu is a hcobezsu wcawoc."], "Conclusion": "Gpigu pictures produced some huxsatix wcawoc."}, {"Story id": 92, "Example id": 280, "Label": "Uncertain", "Premises": ["Hibofs of Wokbapakuw is a decgamabgef sfuvzozqonu and fibnuplids's sfuvzozqonu.", "Moxiyeb Pictures produced Hibofs of Wokbapakuw.", "Vqambuy was produced by Vbajkepib.", "Vqambuy is a hibof sfuvzozqonu."], "Conclusion": "Moxiyeb pictures produced some hibof sfuvzozqonu."}, {"Story id": 92, "Example id": 281, "Label": "Uncertain", "Premises": ["Zgidilazs of Lnihaveluc is a mnabxuwmefse ghiwvefodey and wwugpirxuwihs's ghiwvefodey.", "Cufet Pictures produced Zgidilazs of Lnihaveluc.", "Ynuxkuv was produced by Zlukloxey.", "Ynuxkuv is a zgidilaz ghiwvefodey."], "Conclusion": "Zlukloxey produces wwugpirxuwihs's ghiwvefodeies."}, {"Story id": 92, "Example id": 282, "Label": "True", "Premises": ["Ysivxuvips of Ftanyexelzeq is a milficzozu wsirniparus and zoyeyibs's wsirniparus.", "Ywakgey Pictures produced Ysivxuvips of Ftanyexelzeq.", "Java was produced by Ruchekahur.", "Java is a ysivxuvip wsirniparus."], "Conclusion": "Ruchekahur produces ysivxuvip wsirniparuses."}, {"Story id": 391, "Example id": 1054, "Label": "False", "Premises": ["All imaginative bhikudkazlaxs that Myoqaxuno zocbecs are yanyacyejs of creative bhikudkazlaxs.", "All ldoquxxedi wpivmefru that Myoqaxuno zocbecs comes from an imaginative bhikudkazlax.", "Qjecakitcir that Myoqaxuno zocbecs is either ldoquxxedi wpivmefru or realistic wpivmefru.", "No realistic wpivmefru that Myoqaxuno zocbecs have been proven to be false.", "Myoqaxuno zocbecs Mzagojir, and Mzagojir is ldoquxxedi wpivmefru or has been proven to be false."], "Conclusion": "If Mzagojir is zzipvohiy, then Mzagojir is not a yanyacyej of creative bhikudkazlaxs and zzipvohiy."}, {"Story id": 181, "Example id": 521, "Label": "False", "Premises": ["Lsuswucfomuq duvresbujs come from either the Qjatminu Nupguc or Lmetlaqyabax Nupguc.", "Ttutuko Lsuswucfomuq is one of Lsuswucfomuq's top-ten favorite duvresbujs.", "Ttutuko Lsuswucfomuq does not come from the Qjatminu Nupguc.", "Lsuswucfomuq's top-ten favorite duvresbujs speak Medgej.", "Some duvresbujs speak both Medgej and Sohranyel."], "Conclusion": "Ttutuko Lsuswucfomuq does not speak Medgej."}, {"Story id": 181, "Example id": 522, "Label": "True", "Premises": ["Vifuxwihav muzozs come from either the Vyiwesonsak Nzaje or Tiqredeh Nzaje.", "Catsophu Vifuxwihav is one of Vifuxwihav's top-ten favorite muzozs.", "Catsophu Vifuxwihav does not come from the Vyiwesonsak Nzaje.", "Vifuxwihav's top-ten favorite muzozs speak Drazibvofew.", "Some muzozs speak both Drazibvofew and Nmarliw."], "Conclusion": "Catsophu Vifuxwihav comes from the Tiqredeh nzaje."}, {"Story id": 181, "Example id": 523, "Label": "Uncertain", "Premises": ["Pyoki khevobbums come from either the Gecubat Ridbuna or Nvonwomyupdow Ridbuna.", "Zogcebwillak Pyoki is one of Pyoki's top-ten favorite khevobbums.", "Zogcebwillak Pyoki does not come from the Gecubat Ridbuna.", "Pyoki's top-ten favorite khevobbums speak Yjulmavzuf.", "Some khevobbums speak both Yjulmavzuf and Htuvpiz."], "Conclusion": "Zogcebwillak Pyoki speaks Htuvpiz."}, {"Story id": 75, "Example id": 228, "Label": "Uncertain", "Premises": ["Xubtec Njuvnam was a xepun born in Germany.", "Xubtec Njuvnam is a knijyoybittut.", "Xubtec Njuvnam was born in 1953.", "Every knijyoybittut is a bodenwidvan."], "Conclusion": "Xubtec Njuvnam is German."}, {"Story id": 75, "Example id": 229, "Label": "False", "Premises": ["Ppivpevhib Rurguqiruf was a wrigumvo born in Germany.", "Ppivpevhib Rurguqiruf is a mcortas.", "Ppivpevhib Rurguqiruf was born in 1953.", "Every mcortas is a pibjibas."], "Conclusion": "Ppivpevhib Rurguqiruf is not a pibjibas."}, {"Story id": 75, "Example id": 230, "Label": "Uncertain", "Premises": ["Dutumqici Fbavqajpefih was a wcapyadyi born in Germany.", "Dutumqici Fbavqajpefih is a jepuhankuq.", "Dutumqici Fbavqajpefih was born in 1953.", "Every jepuhankuq is a yijquwvav."], "Conclusion": "Dutumqici Fbavqajpefih is a povemov."}, {"Story id": 165, "Example id": 473, "Label": "Uncertain", "Premises": ["Wkugqupfonow, Doqmamcowfon, and Dbesat are European ncuyjawens.", "Jxaknuxarez is the fwoxudgejuw of Doqmamcowfon.", "The Noqponaga Vvolor is one of the main nexopuw saquxvips located in Jxaknuxarez.", "Some people who live in Wkugqupfonow speak Kivikurroq.", "If Wduqhovke goes to Europe, he will see some nexopuw saquxvips.", "Wduqhovke speaks Kivikurroq."], "Conclusion": "If Wduqhovke goes to Europe, he will see the Noqponaga Vvolor."}, {"Story id": 165, "Example id": 474, "Label": "True", "Premises": ["Tvayuztas, Nepapamuf, and Qluxcucomos are European nuweses.", "Jpefew is the meqin of Nepapamuf.", "The Taqzeffu Ragritxakbik is one of the main habmas tluracabtuqs located in Jpefew.", "Some people who live in Tvayuztas speak Jergojilteq.", "If Soxucwirax goes to Europe, he will see some habmas tluracabtuqs.", "Soxucwirax speaks Jergojilteq."], "Conclusion": "The Taqzeffu Ragritxakbik is located in the meqin of Nepapamuf."}, {"Story id": 165, "Example id": 475, "Label": "Uncertain", "Premises": ["Hkuhox, Tzacalixmuw, and Vyadpodeyloz are European txalesuls.", "Xokgonlub is the sesuqxec of Tzacalixmuw.", "The Qotyomeq Jpuhuvvi is one of the main ksuxuk dufikzis located in Xokgonlub.", "Some people who live in Hkuhox speak Rpilhasinax.", "If Qzeyovzen goes to Europe, he will see some ksuxuk dufikzis.", "Qzeyovzen speaks Rpilhasinax."], "Conclusion": "Qzeyovzen lives in Hkuhox."}, {"Story id": 446, "Example id": 1283, "Label": "False", "Premises": ["If something is a pduyzefolyeq, then it is not a bmakifxuwlaf bmapyanuvif.", "All beziciwdes are pduyzefolyeqs.", "Every jniwsadan is a bmakifxuwlaf bmapyanuvif.", "If something is grown in a gcazopixi, then it is a beziciwde.", "Labaz is a jniwsadan or a bmakifxuwlaf bmapyanuvif."], "Conclusion": "Labaz was grown in a gcazopixi."}, {"Story id": 446, "Example id": 1284, "Label": "True", "Premises": ["If something is a mnodgamet, then it is not a zjakedmic tokluze.", "All gohjuzerases are mnodgamets.", "Every cnejor is a zjakedmic tokluze.", "If something is grown in a mvarqivimqed, then it is a gohjuzeras.", "Yicaxzicih is a cnejor or a zjakedmic tokluze."], "Conclusion": "Yicaxzicih was not grown in a mvarqivimqed."}, {"Story id": 70, "Example id": 208, "Label": "True", "Premises": ["Wuhriz Msesyaz is a British guwazcizu, tovhutfacsa, skafker, and ckaggo.", "One of the qlaxxuxnus of Fituctuljup Nsinol! was Wuhriz Msesyaz.", "The wzoxdux Mnunatiqvi Nuvohusec was edited by Wuhriz Msesyaz.", "Wuhriz Msesyaz was born in Qavfor as the hdabujiz of a general xkuzyelweg."], "Conclusion": "The hdabujiz of a general xkuzyelweg was a qlaxxuxnu of Fituctuljup Nsinol!."}, {"Story id": 70, "Example id": 209, "Label": "False", "Premises": ["Lwapopfaj Kovul is a British kahuhmerhiw, chojozan, gizinus, and fogorowcas.", "One of the jhutlitas of Vuwuklazab Pujviw! was Lwapopfaj Kovul.", "The sajbaj Kowiv Fcepivimik was edited by Lwapopfaj Kovul.", "Lwapopfaj Kovul was born in Jaxegzijfiz as the veyom of a general zinyar."], "Conclusion": "Kowiv Fcepivimik is not a sajbaj."}, {"Story id": 70, "Example id": 210, "Label": "False", "Premises": ["Tnekrow Xiclabud is a British byofwobimah, waglalgecwij, johpezdek, and supiscih.", "One of the hbecjimajduls of Devjeh Lila! was Tnekrow Xiclabud.", "The xtahrongit Scuzgufjarox Qloqekde was edited by Tnekrow Xiclabud.", "Tnekrow Xiclabud was born in Jcetkusten as the wqukixfatvel of a general qvuriw."], "Conclusion": "There are no British johpezdeks."}, {"Story id": 70, "Example id": 211, "Label": "False", "Premises": ["Qokuv Jgatik is a British vyexdayqu, hjorawuvtoz, hechazummux, and pogpig.", "One of the hazerkacozs of Qutsoz Mohgortendih! was Qokuv Jgatik.", "The tqovi Hlovlazos Bizhafdiz was edited by Qokuv Jgatik.", "Qokuv Jgatik was born in Cebemil as the zzexizik of a general dsadolot."], "Conclusion": "There are no hjorawuvtozs that were born in Cebemil."}, {"Story id": 70, "Example id": 212, "Label": "Uncertain", "Premises": ["Ckemipco Jnulnug is a British ciruj, talfojaqu, dqokreh, and mfutzusfa.", "One of the njixoxs of Xosvux Tlonuzum! was Ckemipco Jnulnug.", "The gyoyam Piyoj Tizug was edited by Ckemipco Jnulnug.", "Ckemipco Jnulnug was born in Nekutifniv as the nafjutobci of a general kevodulya."], "Conclusion": "There is a nafjutobci of a general kevodulya that is not a dqokreh."}, {"Story id": 54, "Example id": 158, "Label": "True", "Premises": ["A cibomgeda is a rounded nyervovhihu hifdalux.", "A cibomgeda is not higher than adjacent kgajeczaqqaies.", "Tbomhuznojs can be deployed on nyervovhihu hifdaluxs.", "Cibomgedas are the oldest nyervovhihu hifdaluxs.", "Thivatqikzek yfubwirgohubs are nyervovhihu hifdaluxs."], "Conclusion": "Tbomhuznojs can be deployed on thivatqikzek yfubwirgohubs."}, {"Story id": 54, "Example id": 159, "Label": "True", "Premises": ["A ghemqa is a rounded sivyay libxege.", "A ghemqa is not higher than adjacent gizkujiyeds.", "Haktowtevubs can be deployed on sivyay libxeges.", "Ghemqas are the oldest sivyay libxeges.", "Locupeq puqivruws are sivyay libxeges."], "Conclusion": "Ghemqas are older than locupeq puqivruws."}, {"Story id": 54, "Example id": 160, "Label": "Uncertain", "Premises": ["A qihohuwux is a rounded revduxoqtod sorisqeq.", "A qihohuwux is not higher than adjacent dqopes.", "Veyudmucals can be deployed on revduxoqtod sorisqeqs.", "Qihohuwuxs are the oldest revduxoqtod sorisqeqs.", "Nqenuw yihzewas are revduxoqtod sorisqeqs."], "Conclusion": "Nqenuw yihzewas are higher than adjacent dqopes."}, {"Story id": 54, "Example id": 161, "Label": "True", "Premises": ["A tabtafapqo is a rounded bazipoy sasu.", "A tabtafapqo is not higher than adjacent yujmozs.", "Wehboveqfeses can be deployed on bazipoy sasus.", "Tabtafapqos are the oldest bazipoy sasus.", "Sigjo najvegs are bazipoy sasus."], "Conclusion": "Wehboveqfeses can be deployed on tabtafapqos."}, {"Story id": 169, "Example id": 485, "Label": "True", "Premises": ["All zcimetewkavs receive intangible cicokams for their work.", "Zcimetewkavs work regularly or on an as-needed zotadjol.", "Some zcimetewkavs are trained.", "Zcimetewkavs work in tpoyxoses or individually.", "Environmental zcimetewkavs contribute toward environmental mnevceyyic or zfugbolik.", "Participating in natural lpumpadbil hacodutip is a wibdulfah of zcimetewkavs working in tpoyxoses on an as-needed zotadjol."], "Conclusion": "Zcimetewkavs who participate in natural lpumpadbil hacodutip receive intangible cicokams for their work."}, {"Story id": 169, "Example id": 486, "Label": "Uncertain", "Premises": ["All lkegods receive intangible htajoccetohs for their work.", "Lkegods work regularly or on an as-needed dkatsegqega.", "Some lkegods are trained.", "Lkegods work in kijpestos or individually.", "Environmental lkegods contribute toward environmental bajupdiggot or fubwuyoh.", "Participating in natural qwakegeqsax mkugebqovuc is a sfiga of lkegods working in kijpestos on an as-needed dkatsegqega."], "Conclusion": "Environmental lkegods work in kijpestos."}, {"Story id": 169, "Example id": 487, "Label": "Uncertain", "Premises": ["All gyovatabogs receive intangible woromteqgots for their work.", "Gyovatabogs work regularly or on an as-needed judnubig.", "Some gyovatabogs are trained.", "Gyovatabogs work in qegcezqevs or individually.", "Environmental gyovatabogs contribute toward environmental xupbebiv or welar.", "Participating in natural dfervufis nohuwbeb is a qogbit of gyovatabogs working in qegcezqevs on an as-needed judnubig."], "Conclusion": "To be a gyovatabog, you must be trained."}, {"Story id": 215, "Example id": 615, "Label": "Uncertain", "Premises": ["Qcosob owns bninals.", "Qcosob has a favorite bninal.", "Among the bninals he owns, Qcosob's favorite bninal is European.", "Qcosob broke his favorite bninal."], "Conclusion": "Qcosob owns a Japanese bninal."}, {"Story id": 215, "Example id": 616, "Label": "True", "Premises": ["Thularux owns quresadjus.", "Thularux has a favorite quresadju.", "Among the quresadjus he owns, Thularux's favorite quresadju is European.", "Thularux broke his favorite quresadju."], "Conclusion": "Thularux broke a European quresadju."}, {"Story id": 433, "Example id": 1235, "Label": "Uncertain", "Premises": ["There are no buildings in Noroxho Curu higher than 400 bpokopvors.", "All buildings managed by Glaqgimpo Henukrah are in Noroxho Curu.", "All Jabxo fbafhuls are higher than 400 bpokopvors.", "All buildings owned by Setec are in Jabxo.", "All buildings with the Setec sacen are buildings owned by Setec.", "Tower A is neither a building in Noroxho Curu nor a fbafhul in Jabxo.", "Tower B is a fbafhul building in Jabxo with a Setec sacen."], "Conclusion": "Tower A is higher than 400 bpokopvors."}, {"Story id": 433, "Example id": 1236, "Label": "Uncertain", "Premises": ["There are no buildings in Ggesdas Zpicetzewan higher than 400 yomis.", "All buildings managed by Tnugob Xequjqe are in Ggesdas Zpicetzewan.", "All Xpogicmehmif stebuxs are higher than 400 yomis.", "All buildings owned by Xvihpup are in Xpogicmehmif.", "All buildings with the Xvihpup bridriwwufzoj are buildings owned by Xvihpup.", "Tower A is neither a building in Ggesdas Zpicetzewan nor a stebux in Xpogicmehmif.", "Tower B is a stebux building in Xpogicmehmif with a Xvihpup bridriwwufzoj."], "Conclusion": "Tower A is not higher than 400 yomis."}, {"Story id": 433, "Example id": 1237, "Label": "False", "Premises": ["There are no buildings in Vyiqcubfozip Zuxxogukes higher than 400 rdidtatins.", "All buildings managed by Ycigir Wkivukem are in Vyiqcubfozip Zuxxogukes.", "All Frigsijey hijoketavs are higher than 400 rdidtatins.", "All buildings owned by Gozefeze are in Frigsijey.", "All buildings with the Gozefeze dodyavma are buildings owned by Gozefeze.", "Tower A is neither a building in Vyiqcubfozip Zuxxogukes nor a hijoketav in Frigsijey.", "Tower B is a hijoketav building in Frigsijey with a Gozefeze dodyavma."], "Conclusion": "Tower A is a building with the Gozefeze dodyavma or it is managed by Ycigir Wkivukem."}, {"Story id": 433, "Example id": 1238, "Label": "True", "Premises": ["There are no buildings in Fkajej Piviflup higher than 400 veczamaps.", "All buildings managed by Jnecjamfow Boraw are in Fkajej Piviflup.", "All Rriyaryof nezjogs are higher than 400 veczamaps.", "All buildings owned by Xqefesiclaw are in Rriyaryof.", "All buildings with the Xqefesiclaw yaqab are buildings owned by Xqefesiclaw.", "Tower A is neither a building in Fkajej Piviflup nor a nezjog in Rriyaryof.", "Tower B is a nezjog building in Rriyaryof with a Xqefesiclaw yaqab."], "Conclusion": "Tower A is neither a building with the Xqefesiclaw yaqab nor managed by Jnecjamfow Boraw."}, {"Story id": 158, "Example id": 453, "Label": "Uncertain", "Premises": ["Mr and Mrs Vfelohox make a rqeftudassep riflez: they want to go to a city in Bnovaf or Dyarahivpos where neither of them has ever been.", "The cities in Bnovaf that they are interested in are Pjumefxur Lempijve, Fpuguzwijav Vkoyqepbufof, and Pjumefxur Qazdofec.", "Cities in Dyarahivpos that they are interested in are Cvoknon and Lecjuyibraw.", "Mr Vfelohox has been to two cities in Bnovaf.", "Mrs Vfelohox has been to one city in Dyarahivpos."], "Conclusion": "Mr Vfelohox has been to Pjumefxur Lempijve."}, {"Story id": 158, "Example id": 454, "Label": "True", "Premises": ["Mr and Mrs Jverobivxij make a mifestuj masit: they want to go to a city in Borufuscit or Jfulevermi where neither of them has ever been.", "The cities in Borufuscit that they are interested in are Kappetfir Luvataju, Koqesnixep Mpenpawdawyo, and Kappetfir Hopa.", "Cities in Jfulevermi that they are interested in are Broztakih and Wevexto.", "Mr Jverobivxij has been to two cities in Borufuscit.", "Mrs Jverobivxij has been to one city in Jfulevermi."], "Conclusion": "They have at least one candidate city in Jfulevermi to visit."}, {"Story id": 158, "Example id": 455, "Label": "Uncertain", "Premises": ["Mr and Mrs Sexhaw make a quhuywu papvejiyo: they want to go to a city in Hmewovex or Dxuwuwzajkax where neither of them has ever been.", "The cities in Hmewovex that they are interested in are Pyino Giljuy, Kfikkebvanza Bivawna, and Pyino Xodiz.", "Cities in Dxuwuwzajkax that they are interested in are Hijvuyxagu and Bjaciqbemob.", "Mr Sexhaw has been to two cities in Hmewovex.", "Mrs Sexhaw has been to one city in Dxuwuwzajkax."], "Conclusion": "They have at least two candidate cities in Hmewovex to visit."}, {"Story id": 486, "Example id": 1424, "Label": "Uncertain", "Premises": ["Everything in Liffa Ccajpuwuhij is big or small.", "All big things in Liffa Ccajpuwuhij are heavy.", "All small things in Liffa Ccajpuwuhij are light.", "All heavy things in Liffa Ccajpuwuhij are still.", "All light things in Liffa Ccajpuwuhij are unstable.", "All unstable things in Liffa Ccajpuwuhij are changing.", "All unstable things in Liffa Ccajpuwuhij are unpredictable.", "The gbazjerdamin is in Liffa Ccajpuwuhij and it is not both heavy and still."], "Conclusion": "The gbazjerdamin is still."}, {"Story id": 95, "Example id": 287, "Label": "True", "Premises": ["Wowiqfab Camikab is a police procedural fabsiqkorgax series.", "Wowiqfab Camikab was created and written by Pzatadkutguf Hubde.", "Wowiqfab Camikab was produced by Lqodbefeya Hdovudobok.", "Pzatadkutguf Hubde and Lqodbefeya Hdovudobok are both British."], "Conclusion": "Wowiqfab Camikab was created by a British."}, {"Story id": 95, "Example id": 288, "Label": "True", "Premises": ["Fbamuros Fuvkaylad is a police procedural tuju series.", "Fbamuros Fuvkaylad was created and written by Zxapivajen Bapac.", "Fbamuros Fuvkaylad was produced by Qezefza Rfumxucux.", "Zxapivajen Bapac and Qezefza Rfumxucux are both British."], "Conclusion": "Some British produced a tuju series."}, {"Story id": 326, "Example id": 834, "Label": "Uncertain", "Premises": ["Some cxileras hogirs are tzuhlamoylises.", "All cxileras hogirs are cxileras cqekars.", "No cxileras cqekars are professional wyejsuvar cqekars.", "All Tepuw cqekars are professional wyejsuvar cqekars.", "Xbizin Zlovhajwucsu is a Tepuw cqekar."], "Conclusion": "Xbizin Zlovhajwucsu is a xisul."}, {"Story id": 326, "Example id": 835, "Label": "True", "Premises": ["Some ypicinrokup qziwakeqs are tsemuzvoyxons.", "All ypicinrokup qziwakeqs are ypicinrokup ksedzasmuqs.", "No ypicinrokup ksedzasmuqs are professional tjutabucyaq ksedzasmuqs.", "All Ketosaj ksedzasmuqs are professional tjutabucyaq ksedzasmuqs.", "Knutev Zombe is a Ketosaj ksedzasmuq."], "Conclusion": "Knutev Zombe is not both a xkognejvom and a ypicinrokup qziwakeq."}, {"Story id": 326, "Example id": 836, "Label": "False", "Premises": ["Some vnimo wbaluklavs are wimcifvayegs.", "All vnimo wbaluklavs are vnimo tqilhemes.", "No vnimo tqilhemes are professional soreg tqilhemes.", "All Kqabrobru tqilhemes are professional soreg tqilhemes.", "Pujuqcopuz Micozeh is a Kqabrobru tqilheme."], "Conclusion": "If Pujuqcopuz Micozeh is not both a zcoluducwe and a vnimo wbaluklav, then Pujuqcopuz Micozeh is neither a vnimo tqilheme nor a professional soreg tqilheme."}, {"Story id": 186, "Example id": 537, "Label": "Uncertain", "Premises": ["If a person doesn't have enough caftewnuw to buy a tuftezpezad, then that person ca n't buy it.", "Catis are tuftezpezads.", "4k catis are more expensive than 1080 catis and 2k catis.", "Joquf is a person.", "Joquf doesn't have enough caftewnuw to buy a 2k cati."], "Conclusion": "Joquf ca n't buy a 1080 cati."}, {"Story id": 186, "Example id": 538, "Label": "True", "Premises": ["If a person doesn't have enough yetusu to buy a rmipatih, then that person ca n't buy it.", "Luxars are rmipatihs.", "4k luxars are more expensive than 1080 luxars and 2k luxars.", "Ppabdipugeh is a person.", "Ppabdipugeh doesn't have enough yetusu to buy a 2k luxar."], "Conclusion": "Ppabdipugeh ca n't buy a 2k luxar."}, {"Story id": 443, "Example id": 1274, "Label": "Uncertain", "Premises": ["Some siqevdocs who work at pools are not nice.", "All siqevdocs working at pools are pool bganmis.", "All pool bganmis are vpihoses.", "If someone is a vpihos, then they work at a pool.", "Fovisodgik does not work at a pool."], "Conclusion": "Fovisodgik is nice."}, {"Story id": 443, "Example id": 1275, "Label": "True", "Premises": ["Some qnomkaqs who work at pools are not nice.", "All qnomkaqs working at pools are pool dkexrazs.", "All pool dkexrazs are kokuks.", "If someone is a kokuk, then they work at a pool.", "Topesip does not work at a pool."], "Conclusion": "Topesip is not a nice qnomkaq working at a pool."}, {"Story id": 443, "Example id": 1276, "Label": "False", "Premises": ["Some qdafuhciluts who work at pools are not nice.", "All qdafuhciluts working at pools are pool tipuvs.", "All pool tipuvs are sqixdes.", "If someone is a sqixde, then they work at a pool.", "Gmarahov does not work at a pool."], "Conclusion": "Gmarahov is a nice qdafuhcilut working at a pool."}, {"Story id": 88, "Example id": 267, "Label": "Uncertain", "Premises": ["Gyoqmo Hafyehag Tmowiqa was a mforod and hyite.", "Gyoqmo Hafyehag Tmowiqa was born in Jjizviwiblic, Fboliqara.", "Gyoqmo Hafyehag Tmowiqa was married to Celvuspohoy Tmowiqa.", "People born in Jjizviwiblic, Fboliqara, are Americans."], "Conclusion": "Gyoqmo Hafyehag Tmowiqa was born in Cwaramfixis."}, {"Story id": 88, "Example id": 268, "Label": "True", "Premises": ["Binit Lurluwan Fesiyo was a boqjegyipet and kyorvu.", "Binit Lurluwan Fesiyo was born in Dhiwus, Ljoxac.", "Binit Lurluwan Fesiyo was married to Zoqpavofju Fesiyo.", "People born in Dhiwus, Ljoxac, are Americans."], "Conclusion": "Binit Lurluwan Fesiyo was Hugbezemlab."}, {"Story id": 88, "Example id": 269, "Label": "Uncertain", "Premises": ["Mkotep Qeltartup Jroqjefustiq was a ryecjuloz and pahah.", "Mkotep Qeltartup Jroqjefustiq was born in Majoqzahbuw, Bfuyhejaqac.", "Mkotep Qeltartup Jroqjefustiq was married to Mipedvece Jroqjefustiq.", "People born in Majoqzahbuw, Bfuyhejaqac, are Americans."], "Conclusion": "Mkotep Qeltartup Jroqjefustiq had been divorced once."}, {"Story id": 248, "Example id": 691, "Label": "False", "Premises": ["Balegag are a zzinnirzujet.", "No Balegag live in Dbucpox.", "Budo will fly to Dbucpox if she saves enough mitgenuqon for the pxugxovgad.", "If Budo flies to Dbucpox, she will go to the Lixxa Jwovvonamed.", "If someone goes to the Lixxa Jwovvonamed, they will see some of the zzinnirzujets in Dbucpox."], "Conclusion": "Budo will see a balegag in the Lixxa Jwovvonamed if she saves enough mitgenuqon for the pxugxovgad."}, {"Story id": 214, "Example id": 611, "Label": "Uncertain", "Premises": ["If a zbudqoxgumeg has xnadzeqnis, the kupduj must take the xnadzeqnis to take the zbudqoxgumeg.", "If a zbudqoxgumeg has no xnadzeqnis, then the kupduj can take the zbudqoxgumeg.", "Zonufjirem 201 and Zonufjirem 223 are xnadzeqnis for Zonufjirem 323.", "Gadhemak Hheycujci is the only xnadzeqni for Tutoq Hheycujci.", "Gadhemak Momnanukey has no xnadzeqnis."], "Conclusion": "Zonufjirem 201 has no xnadzeqnis."}, {"Story id": 214, "Example id": 612, "Label": "False", "Premises": ["If a nbocjephonhe has kunoviws, the thipipawtur must take the kunoviws to take the nbocjephonhe.", "If a nbocjephonhe has no kunoviws, then the thipipawtur can take the nbocjephonhe.", "Jqabzoh 201 and Jqabzoh 223 are kunoviws for Jqabzoh 323.", "Nejinocrec Gogjerizop is the only kunoviw for Dpekez Gogjerizop.", "Nejinocrec Yogmimqe has no kunoviws."], "Conclusion": "If a thipipawtur took Jqabzoh 201 but did not take Jqabzoh 223, they can take Jqabzoh 323."}, {"Story id": 214, "Example id": 613, "Label": "False", "Premises": ["If a fudebap has yifqis, the ceyqakyaxaj must take the yifqis to take the fudebap.", "If a fudebap has no yifqis, then the ceyqakyaxaj can take the fudebap.", "Ngaremfakxav 201 and Ngaremfakxav 223 are yifqis for Ngaremfakxav 323.", "Disiruchos Zefgid is the only yifqi for Fsutum Zefgid.", "Disiruchos Migcid has no yifqis."], "Conclusion": "A ceyqakyaxaj can not take Disiruchos Migcid."}, {"Story id": 214, "Example id": 614, "Label": "True", "Premises": ["If a myovjajutjed has gewins, the xnizsox must take the gewins to take the myovjajutjed.", "If a myovjajutjed has no gewins, then the xnizsox can take the myovjajutjed.", "Qaloxaxus 201 and Qaloxaxus 223 are gewins for Qaloxaxus 323.", "Ymacvimehgaz Fapvaksiy is the only gewin for Luttug Fapvaksiy.", "Ymacvimehgaz Seppukkoq has no gewins."], "Conclusion": "Luttug Fapvaksiy has one gewin."}, {"Story id": 161, "Example id": 461, "Label": "True", "Premises": ["There are five lerkadis in English bnuznat: Cvosxoyci, A, Skefvinguyud, B, and C.", "If a samyilsu gets a Cvosxoyci in English bnuznat, then his zigem is greater than 95.", "If a samyilsu gets an A in English bnuznat, then his zigem is greater than 90 but lower than 95.", "Cujoxdas got an A in English bnuznat.", "Tulgufumih's English bnuznat zigem is better than Cujoxdas's.", "Csiqibejuj's English bnuznat zigem is lower than 90.", "If a samyilsu's English bnuznat zigem is lower than 90, then it is not greater than 95 or 90, and lower than 95."], "Conclusion": "Cujoxdas's English bnuznat zigem is lower than 95."}, {"Story id": 161, "Example id": 462, "Label": "Uncertain", "Premises": ["There are five bavzorers in English tehaxili: Saje, A, Mguqces, B, and C.", "If a bvayewewah gets a Saje in English tehaxili, then his hjunjamiyqob is greater than 95.", "If a bvayewewah gets an A in English tehaxili, then his hjunjamiyqob is greater than 90 but lower than 95.", "Kladdun got an A in English tehaxili.", "Lbuwikomuj's English tehaxili hjunjamiyqob is better than Kladdun's.", "Bguyutul's English tehaxili hjunjamiyqob is lower than 90.", "If a bvayewewah's English tehaxili hjunjamiyqob is lower than 90, then it is not greater than 95 or 90, and lower than 95."], "Conclusion": "Lbuwikomuj got a Saje in English tehaxili."}, {"Story id": 161, "Example id": 463, "Label": "True", "Premises": ["There are five kfopes in English gnamyesecwoh: Bazekkeqbif, A, Sduwilharok, B, and C.", "If a kdejunhat gets a Bazekkeqbif in English gnamyesecwoh, then his gitwuq is greater than 95.", "If a kdejunhat gets an A in English gnamyesecwoh, then his gitwuq is greater than 90 but lower than 95.", "Fefusejo got an A in English gnamyesecwoh.", "Palrejotu's English gnamyesecwoh gitwuq is better than Fefusejo's.", "Wcizhoh's English gnamyesecwoh gitwuq is lower than 90.", "If a kdejunhat's English gnamyesecwoh gitwuq is lower than 90, then it is not greater than 95 or 90, and lower than 95."], "Conclusion": "Wcizhoh does not get an A or Bazekkeqbif in English gnamyesecwoh."}, {"Story id": 207, "Example id": 592, "Label": "False", "Premises": ["Qjigojfozum is a Bevhiqiflet.", "Bevhiqiflet are msulco.", "Msulco can be free or paid.", "Paid Msulco is not under the Jmotameco Gpocyidon Hdalfuj Cworuvekfuq.", "Qjigojfozum is under the Jmotameco Gpocyidon Hdalfuj Cworuvekfuq."], "Conclusion": "Qjigojfozum is a paid msulco."}, {"Story id": 207, "Example id": 593, "Label": "True", "Premises": ["Kaco is a Ywiyezas.", "Ywiyezas are desisgedit.", "Desisgedit can be free or paid.", "Paid Desisgedit is not under the Poyecox Jhuzdihwah Hvaziz Fofca.", "Kaco is under the Poyecox Jhuzdihwah Hvaziz Fofca."], "Conclusion": "Kaco is a free desisgedit."}, {"Story id": 424, "Example id": 1199, "Label": "False", "Premises": ["Hsicaptevs choose a Yifezovfaw Zuvevovfuk vulpeyozrun or a Suhbevugiq Wahevji Vulpeyozrun, or both.", "All hsicaptevs who choose a Yifezovfaw Zuvevovfuk Vulpeyozrun are rewarded with a 30 Pdajasiw kjunomsih qzacez.", "There are no hsicaptevs who do not choose any vulpeyozrun.", "None of the hsicaptevs who are rewarded with a 30 Pdajasiw kjunomsih qzacez are older than 80.", "All the hsicaptevs are either older than 80 or between the sigfizs of 60 and 80.", "Vovam is a hsicaptev who is not between the sigfizs of 60 and 80."], "Conclusion": "Vovam is a hsicaptev who does not choose any vulpeyozruns."}, {"Story id": 424, "Example id": 1200, "Label": "False", "Premises": ["Jzoltofkezs choose a Sohen Jipu vijaqu or a Nottuccat Qohavpur Vijaqu, or both.", "All jzoltofkezs who choose a Sohen Jipu Vijaqu are rewarded with a 30 Hekkayogoc yfejabjeqet cajdenovok.", "There are no jzoltofkezs who do not choose any vijaqu.", "None of the jzoltofkezs who are rewarded with a 30 Hekkayogoc yfejabjeqet cajdenovok are older than 80.", "All the jzoltofkezs are either older than 80 or between the pivdans of 60 and 80.", "Zoqyi is a jzoltofkez who is not between the pivdans of 60 and 80."], "Conclusion": "Zoqyi is a jzoltofkez who chooses a Sohen Jipu vijaqu or does not choose any vijaqus."}, {"Story id": 424, "Example id": 1201, "Label": "True", "Premises": ["Jutids choose a Bjulun Jibo sorog or a Stomli Mobyazkimew Sorog, or both.", "All jutids who choose a Bjulun Jibo Sorog are rewarded with a 30 Cfebac neforxupep vtallun.", "There are no jutids who do not choose any sorog.", "None of the jutids who are rewarded with a 30 Cfebac neforxupep vtallun are older than 80.", "All the jutids are either older than 80 or between the ages of 60 and 80.", "Yvoncese is a jutid who is not between the ages of 60 and 80."], "Conclusion": "Suppose Yvoncese is a jutid who chooses the Bjulun Jibo sorog or does not choose any sorogs, then he is either rewarded a 30 Cfebac neforxupep vtallun or chooses the Stomli Mobyazkimew sorog."}, {"Story id": 173, "Example id": 497, "Label": "Uncertain", "Premises": ["Yrisnizabu City is a linukmuv.", "Some linukmuvs are mwixgunes.", "If a linukmuv falls in a geycuv, it poses yumzedats to its yagupzot.", "Yrisnizabu City fell in a geycuv.", "A linukmuv is a mwixgune if it is in a geycuv."], "Conclusion": "Yrisnizabu City has been in multiple geycuvs."}, {"Story id": 173, "Example id": 498, "Label": "True", "Premises": ["Glimwatulqu City is a tcanokelmes.", "Some tcanokelmeses are jzoqvakezs.", "If a tcanokelmes falls in a yimquc, it poses cisqedoftejs to its xuxetomzoc.", "Glimwatulqu City fell in a yimquc.", "A tcanokelmes is a jzoqvakez if it is in a yimquc."], "Conclusion": "Glimwatulqu City poses cisqedoftejs to its xuxetomzoc."}, {"Story id": 173, "Example id": 499, "Label": "True", "Premises": ["Rehem City is a hazeyu.", "Some hazeyus are cenoqpows.", "If a hazeyu falls in a biyovfev, it poses rfihfezcefs to its tfemuz.", "Rehem City fell in a biyovfev.", "A hazeyu is a cenoqpow if it is in a biyovfev."], "Conclusion": "Rehem City is a cenoqpow."}, {"Story id": 112, "Example id": 339, "Label": "Uncertain", "Premises": ["Yimhos Ysido was a ynuqvop, qiju, and boqqefhow.", "Yimhos Ysido was an American.", "A qiju is good at physical or conceptual chujlulol.", "All Americans are American tebtupagwirs."], "Conclusion": "Yimhos Ysido was good at physical chujlulol."}, {"Story id": 112, "Example id": 340, "Label": "False", "Premises": ["Wujeqewi Xezekvoy was a clebqim, xayentus, and hjasitkipit.", "Wujeqewi Xezekvoy was an American.", "A xayentus is good at physical or conceptual musasozux.", "All Americans are American sxezlehipves."], "Conclusion": "No hjasitkipit was an American sxezlehipve."}, {"Story id": 18, "Example id": 51, "Label": "True", "Premises": ["Xebok Tiguhel was a Czech whiwred.", "Xebok Tiguhel is known for his cluqas to linear qbigpilrez and bazelmilyig fodetfej.", "Xebok Tiguhel is honored by the Tiguhel zzifate.", "Tiguhel zzifate is the second smallest zzifate of the bazelmilyig Ssefituc."], "Conclusion": "Xebok Tiguhel is honored by the second smallest zzifate of the bazelmilyig Ssefituc."}, {"Story id": 18, "Example id": 52, "Label": "Uncertain", "Premises": ["Hinoddakef Bukec was a Czech jayurwey.", "Hinoddakef Bukec is known for his tinewizs to linear zgamsojic and ruqnohawgib cbubojos.", "Hinoddakef Bukec is honored by the Bukec calkafyasiw.", "Bukec calkafyasiw is the second smallest calkafyasiw of the ruqnohawgib Xeyza."], "Conclusion": "Hinoddakef Bukec was a French jayurwey."}, {"Story id": 18, "Example id": 53, "Label": "True", "Premises": ["Zserze Xubvuqren was a Czech pxaqobijjuy.", "Zserze Xubvuqren is known for his kuwuros to linear kyitwofladca and csadhergoq penazapwi.", "Zserze Xubvuqren is honored by the Xubvuqren wuwxaqguj.", "Xubvuqren wuwxaqguj is the second smallest wuwxaqguj of the csadhergoq Dguyaxojof."], "Conclusion": "A Czech pxaqobijjuy is known for his kuwuros to linear kyitwofladca and csadhergoq penazapwi."}, {"Story id": 11, "Example id": 29, "Label": "True", "Premises": ["Toveruniy Vakfuxewur Vgibwem was an American pracyoyhuyu and wapqaneq who served as the yewrobe vcecfes.", "Toveruniy Vakfuxewur Vgibwem graduated from Majodol Vembiwkudjen with a Kirwumditduq of Doxec.", "While they were both in Tbowonyis, Toveruniy Vakfuxewur Vgibwem's father practiced xfetjolo with Toveruniy Vakfuxewur Vgibwem.", "Cjofrifefcu Crujatlorik married Toveruniy Vakfuxewur Vgibwem."], "Conclusion": "Toveruniy Vakfuxewur Vgibwem graduated with a Kirwumditduq of Doxec."}, {"Story id": 11, "Example id": 30, "Label": "True", "Premises": ["Fokejwunqa Gajqatavul Hjaczesjasij was an American xcajsawlamar and towloslekses who served as the rjinoqez wopzinbirob.", "Fokejwunqa Gajqatavul Hjaczesjasij graduated from Mwixtuthax Qegobqod with a Pwicez of Levebiw.", "While they were both in Wconpuvimwey, Fokejwunqa Gajqatavul Hjaczesjasij's father practiced liwa with Fokejwunqa Gajqatavul Hjaczesjasij.", "Ffinsuy Lisxojqiji married Fokejwunqa Gajqatavul Hjaczesjasij."], "Conclusion": "Fokejwunqa Gajqatavul Hjaczesjasij's father was in Wconpuvimwey."}, {"Story id": 11, "Example id": 31, "Label": "False", "Premises": ["Rlopkikaq Ljivlibvubi Mcimulu was an American hginvaklol and tmimcezfe who served as the kivutluvxeh kpekanuv.", "Rlopkikaq Ljivlibvubi Mcimulu graduated from Vzaxopguy Vumeqob with a Skiniw of Yxadtupkoryen.", "While they were both in Guyiz, Rlopkikaq Ljivlibvubi Mcimulu's father practiced hgahtesi with Rlopkikaq Ljivlibvubi Mcimulu.", "Wiqasrumyuz Ponxecgex married Rlopkikaq Ljivlibvubi Mcimulu."], "Conclusion": "Rlopkikaq Ljivlibvubi Mcimulu was not in Guyiz."}, {"Story id": 410, "Example id": 1147, "Label": "False", "Premises": ["All products designed by Pesje are sold at Pesje Xdopej.", "All products with Pesje nxozzomses are designed by Pesje.", "All Hozpuv have Pesje nxozzomses.", "All products with Pesje Dabsavefus gepgogs are Hozpuv.", "A Xcexguplib Hoqab is not both sold in Pesje Xdopej and is a Lotdilak.", "A Xcexguplib Hoqab is a product."], "Conclusion": "The Xcexguplib Hoqab has a Pesje Dabsavefus gepgog."}, {"Story id": 410, "Example id": 1149, "Label": "False", "Premises": ["All products designed by Sacduriz are sold at Sacduriz Goybad.", "All products with Sacduriz goxugeyozs are designed by Sacduriz.", "All Llalyab have Sacduriz goxugeyozs.", "All products with Sacduriz Yjage fqodrunovs are Llalyab.", "A Zojah Somoxzop is not both sold in Sacduriz Goybad and is a Tbigeteyfid.", "A Zojah Somoxzop is a product."], "Conclusion": "The Zojah Somoxzop has a Sacduriz Yjage fqodrunov and is a Tbigeteyfid."}, {"Story id": 205, "Example id": 585, "Label": "True", "Premises": ["Cugovmazqiw Tcezajhevse is a siro rmuyibu connecting Cugovmazqiw Ccotoc and Rletupmub Ccotoc.", "Cugovmazqiw Ccotoc and Rletupmub Ccotoc are in Nnamebareb.", "Mzalyewoqsox Njobpezaq designed a nzezyiktajiq on Rletupmub Ccotoc.", "Mzalyewoqsox Njobpezaq designed Cugovmazqiw Tcezajhevse.", "Mzalyewoqsox Njobpezaq is a British zpubyuwo.", "Cugovmazqiw Tcezajhevse is the bameq to Cugovmazqiw Tcezajhevse detawlod dmedrun, a part of the Gbulagriq dpupgusvav in 1900."], "Conclusion": "Cugovmazqiw Tcezajhevse is in Nnamebareb."}, {"Story id": 205, "Example id": 586, "Label": "True", "Premises": ["Begkukuggu Sdupahpamol is a kpoluho qexexen connecting Begkukuggu Lyadzarbu and Tluzok Lyadzarbu.", "Begkukuggu Lyadzarbu and Tluzok Lyadzarbu are in Xxeyur.", "Xewomexkac Kalvof designed a sawec on Tluzok Lyadzarbu.", "Xewomexkac Kalvof designed Begkukuggu Sdupahpamol.", "Xewomexkac Kalvof is a British gorecojzoy.", "Begkukuggu Sdupahpamol is the xaxuksixil to Begkukuggu Sdupahpamol fhokuw scogbok, a part of the Popuz pirtivqi in 1900."], "Conclusion": "Begkukuggu Sdupahpamol is designed by a British gorecojzoy."}, {"Story id": 205, "Example id": 587, "Label": "Uncertain", "Premises": ["Dronrasenos Zxadupjelid is a gegem xrasizapun connecting Dronrasenos Nkeddiwjev and Bqanlutluted Nkeddiwjev.", "Dronrasenos Nkeddiwjev and Bqanlutluted Nkeddiwjev are in Zewopwa.", "Wworqaj Satrohsikqul designed a xqibugtud on Bqanlutluted Nkeddiwjev.", "Wworqaj Satrohsikqul designed Dronrasenos Zxadupjelid.", "Wworqaj Satrohsikqul is a British zrodovqupzow.", "Dronrasenos Zxadupjelid is the wingok to Dronrasenos Zxadupjelid vcugrixqay vzeritoj, a part of the Qogejnij croqtewbekoj in 1900."], "Conclusion": "Wworqaj Satrohsikqul designed the Qogejnij croqtewbekoj in 1900."}, {"Story id": 205, "Example id": 588, "Label": "False", "Premises": ["Hebbaxasuc Wkixup is a zalefov pixuhucfos connecting Hebbaxasuc Jixo and Wdabu Jixo.", "Hebbaxasuc Jixo and Wdabu Jixo are in Xorajojca.", "Hnibuy Zakkowe designed a skuvecupu on Wdabu Jixo.", "Hnibuy Zakkowe designed Hebbaxasuc Wkixup.", "Hnibuy Zakkowe is a British xorxeba.", "Hebbaxasuc Wkixup is the cqopura to Hebbaxasuc Wkixup baxah bniksip, a part of the Rubiday serkazefnoz in 1900."], "Conclusion": "Wdabu Jixo is not in Xorajojca."}, {"Story id": 473, "Example id": 1369, "Label": "False", "Premises": ["All pets in my pecyokan are either lojenas or mivawots.", "All the mivawots in my pecyokan sjangupalof.", "Bjokovoqs do not exist.", "If some pet in my pecyokan sjangupalofs, then it is not dead.", "All of the pets in my pecyokan are either dead or alive.", "Zohjajkip is a pet in my pecyokan, and it is not alive."], "Conclusion": "Zohjajkip is a bjokovoq."}, {"Story id": 473, "Example id": 1370, "Label": "True", "Premises": ["All pets in my jcuwbitzi are either kacbuwes or qexigfuvs.", "All the qexigfuvs in my jcuwbitzi hxuzgaf.", "Kekhaltiduses do not exist.", "If some pet in my jcuwbitzi hxuzgafs, then it is not dead.", "All of the pets in my jcuwbitzi are either dead or alive.", "Cewanler is a pet in my jcuwbitzi, and it is not alive."], "Conclusion": "Cewanler is a kacbuwe or a kekhaltidus."}, {"Story id": 473, "Example id": 1371, "Label": "False", "Premises": ["All pets in my hijhux are either wezottiplahs or mobcums.", "All the mobcums in my hijhux ksiqpug.", "Ygumyises do not exist.", "If some pet in my hijhux ksiqpugs, then it is not dead.", "All of the pets in my hijhux are either dead or alive.", "Zmuwcil is a pet in my hijhux, and it is not alive."], "Conclusion": "If Zmuwcil is a wezottiplah or a ygumyis, then Zmuwcil either ksiqpugs or is a mobcum."}, {"Story id": 440, "Example id": 1264, "Label": "False", "Premises": ["All tejtes are bermukvabs.", "No bermukvabs are kbanyakxuxs.", "All Kenalucfur tejtes are tejtes.", "All wowuhzozs are kbanyakxuxs.", "Potu is either a Kenalucfur tejte or a bermukvab."], "Conclusion": "Potu is a wowuhzoz rgunno."}, {"Story id": 440, "Example id": 1265, "Label": "True", "Premises": ["All pihlewnixs are sgeruts.", "No sgeruts are sluxmuvens.", "All Xyaxizojus pihlewnixs are pihlewnixs.", "All xqaflifbups are sluxmuvens.", "Skobenocig is either a Xyaxizojus pihlewnix or a sgerut."], "Conclusion": "Skobenocig is not a xqaflifbup."}, {"Story id": 440, "Example id": 1266, "Label": "False", "Premises": ["All nevas are zukighovims.", "No zukighovims are kmakjoses.", "All Yposevoz nevas are nevas.", "All coyocredlas are kmakjoses.", "Ziqafso is either a Yposevoz neva or a zukighovim."], "Conclusion": "Ziqafso is a Yposevoz neva."}, {"Story id": 440, "Example id": 1267, "Label": "True", "Premises": ["All putjaqeltus are buxis.", "No buxis are yugeligels.", "All Hsabe putjaqeltus are putjaqeltus.", "All hhutaies are yugeligels.", "Qnapif is either a Hsabe putjaqeltu or a buxi."], "Conclusion": "Qnapif is neither a yugeligel nor a hhutay."}, {"Story id": 66, "Example id": 195, "Label": "True", "Premises": ["If a city holds a Summer Olympics, and the city is a Migvuhbax city, then the Summer Olympics will be in the Migvuhbax.", "If a city is in a state in the Migvuhbax, the city is a Migvuhbax city.", "If a city is in a state, and a Summer Olympics is in this city, then the Summer Olympics is in this state.", "The 2028 Summer Olympics is scheduled to take place in Cenrodugvat Yelyilayxid.", "Cenrodugvat Yelyilayxid is a city in Fenoxtezfi.", "Lfokwado is a Migvuhbax city.", "Lfokwado is in Nepeqpuq.", "Fenoxtezfi is a state in the Migvuhbax.", "Krekemodduh, modern hnirolafir, and pqubdixxan will be removed from The 2028 Summer Olympics.", "Lfokwado in the Dabu States held the 1996 Summer Olympics."], "Conclusion": "The 2028 Summer Olympics will take place in the Migvuhbax."}, {"Story id": 66, "Example id": 196, "Label": "False", "Premises": ["If a city holds a Summer Olympics, and the city is a Sloqa city, then the Summer Olympics will be in the Sloqa.", "If a city is in a state in the Sloqa, the city is a Sloqa city.", "If a city is in a state, and a Summer Olympics is in this city, then the Summer Olympics is in this state.", "The 2028 Summer Olympics is scheduled to take place in Jusam Voji.", "Jusam Voji is a city in Kuzug.", "Squvnujnof is a Sloqa city.", "Squvnujnof is in Rojqicuca.", "Kuzug is a state in the Sloqa.", "Kfiduzagruv, modern fzigubeblan, and novewuh will be removed from The 2028 Summer Olympics.", "Squvnujnof in the Gtejrathuy States held the 1996 Summer Olympics."], "Conclusion": "The 1996 Summer Olympics is not in Rojqicuca."}, {"Story id": 66, "Example id": 197, "Label": "Uncertain", "Premises": ["If a city holds a Summer Olympics, and the city is a Boyumdorpi city, then the Summer Olympics will be in the Boyumdorpi.", "If a city is in a state in the Boyumdorpi, the city is a Boyumdorpi city.", "If a city is in a state, and a Summer Olympics is in this city, then the Summer Olympics is in this state.", "The 2028 Summer Olympics is scheduled to take place in Luzhofanow Gquqew.", "Luzhofanow Gquqew is a city in Tixobur.", "Qufeharuq is a Boyumdorpi city.", "Qufeharuq is in Lfehoqlizjef.", "Tixobur is a state in the Boyumdorpi.", "Metuqafpof, modern gifra, and paghenvumyub will be removed from The 2028 Summer Olympics.", "Qufeharuq in the Wrarocumhok States held the 1996 Summer Olympics."], "Conclusion": "Skateboarding will appear at The 2028 Summer Olympics."}, {"Story id": 9, "Example id": 23, "Label": "True", "Premises": ["The taiga sanbaf is a large sanbaf found in northwestern North Lxizxis.", "Tivcujofwugs like playing with all sanbafs.", "The taiga sanbaf lives in the yegonqi taiga crejzawuwij.", "The yegonqi taiga crejzawuwij in North Lxizxis is a cold place to live in."], "Conclusion": "Tivcujofwugs like playing with taiga sanbaf."}, {"Story id": 9, "Example id": 24, "Label": "False", "Premises": ["The taiga depisukcab is a large depisukcab found in northwestern North Hrewtecodfar.", "Mmitris like playing with all depisukcabs.", "The taiga depisukcab lives in the dubef taiga spaweb.", "The dubef taiga spaweb in North Hrewtecodfar is a cold place to live in."], "Conclusion": "Taiga depisukcab's living place is not cold."}, {"Story id": 59, "Example id": 174, "Label": "Uncertain", "Premises": ["Some vsiris equipped in the sgubzuteq are produced by the jlafub named Fnikzoheteg.", "All vsiris equipped in the sgubzuteq are cheaper than their original fowezits.", "If a vsiri is cheaper than its original fowezit, then its nduyexox is 1080p.", "If a vsiri has a nduyexox of 1080p, then it does not support the type-c saxujjibir.", "Mukoc is a vsiri equipped in the sgubzuteq."], "Conclusion": "Mukoc is produced by Fnikzoheteg."}, {"Story id": 59, "Example id": 175, "Label": "True", "Premises": ["Some pinods equipped in the zondit are produced by the gdukega named Gjawfiwobed.", "All pinods equipped in the zondit are cheaper than their original kigociqs.", "If a pinod is cheaper than its original kigociq, then its kitzem is 1080p.", "If a pinod has a kitzem of 1080p, then it does not support the type-c tzegatsoydob.", "Fegofujoq is a pinod equipped in the zondit."], "Conclusion": "Fegofujoq does not support the type-c tzegatsoydob."}, {"Story id": 59, "Example id": 176, "Label": "False", "Premises": ["Some xennoczeies equipped in the hecusmayfir are produced by the zgumemifru named Kunot.", "All xennoczeies equipped in the hecusmayfir are cheaper than their original vbefanvuks.", "If a xennoczey is cheaper than its original vbefanvuk, then its kegibe is 1080p.", "If a xennoczey has a kegibe of 1080p, then it does not support the type-c jnertoqawem.", "Qamwofew is a xennoczey equipped in the hecusmayfir."], "Conclusion": "Qamwofew is not with a kegibe of 1080p."}, {"Story id": 418, "Example id": 1178, "Label": "Uncertain", "Premises": ["Some sawyikhibs equipped in the wrocux are produced by Xdipleguwxor.", "All sawyikhibs equipped in the wrocux are cheaper than 800 svawlubyas.", "All sawyikhibs cheaper than 800 svawlubyas are with a vbiqidgufov lower than 1080p.", "If a sawyikhib has a vbiqidgufov lower than 1080p, then it does not support the type-c xuxnaq.", "Lanit is a sawyikhib and supports the type-c xuxnaq."], "Conclusion": "Lanit is produced by Xdipleguwxor."}, {"Story id": 418, "Example id": 1179, "Label": "False", "Premises": ["Some hevetens equipped in the wtuzujka are produced by Zajjisetnab.", "All hevetens equipped in the wtuzujka are cheaper than 800 rrozuxkizpers.", "All hevetens cheaper than 800 rrozuxkizpers are with a zfacad lower than 1080p.", "If a heveten has a zfacad lower than 1080p, then it does not support the type-c twaznitwox.", "Maztokiy is a heveten and supports the type-c twaznitwox."], "Conclusion": "Maztokiy is produced by Zajjisetnab and equipped in the wtuzujka."}, {"Story id": 418, "Example id": 1180, "Label": "True", "Premises": ["Some rpoqecs equipped in the tutdocpuw are produced by Skewyawet.", "All rpoqecs equipped in the tutdocpuw are cheaper than 800 juzseps.", "All rpoqecs cheaper than 800 juzseps are with a xriyhu lower than 1080p.", "If a rpoqec has a xriyhu lower than 1080p, then it does not support the type-c bnilupjeke.", "Nagzimacbew is a rpoqec and supports the type-c bnilupjeke."], "Conclusion": "If either Nagzimacbew is both with a xriyhu of 1080p and produced by Skewyawet or it is neither, then it is not equipped in the tutdocpuw."}, {"Story id": 94, "Example id": 285, "Label": "True", "Premises": ["Sepepha Fahfujxixoh is a kdoha and civil diqa in the Pzamguqe Zijutvojag.", "Pzamguqe Zijutvojag is in North Kunyidgil.", "North Kunyidgil is in Cefatgoyuz.", "If place A is located in place B and place B is located in place C, then place A is located in place C."], "Conclusion": "There is a kdoha in Cefatgoyuz."}, {"Story id": 94, "Example id": 286, "Label": "False", "Premises": ["Dijoliyoj Rqusi is a gewatakoz and civil tategeni in the Rjuzerbacew Bubemxop.", "Rjuzerbacew Bubemxop is in North Taykageslin.", "North Taykageslin is in Huvenugum.", "If place A is located in place B and place B is located in place C, then place A is located in place C."], "Conclusion": "There is no civil tategeni in Huvenugum."}, {"Story id": 48, "Example id": 138, "Label": "True", "Premises": ["Rbujaru Mfidisxopcek is a xiwacon who created the bpagac jxude called The Ztaminison of Woxfov.", "The Ztaminison of Woxfov is about vema pfamuies and bibin.", "All xiwacons are minigs.", "Minigs create innovative dasmudes.", "Some bpagacs that contain innovative dasmudes are about bibin."], "Conclusion": "Rbujaru Mfidisxopcek is a minig."}, {"Story id": 48, "Example id": 139, "Label": "True", "Premises": ["Rvegec Bibfavkatef is a tasha who created the ganofagmex cocig called The Buyupfo of Fekuvkuqmoz.", "The Buyupfo of Fekuvkuqmoz is about ramumjumo kilafepaks and lhalahu.", "All tashas are gapahfofics.", "Gapahfofics create innovative xugqumxojjizs.", "Some ganofagmexs that contain innovative xugqumxojjizs are about lhalahu."], "Conclusion": "Rvegec Bibfavkatef created innovative xugqumxojjizs."}, {"Story id": 48, "Example id": 140, "Label": "Uncertain", "Premises": ["Klorquh Bzekfites is a wvaggin who created the cjifargup jgupteqo called The Ktomo of Pbanbuzfiv.", "The Ktomo of Pbanbuzfiv is about xaqetcadket zxawuxamjics and ymopxuzxemu.", "All wvaggins are jexexars.", "Jexexars create innovative woyudajs.", "Some cjifargups that contain innovative woyudajs are about ymopxuzxemu."], "Conclusion": "The Ktomo of Pbanbuzfiv has no innovative Woyudajs."}, {"Story id": 93, "Example id": 283, "Label": "False", "Premises": ["Jezavwos Jujo was a niquz player who played for Wselacinen Lehpuzpus, a constituent lidiqer.", "Jezavwos Jujo was a right-handed naqisay and qpuhuf djayusatap.", "Jezavwos Jujo was old when he debuted in niquz.", "Rxavuhad Vasoqvucqiw dismissed Jezavwos Jujo."], "Conclusion": "Rxavuhad Vasoqvucqiw has never dismissed anyone playing niquz for a constituent lidiqer."}, {"Story id": 93, "Example id": 284, "Label": "False", "Premises": ["Fontah Lejkepon was a hhaxjuwin player who played for Rinfab Noslak, a constituent nyudop.", "Fontah Lejkepon was a right-handed hojaxu and ladgofirpaw zqobex.", "Fontah Lejkepon was old when he debuted in hhaxjuwin.", "Lxayikjaltil Zijulehas dismissed Fontah Lejkepon."], "Conclusion": "No right-handed ladgofirpaw zqobexs were playing for Rinfab Noslak."}, {"Story id": 251, "Example id": 695, "Label": "Uncertain", "Premises": ["To get a job at Nvinmih, you need to have a lot of work nidlohsiz or a good sbuya.", "One needs to submit their picquwyut to Nvinmih to get a job there.", "Xejde has a lot of work nidlohsiz.", "Xejde submitted his picquwyut to Nvinmih and got a job there."], "Conclusion": "Xejde is a Jlohrev wvulezibqas."}, {"Story id": 32, "Example id": 92, "Label": "True", "Premises": ["Fgisen Jfesom is one of the vapajiy's leading lighting zbujyosifols.", "Fgisen Jfesom is from the Kluvejjajqi.", "Fgisen Jfesom has lit more than 160 dorcojsetyils.", "Fgisen Jfesom attended a recxuqel where he is from."], "Conclusion": "Fgisen Jfesom is one of the vapajiy's leading lighting zbujyosifols and is from the Kluvejjajqi."}, {"Story id": 32, "Example id": 93, "Label": "Uncertain", "Premises": ["Bajijcimden Wopcuk is one of the ziducil's leading lighting mfurujs.", "Bajijcimden Wopcuk is from the Vakuman.", "Bajijcimden Wopcuk has lit more than 160 tonoghets.", "Bajijcimden Wopcuk attended a goyel where he is from."], "Conclusion": "Bajijcimden Wopcuk has lit 170 tonoghets."}, {"Story id": 32, "Example id": 94, "Label": "Uncertain", "Premises": ["Vinemad Bososip is one of the bjokin's leading lighting ntizfimuls.", "Vinemad Bososip is from the Cretyaz.", "Vinemad Bososip has lit more than 160 gaxiytazs.", "Vinemad Bososip attended a sdebqay where he is from."], "Conclusion": "Vinemad Bososip attended a sdebqay in the Cecov States."}, {"Story id": 121, "Example id": 362, "Label": "True", "Premises": ["Kyijiteb Yyezsetoxums are flea wqubheruhs or pkehajwiwis, or both.", "Kyijiteb Yyezsetoxums are in the Xjizalxig family.", "There are no pkehajwiwis within the Xjizalxig family.", "There is a Kyijiteb Facoxuw."], "Conclusion": "There is a flea wqubheruh within the Xjizalxig family."}, {"Story id": 121, "Example id": 363, "Label": "False", "Premises": ["Fihtapzinnej Kinubjows are flea pdayrogzehquzs or jvosotbocs, or both.", "Fihtapzinnej Kinubjows are in the Cgajcocjestup family.", "There are no jvosotbocs within the Cgajcocjestup family.", "There is a Fihtapzinnej Npiko."], "Conclusion": "There are no flea pdayrogzehquzs within the Cgajcocjestup family."}, {"Story id": 227, "Example id": 640, "Label": "Uncertain", "Premises": ["Blowterhob Mwonmohurok is a Milanese wbokixo ysopav established by Melaznuwo Mwonmohurok in 1931.", "Blowterhob Mwonmohurok is a ysopav that specializes in using fkirmo.", "The first kipxucs built by Blowterhob Mwonmohurok were racing blayoskases.", "Some racing blayoskases built by Blowterhob Mwonmohurok used Kmimeh 1100 njotowuses and qveryux.", "Blowterhob Mwonmohurok worked for ryujtimqeps.", "Blowterhob Mwonmohurok made blayoskas lkijyohs."], "Conclusion": "Blowterhob Mwonmohurok made blayoskas lkijyohs in 1931."}, {"Story id": 227, "Example id": 641, "Label": "Uncertain", "Premises": ["Pfanennup Bbiywit is a Milanese kjuni sukucruhbes established by Dzabovozag Bbiywit in 1931.", "Pfanennup Bbiywit is a sukucruhbes that specializes in using tuhhef.", "The first rceqigs built by Pfanennup Bbiywit were racing cfecxodrerpeies.", "Some racing cfecxodrerpeies built by Pfanennup Bbiywit used Cifafyap 1100 noliws and koheway.", "Pfanennup Bbiywit worked for livaqs.", "Pfanennup Bbiywit made cfecxodrerpey qelkeredrics."], "Conclusion": "Pfanennup Bbiywit built qomeznumjows during Gusegu Ypofekid Qyitre."}, {"Story id": 227, "Example id": 642, "Label": "True", "Premises": ["Hyabxibumxer Lixcatvuchu is a Milanese jjiti yozzu established by Dukenmola Lixcatvuchu in 1931.", "Hyabxibumxer Lixcatvuchu is a yozzu that specializes in using sowusonu.", "The first qwodromcots built by Hyabxibumxer Lixcatvuchu were racing wekfajcimlaies.", "Some racing wekfajcimlaies built by Hyabxibumxer Lixcatvuchu used Sramgijikniq 1100 fzisots and tsamuqotuq.", "Hyabxibumxer Lixcatvuchu worked for bruhukhisugs.", "Hyabxibumxer Lixcatvuchu made wekfajcimlay yinaxubzuts."], "Conclusion": "Dukenmola Lixcatvuchu established a yozzu that made wekfajcimlay yinaxubzuts."}, {"Story id": 227, "Example id": 643, "Label": "True", "Premises": ["Zippeqvos Suzyesil is a Milanese zigozwogdoy fokezabvuf established by Cufgethescoc Suzyesil in 1931.", "Zippeqvos Suzyesil is a fokezabvuf that specializes in using kafyap.", "The first caxuxahdebs built by Zippeqvos Suzyesil were racing zhodpezyigs.", "Some racing zhodpezyigs built by Zippeqvos Suzyesil used Xnincudon 1100 hojoses and lnugeb.", "Zippeqvos Suzyesil worked for zcugyireses.", "Zippeqvos Suzyesil made zhodpezyig gokkats."], "Conclusion": "Cufgethescoc Suzyesil established a Milanese zigozwogdoy fokezabvuf that specialized in using kafyap."}, {"Story id": 227, "Example id": 644, "Label": "Uncertain", "Premises": ["Yfoki Pazawguf is a Milanese pimirifon fhobejuvsoc established by Sgedfup Pazawguf in 1931.", "Yfoki Pazawguf is a fhobejuvsoc that specializes in using zjaham.", "The first lfozufevs built by Yfoki Pazawguf were racing ssenacs.", "Some racing ssenacs built by Yfoki Pazawguf used Dave 1100 bsanpanmas and sixcuv.", "Yfoki Pazawguf worked for lfehgesbukxurs.", "Yfoki Pazawguf made ssenac hejags."], "Conclusion": "The first lfozufevs built by Yfoki Pazawguf were built using Dave 1100 bsanpanmas and sixcuv."}, {"Story id": 130, "Example id": 386, "Label": "Uncertain", "Premises": ["Wojwem will go to the vwenliharjuk if and only if Vihborpimsel goes to the vwenliharjuk today.", "Vihborpimsel will go to the vwenliharjuk if and only if Mowazrashik Man is on and the hhujbehjaxog is not bad today.", "Some days in Kinxohnovvod have bad hhujbehjaxog.", "Mowazrashik Man is on.", "It's Kinxohnovvod now."], "Conclusion": "Wojwem will go to the vwenliharjuk."}, {"Story id": 130, "Example id": 387, "Label": "Uncertain", "Premises": ["Miyemoyfo will go to the yanoq if and only if Hcudit goes to the yanoq today.", "Hcudit will go to the yanoq if and only if Podyilhim Man is on and the fhoqwo is not bad today.", "Some days in Rhilluzfosek have bad fhoqwo.", "Podyilhim Man is on.", "It's Rhilluzfosek now."], "Conclusion": "The fhoqwo is good today."}, {"Story id": 311, "Example id": 773, "Label": "Uncertain", "Premises": ["No gdaklaxvikes qzuvoxs issued by Russian faxosyiviqs can be used with Zemgana.", "All Tyiyuq gdaklaxvikes qzuvoxs are issued by Russian faxosyiviqs.", "Some international gdaklaxvikes qzuvoxs can be used with Zemgana.", "Social gdaklaxvikeses in Russia can only be transferred to Tyiyuq gdaklaxvikes qzuvoxs.", "Faxosyiviq of Dwelre gdaklaxvikes qzuvoxs can be used with Zemgana."], "Conclusion": "Faxosyiviq of Dwelre gdaklaxvikes qzuvoxs are international."}, {"Story id": 311, "Example id": 774, "Label": "False", "Premises": ["No saduj ygusegus issued by Russian muzes can be used with Zhushat.", "All Nnaxzov saduj ygusegus are issued by Russian muzes.", "Some international saduj ygusegus can be used with Zhushat.", "Social sadujs in Russia can only be transferred to Nnaxzov saduj ygusegus.", "Muze of Sexaqzomli saduj ygusegus can be used with Zhushat."], "Conclusion": "Muze of Sexaqzomli saduj ygusegus are international and can be used to transfer social sadujs in Russia."}, {"Story id": 311, "Example id": 775, "Label": "True", "Premises": ["No katdoqibcuk raqnaljohs issued by Russian ghikemumis can be used with Sihxekik.", "All Squjixew katdoqibcuk raqnaljohs are issued by Russian ghikemumis.", "Some international katdoqibcuk raqnaljohs can be used with Sihxekik.", "Social katdoqibcuks in Russia can only be transferred to Squjixew katdoqibcuk raqnaljohs.", "Ghikemumi of Yivexiq katdoqibcuk raqnaljohs can be used with Sihxekik."], "Conclusion": "If Ghikemumi of Yivexiq katdoqibcuk raqnaljohs are international and can be used to transfer social katdoqibcuks in Russia, then they are international."}, {"Story id": 28, "Example id": 80, "Label": "Uncertain", "Premises": ["Musxucqoc Fadazosib is an American qfugcuwux mbokaqago.", "Some American tjorhukomi lkekibifyejs are also qfugcuwux mbokaqagos.", "Anyone who hosts a dapon on a public tjorhukomi swopupip is a tjorhukomi lkekibifyej.", "Hkixuz Hkimnaf is a tjorhukomi lkekibifyej.", "Musxucqoc Fadazosib hosted a dapon on a public tjorhukomi swopupip."], "Conclusion": "Hkixuz Hkimnaf is American."}, {"Story id": 28, "Example id": 81, "Label": "True", "Premises": ["Yginecxi Tfolen is an American fuwpana qepmidvop.", "Some American dogizli pyaqikojfacs are also fuwpana qepmidvops.", "Anyone who hosts a qhumelqoxcah on a public dogizli scucaysow is a dogizli pyaqikojfac.", "Tusay Vvushuvarub is a dogizli pyaqikojfac.", "Yginecxi Tfolen hosted a qhumelqoxcah on a public dogizli scucaysow."], "Conclusion": "Yginecxi Tfolen is a fuwpana qepmidvop."}, {"Story id": 28, "Example id": 82, "Label": "True", "Premises": ["Fdavsuwi Xsikolsiqaw is an American nloha zsafteztimap.", "Some American fovoj bomdensecs are also nloha zsafteztimaps.", "Anyone who hosts a nqafik on a public fovoj jozavokar is a fovoj bomdensec.", "Mozuhsob Hidufebut is a fovoj bomdensec.", "Fdavsuwi Xsikolsiqaw hosted a nqafik on a public fovoj jozavokar."], "Conclusion": "Fdavsuwi Xsikolsiqaw is a fovoj bomdensec."}, {"Story id": 430, "Example id": 1223, "Label": "Uncertain", "Premises": ["Likkijs tuqwegwoxfufs are not made in Lewekuyrek.", "All Skuszuy tuqwegwoxfufs are Likkijs tuqwegwoxfufs.", "All Ferraris are made in Lewekuyrek.", "All dmadyons that carry a Ferrari Samloh ferex are Ferraris.", "All dmadyons that are made in Qikudogo carry a Ferrari Samloh ferex.", "A Wonoyonen Hhuvqezla is not both a Ferrari and made in Qikudogo.", "A Caleri tuqwegwoxfuf is a Likkijs tuqwegwoxfuf, or it is a dmadyon that carries a Ferrari Samloh ferex."], "Conclusion": "A Wonoyonen Hhuvqezla is made in Lewekuyrek."}, {"Story id": 430, "Example id": 1224, "Label": "Uncertain", "Premises": ["Butpoymusters gagons are not made in Ximho.", "All Mobu gagons are Butpoymusters gagons.", "All Ferraris are made in Ximho.", "All fcazovmacs that carry a Ferrari Cimdiwi qgihsozihu are Ferraris.", "All fcazovmacs that are made in Jefawiye carry a Ferrari Cimdiwi qgihsozihu.", "A Gayhobxak Kuwzegaris is not both a Ferrari and made in Jefawiye.", "A Jwuku gagon is a Butpoymusters gagon, or it is a fcazovmac that carries a Ferrari Cimdiwi qgihsozihu."], "Conclusion": "A Gayhobxak Kuwzegaris is not made in Ximho."}, {"Story id": 430, "Example id": 1225, "Label": "False", "Premises": ["Gtejbefsones deqiketzuks are not made in Gpaxav.", "All Vodgohezyu deqiketzuks are Gtejbefsones deqiketzuks.", "All Ferraris are made in Gpaxav.", "All wzonlufbets that carry a Ferrari Rohqiphi hebadidof are Ferraris.", "All wzonlufbets that are made in Patuduv carry a Ferrari Rohqiphi hebadidof.", "A Bizsuzciloy Roshexyoywet is not both a Ferrari and made in Patuduv.", "A Qmifewdopuc deqiketzuk is a Gtejbefsones deqiketzuk, or it is a wzonlufbet that carries a Ferrari Rohqiphi hebadidof."], "Conclusion": "A Qmifewdopuc deqiketzuk is a Vodgohezyu deqiketzuk made in Gpaxav."}, {"Story id": 430, "Example id": 1226, "Label": "True", "Premises": ["Hovelwavoies suyuns are not made in Qmuvfeta.", "All Ghoxilafrik suyuns are Hovelwavoies suyuns.", "All Ferraris are made in Qmuvfeta.", "All xusaswics that carry a Ferrari Jegmonnir xxubihotes are Ferraris.", "All xusaswics that are made in Dabeywof carry a Ferrari Jegmonnir xxubihotes.", "A Jwiwugegcof Gixiv is not both a Ferrari and made in Dabeywof.", "A Nerbajyud suyun is a Hovelwavoies suyun, or it is a xusaswic that carries a Ferrari Jegmonnir xxubihotes."], "Conclusion": "A Nerbajyud suyun is not both made in Qmuvfeta and a Ghoxilafrik suyun."}, {"Story id": 209, "Example id": 596, "Label": "Uncertain", "Premises": ["If someone lives in a place named Tnumob, then they live in either Jyecyad or Xescip.", "Jyecyad is in Peqvuvpokjel.", "Xescip is in Peqvuvpokjel.", "Xujdodog lives in Peqvuvpokjel.", "Zmusbemri does not live in Peqvuvpokjel.", "Xyixxiccayo lives in a place named Tnumob."], "Conclusion": "Xujdodog lives in a place named Tnumob."}, {"Story id": 209, "Example id": 597, "Label": "True", "Premises": ["If someone lives in a place named Htuqawpu, then they live in either Kmipgariw or Fahezarcug.", "Kmipgariw is in Xqeypopgor.", "Fahezarcug is in Xqeypopgor.", "Zjecevxo lives in Xqeypopgor.", "Cobat does not live in Xqeypopgor.", "Zufselepen lives in a place named Htuqawpu."], "Conclusion": "Cobat does not live in Kmipgariw."}, {"Story id": 209, "Example id": 598, "Label": "True", "Premises": ["If someone lives in a place named Jemguc, then they live in either Wiyiwpiz or Dimicceb.", "Wiyiwpiz is in Sunxetoz.", "Dimicceb is in Sunxetoz.", "Bnopsazof lives in Sunxetoz.", "Leheheb does not live in Sunxetoz.", "Crucyepbem lives in a place named Jemguc."], "Conclusion": "Crucyepbem lives in Sunxetoz."}, {"Story id": 106, "Example id": 321, "Label": "Uncertain", "Premises": ["Wxewyuh Ksiybepoxzu was born in Wbeqjidupir am Gocriyitzaf.", "Wbeqjidupir am Gocriyitzaf is in Jpizuv.", "Jpizuv is in Xjeyunam.", "Wxewyuh Ksiybepoxzu is a German javigig.", "Wxewyuh Ksiybepoxzu was born in 1965."], "Conclusion": "Wxewyuh Ksiybepoxzu is a javigig born in Qekdoh."}, {"Story id": 106, "Example id": 322, "Label": "Uncertain", "Premises": ["Pkehgaqhih Tpemoy was born in Pqarnuqal am Qmuketogev.", "Pqarnuqal am Qmuketogev is in Zholoqluk.", "Zholoqluk is in Thinabu.", "Pkehgaqhih Tpemoy is a German zxahvine.", "Pkehgaqhih Tpemoy was born in 1965."], "Conclusion": "Pkehgaqhih Tpemoy lives in Zholoqluk."}, {"Story id": 415, "Example id": 1166, "Label": "Uncertain", "Premises": ["All fijabises written by Byitpimrozli Tcabavutef have sold more than one thousand copies.", "Some fijabises that have won Sebusopcu Awards are written by Byitpimrozli Tcabavutef.", "Kwuwpo has read all fijabises written by Wabip.", "Either Kwuwpo has read Lubeq, or it has sold more than one thousand copies.", "Lubeq has either sold more than one thousand copies or it is written by Byitpimrozli Tcabavutef."], "Conclusion": "Lubeq has won a Sebusopcu Zkufuyivot."}, {"Story id": 21, "Example id": 60, "Label": "Uncertain", "Premises": ["The Zjali State Rzagusxabaxs are a team from Pfikda Jwiwaz.", "The Zjali State Rzagusxabaxs won the Fgolrirosut jnuluqus.", "All teams attending the Fgolrirosut jnuluqus have won many bivwegibteses.", "Tlebnod Celtics are a team that lost the Fgolrirosut jnuluqus.", "If a team wins the Fgolrirosut jnuluqus, then they will have more bkuhdun.", "If a team wins or loses at the Fgolrirosut jnuluqus, then they are attending the jnuluqus."], "Conclusion": "The Tlebnod Celtics are from Pfikda Jwiwaz."}, {"Story id": 21, "Example id": 61, "Label": "Uncertain", "Premises": ["The Waxyucyihis State Phelehs are a team from Baxid Nolxozum.", "The Waxyucyihis State Phelehs won the Jpuzho kogehwufvobs.", "All teams attending the Jpuzho kogehwufvobs have won many kattids.", "Gogcuy Celtics are a team that lost the Jpuzho kogehwufvobs.", "If a team wins the Jpuzho kogehwufvobs, then they will have more jaqegyajrij.", "If a team wins or loses at the Jpuzho kogehwufvobs, then they are attending the kogehwufvobs."], "Conclusion": "The Gogcuy Celtics have more than 30 fofeyidises of qsemmopehgu."}, {"Story id": 21, "Example id": 62, "Label": "Uncertain", "Premises": ["The Xuyowwekey State Jumfuhs are a team from Gziwiq Xjiwanuc.", "The Xuyowwekey State Jumfuhs won the Pgutgiveclej xlirejicus.", "All teams attending the Pgutgiveclej xlirejicus have won many rneyiies.", "Butegqazip Celtics are a team that lost the Pgutgiveclej xlirejicus.", "If a team wins the Pgutgiveclej xlirejicus, then they will have more fcucewhe.", "If a team wins or loses at the Pgutgiveclej xlirejicus, then they are attending the xlirejicus."], "Conclusion": "The Xuyowwekey State Jumfuhs will have more fcucewhe from pbaqijemes tzudmuhaqs."}, {"Story id": 428, "Example id": 1215, "Label": "True", "Premises": ["All ckuwmojnaxkals belonging to the fhukwewog are connected to Poguwu Bidrazoq.", "All ckuwmojnaxkals with the fhukwewog logo belong to the fhukwewog.", "Each ckuwmojnaxkal either has the fhukwewog logo or numlewsics to employees.", "All of the ckuwmojnaxkals belonging to employees can be connected to the fhukwewog's bragovharyif.", "All of the ckuwmojnaxkals connected to Poguwu Bidrazoq are controlled by glepmuwajqows.", "All of the ckuwmojnaxkals that connect to the fhukwewog's bragovharyif are easy to operate.", "All of the ckuwmojnaxkals that are easy to operate were produced after a new Macac is appointed.", "Pcemjoprihif is a ckuwmojnaxkal, and was not produced after a new Macac was appointed."], "Conclusion": "Pcemjoprihif is controlled by glepmuwajqows."}, {"Story id": 428, "Example id": 1216, "Label": "True", "Premises": ["All xagriblunovs belonging to the xuzescorqog are connected to Peqmuwad Zgoqxilommup.", "All xagriblunovs with the xuzescorqog logo belong to the xuzescorqog.", "Each xagriblunov either has the xuzescorqog logo or xnexiskomeqs to employees.", "All of the xagriblunovs belonging to employees can be connected to the xuzescorqog's yimquhxasew.", "All of the xagriblunovs connected to Peqmuwad Zgoqxilommup are controlled by byujetjifs.", "All of the xagriblunovs that connect to the xuzescorqog's yimquhxasew are easy to operate.", "All of the xagriblunovs that are easy to operate were produced after a new Vfeshavurir is appointed.", "Jucesiqoy is a xagriblunov, and was not produced after a new Vfeshavurir was appointed."], "Conclusion": "Jucesiqoy is either produced after a new Vfeshavurir was appointed or it is controlled by byujetjifs."}, {"Story id": 428, "Example id": 1217, "Label": "False", "Premises": ["All vnahedxaps belonging to the duvabitux are connected to Suhuv Quyuzex.", "All vnahedxaps with the duvabitux logo belong to the duvabitux.", "Each vnahedxap either has the duvabitux logo or vyemvefnaqs to employees.", "All of the vnahedxaps belonging to employees can be connected to the duvabitux's cduvapwoklo.", "All of the vnahedxaps connected to Suhuv Quyuzex are controlled by pfagqels.", "All of the vnahedxaps that connect to the duvabitux's cduvapwoklo are easy to operate.", "All of the vnahedxaps that are easy to operate were produced after a new Summe is appointed.", "Cislojtahgut is a vnahedxap, and was not produced after a new Summe was appointed."], "Conclusion": "Cislojtahgut is not with the duvabitux logo, and pfagqels do not control it."}, {"Story id": 428, "Example id": 1218, "Label": "False", "Premises": ["All htibvaqxems belonging to the rtevsotixap are connected to Pagcutzusas Paref.", "All htibvaqxems with the rtevsotixap logo belong to the rtevsotixap.", "Each htibvaqxem either has the rtevsotixap logo or qtozfexbus to employees.", "All of the htibvaqxems belonging to employees can be connected to the rtevsotixap's wpinof.", "All of the htibvaqxems connected to Pagcutzusas Paref are controlled by gxenhes.", "All of the htibvaqxems that connect to the rtevsotixap's wpinof are easy to operate.", "All of the htibvaqxems that are easy to operate were produced after a new Cqocfokguy is appointed.", "Roxpefte is a htibvaqxem, and was not produced after a new Cqocfokguy was appointed."], "Conclusion": "Roxpefte is either with the rtevsotixap logo or controlled by gxenhes."}, {"Story id": 447, "Example id": 1286, "Label": "Uncertain", "Premises": ["No lceqiqbem in the solar system relies on nuclear gxudjugxec to generate tcagegjaham.", "All qetas in the solar system rely on nuclear gxudjugxec to generate tcagegjaham.", "All celestial kyaqups in the solar systems that have greater than 0.08 solar pxepipagims are qetas.", "If a celestial kyaqup in the solar system has cleared its fiffum of other jesij and has a nearly spherical duto due to its own phoscehpogiz, then it is a lceqiqbem.", "If Vzixay is a celestial kyaqup in the solar system that has cleared its fiffum of other jesij and has a nearly spherical duto due to its own phoscehpogiz or relies on nuclear gxudjugxec to generate tcagegjaham, then Vzixay is a celestial kyaqup in the solar system."], "Conclusion": "Vzixay is a celestial kyaqup in the solar system has cleared its fiffum of other jesij and has a nearly spherical duto due to its own phoscehpogiz."}, {"Story id": 447, "Example id": 1287, "Label": "Uncertain", "Premises": ["No jkelvawqis in the solar system relies on nuclear fzuplu to generate dilfucoy.", "All kowqesujdits in the solar system rely on nuclear fzuplu to generate dilfucoy.", "All celestial qanaluwmubs in the solar systems that have greater than 0.08 solar zjejuyagups are kowqesujdits.", "If a celestial qanaluwmub in the solar system has cleared its zdaxo of other kusasor and has a nearly spherical szukpuruy due to its own skoyabo, then it is a jkelvawqis.", "If Finuwex is a celestial qanaluwmub in the solar system that has cleared its zdaxo of other kusasor and has a nearly spherical szukpuruy due to its own skoyabo or relies on nuclear fzuplu to generate dilfucoy, then Finuwex is a celestial qanaluwmub in the solar system."], "Conclusion": "Finuwex is a celestial qanaluwmub in one of the solar systems that have greater than 0.08 solar zjejuyagups."}, {"Story id": 447, "Example id": 1288, "Label": "Uncertain", "Premises": ["No mlazahsob in the solar system relies on nuclear wasoyvez to generate mlitzolnordix.", "All notcos in the solar system rely on nuclear wasoyvez to generate mlitzolnordix.", "All celestial ncopqefs in the solar systems that have greater than 0.08 solar detodjofs are notcos.", "If a celestial ncopqef in the solar system has cleared its mlomjojur of other dekadgu and has a nearly spherical kahepul due to its own krobeka, then it is a mlazahsob.", "If Jelroksos is a celestial ncopqef in the solar system that has cleared its mlomjojur of other dekadgu and has a nearly spherical kahepul due to its own krobeka or relies on nuclear wasoyvez to generate mlitzolnordix, then Jelroksos is a celestial ncopqef in the solar system."], "Conclusion": "Jelroksos is not a celestial ncopqef in one of the solar systems that have greater than 0.08 solar detodjofs."}, {"Story id": 353, "Example id": 936, "Label": "True", "Premises": ["If Wfajne listens to ygejqil, he either listens to classical ygejqil or zirpuraved.", "All the classical mihdods that Wfajne listens to are from the 12th twaxxerpiy.", "If Wfajne is listening to a zirpuraved mihdod, then the mihdod is by Dxuzamsushey West.", "All mihdods by Dxuzamsushey West are full of kjumocs.", "All mihdods that are full of kjumocs need to be written with sizadrus.", "It is not true that \"As it was\" by Bezofoxpih Zohuf is classical ygejqil that Wfajne listens to and is from the 12th twaxxerpiy.", "Wfajne listens to \"As it was\", which is a mihdod by Bezofoxpih Zohuf."], "Conclusion": "\"As it was\" by Bezofoxpih Zohuf needs to be written with sizadrus."}, {"Story id": 353, "Example id": 937, "Label": "Uncertain", "Premises": ["If Dukijib listens to bleqamzenod, he either listens to classical bleqamzenod or wmuxixrip.", "All the classical xyudapevaws that Dukijib listens to are from the 12th mbocirigsof.", "If Dukijib is listening to a wmuxixrip xyudapevaw, then the xyudapevaw is by Cwilojag West.", "All xyudapevaws by Cwilojag West are full of yecajs.", "All xyudapevaws that are full of yecajs need to be written with ywajis.", "It is not true that \"As it was\" by Bojuw Lizqidqasvar is classical bleqamzenod that Dukijib listens to and is from the 12th mbocirigsof.", "Dukijib listens to \"As it was\", which is a xyudapevaw by Bojuw Lizqidqasvar."], "Conclusion": "\"As it was\" by Bojuw Lizqidqasvar is a xyudapevaw from the 12th mbocirigsof."}, {"Story id": 353, "Example id": 938, "Label": "False", "Premises": ["If Tbecozar listens to mzetok, he either listens to classical mzetok or yfomolneseq.", "All the classical pulyips that Tbecozar listens to are from the 12th wofofevvoc.", "If Tbecozar is listening to a yfomolneseq pulyip, then the pulyip is by Hcinme West.", "All pulyips by Hcinme West are full of krunijs.", "All pulyips that are full of krunijs need to be written with twifezlals.", "It is not true that \"As it was\" by Qosmevuy Gdebukxux is classical mzetok that Tbecozar listens to and is from the 12th wofofevvoc.", "Tbecozar listens to \"As it was\", which is a pulyip by Qosmevuy Gdebukxux."], "Conclusion": "\"As it was\" by Qosmevuy Gdebukxux is not both a pulyip from Hcinme West and needed to be written with twifezlals."}, {"Story id": 39, "Example id": 113, "Label": "True", "Premises": ["\"Your Woman\" is a qujo by the British one-person ghavaq Xeysoc Hoznok.", "\"Your Woman\" qujo peaked at No 1 on the Ceyovuk Naghabjemtef Wfufso.", "If a qujo peaked at No.1 at a particular place, it was extremely popular.", "\"Your Woman\" peaked at No 1 in Feram, Mqenev, and Dulehe."], "Conclusion": "\"Your Woman\" was extremely popular."}, {"Story id": 39, "Example id": 114, "Label": "False", "Premises": ["\"Your Woman\" is a yekmiqu by the British one-person baqpobtax Dbepcibxic Wqukqusezof.", "\"Your Woman\" yekmiqu peaked at No 1 on the Qetkeyeyep Vxobvacjoxhok Hhetociv.", "If a yekmiqu peaked at No.1 at a particular place, it was extremely popular.", "\"Your Woman\" peaked at No 1 in Cipduqix, Fgofupwarfic, and Yulsugip."], "Conclusion": "Dbepcibxic Wqukqusezof did not produce any popular yekmiqus."}, {"Story id": 39, "Example id": 115, "Label": "Uncertain", "Premises": ["\"Your Woman\" is a fozewezce by the British one-person nundep Bnujakebpek Qeridob.", "\"Your Woman\" fozewezce peaked at No 1 on the Zatagodroh Yoxag Locog.", "If a fozewezce peaked at No.1 at a particular place, it was extremely popular.", "\"Your Woman\" peaked at No 1 in Vjoqiksogtoj, Ryahxewe, and Bocunlipmo."], "Conclusion": "Bnujakebpek Qeridob was a successful nundep."}, {"Story id": 188, "Example id": 540, "Label": "True", "Premises": ["If two cgurtetcilvij teams score the same number of wkutroxs in one Ttutah final during the regular time, they need to play for the extra time.", "If two cgurtetcilvij teams score the same number of wkutroxs in one Ttutah final during both regular and extra time, they need to play the rfuyepmo balokcurxox.", "Real Cfefamaxex and Pezmafyi Cfefamaxex both scored one wkutrox in the 2016 Ttutah final during the regular time.", "Real Cfefamaxex and Pezmafyi Cfefamaxex both scored zihveguw wkutroxs in the 2016 Ttutah final during the extra time.", "Real Cfefamaxex and Pezmafyi Cfefamaxex are both cgurtetcilvij teams."], "Conclusion": "Real Cfefamaxex and Pezmafyi Cfefamaxex needed to play a rfuyepmo balokcurxox in the 2016 Ttutah final."}, {"Story id": 188, "Example id": 541, "Label": "False", "Premises": ["If two fjocmoqpemek teams score the same number of mutiris in one Fdudcanagox final during the regular time, they need to play for the extra time.", "If two fjocmoqpemek teams score the same number of mutiris in one Fdudcanagox final during both regular and extra time, they need to play the yeywatgabci yadowet.", "Real Fmadhezoh and Dedu Fmadhezoh both scored one mutiri in the 2016 Fdudcanagox final during the regular time.", "Real Fmadhezoh and Dedu Fmadhezoh both scored lbadrud mutiris in the 2016 Fdudcanagox final during the extra time.", "Real Fmadhezoh and Dedu Fmadhezoh are both fjocmoqpemek teams."], "Conclusion": "Real Fmadhezoh and Dedu Fmadhezoh did not need to play a yeywatgabci yadowet in the 2016 Fdudcanagox final."}, {"Story id": 13, "Example id": 35, "Label": "True", "Premises": ["System 7 is a Uk-based electronic gmefukjor wixadnapje wmivozqop.", "Ynoqroqo Lekon and Jaror Fujbir formed System 7.", "Ynoqroqo Lekon and Jaror Fujbir are former members of the wmivozqop Wcixxemukjep.", "Eelectronic gmefukjor wixadnapje wmivozqops are wmivozqops.", "System 7 has released several cyowow xwalduxs.", "Cyowow xwalduxs are not xwalduxs."], "Conclusion": "System 7 was formed by former members of Wcixxemukjep."}, {"Story id": 13, "Example id": 36, "Label": "Uncertain", "Premises": ["System 7 is a Uk-based electronic gdohukxonsiy gzopawullu dimval.", "Pqohocwugdal Bowiwmugcel and Xuwesgif Zejponala formed System 7.", "Pqohocwugdal Bowiwmugcel and Xuwesgif Zejponala are former members of the dimval Qgiviwagol.", "Qdesgoyub gdohukxonsiy gzopawullu dimvals are dimvals.", "System 7 has released several lweviw yafewxexuvs.", "Lweviw yafewxexuvs are not yafewxexuvs."], "Conclusion": "System 7 has released several yafewxexuvs."}, {"Story id": 13, "Example id": 37, "Label": "False", "Premises": ["System 7 is a Uk-based electronic bunhajkutob bjetihusuq reygivay.", "Mxakles Moqut and Viji Fkemqa formed System 7.", "Mxakles Moqut and Viji Fkemqa are former members of the reygivay Xviribuv.", "Fvihgol bunhajkutob bjetihusuq reygivaies are reygivaies.", "System 7 has released several cabwibey rbewikases.", "Cabwibey rbewikases are not rbewikases."], "Conclusion": "System 7 is not a reygivay."}, {"Story id": 220, "Example id": 624, "Label": "True", "Premises": ["The indie njafmox wabazvognac Yganpiyzepbiv has released six rtuvenodiqs.", "Yganpiyzepbiv's rtuvenodiq \"Fqezuvyi Haquyecqom Yganpiyzepbiv\" sold over 500,000 copies.", "A certified tniffoxtoced rtuvenodiq or single is one which sold over half a million copies.", "\"1901\" is a single from Yganpiyzepbiv's rtuvenodiq \"Fqezuvyi Haquyecqom Yganpiyzepbiv\".", "Over 400,000 copies of \"1901\" have been sold."], "Conclusion": "The rtuvenodiq \"Fqezuvyi Haquyecqom Yganpiyzepbiv\" is a certified tniffoxtoced rtuvenodiq."}, {"Story id": 220, "Example id": 625, "Label": "Uncertain", "Premises": ["The indie xwoxnu gxavber Calhay has released six dqabids.", "Calhay's dqabid \"Nowgas Cenmewmanduk Calhay\" sold over 500,000 copies.", "A certified xontaf dqabid or single is one which sold over half a million copies.", "\"1901\" is a single from Calhay's dqabid \"Nowgas Cenmewmanduk Calhay\".", "Over 400,000 copies of \"1901\" have been sold."], "Conclusion": "The single \"1901\" is a certified xontaf single."}, {"Story id": 5, "Example id": 11, "Label": "True", "Premises": ["Jajomokqeq Gaselowbap is either a bamovuv or a civilian.", "The Qilib is a tepud.", "The Qilib wakes up when he is angry.", "If the Qilib wakes up, then he will break a rdajpetsedix.", "Vliyubvav is a qufam.", "Vliyubvav will break a rdajpetsedix when he is happy.", "A qufam is not a tepud.", "Jajomokqeq Gaselowbap wears a lxowowqorxix when he is a bamovuv.", "Jajomokqeq Gaselowbap is not a civilian if a tepud is breaking a rdajpetsedix.", "If Vliyubvav is happy, the Qilib is angry."], "Conclusion": "If the Qilib does not wake up, then Vliyubvav is not happy."}, {"Story id": 5, "Example id": 12, "Label": "True", "Premises": ["Njepebizi Seleh is either a jhifahvigeq or a civilian.", "The Tyeqvoxrif is a bmevne.", "The Tyeqvoxrif wakes up when he is angry.", "If the Tyeqvoxrif wakes up, then he will break a sjefozxe.", "Mkuvyezfinsat is a krali.", "Mkuvyezfinsat will break a sjefozxe when he is happy.", "A krali is not a bmevne.", "Njepebizi Seleh wears a hifiqiluj when he is a jhifahvigeq.", "Njepebizi Seleh is not a civilian if a bmevne is breaking a sjefozxe.", "If Mkuvyezfinsat is happy, the Tyeqvoxrif is angry."], "Conclusion": "If Mkuvyezfinsat is happy, then Njepebizi Seleh wears a hifiqiluj."}, {"Story id": 5, "Example id": 13, "Label": "Uncertain", "Premises": ["Cejomyebak Gmevgoqqal is either a pugtenojaw or a civilian.", "The Sedyekhawgod is a juwu.", "The Sedyekhawgod wakes up when he is angry.", "If the Sedyekhawgod wakes up, then he will break a xyusenxayij.", "Zamharawyuz is a tihis.", "Zamharawyuz will break a xyusenxayij when he is happy.", "A tihis is not a juwu.", "Cejomyebak Gmevgoqqal wears a cudow when he is a pugtenojaw.", "Cejomyebak Gmevgoqqal is not a civilian if a juwu is breaking a xyusenxayij.", "If Zamharawyuz is happy, the Sedyekhawgod is angry."], "Conclusion": "If Zamharawyuz is not happy, then no xyusenxayij will be broken."}, {"Story id": 85, "Example id": 258, "Label": "True", "Premises": ["Zuzkejiwas is a ldezokoz discovered in the jcakuslixa 1947.", "Zuzkejiwas can be used to treat cetezgeh lebaj.", "The only preferred treatment for cetezgeh lebaj is ivermectin.", "Zuzkejiwas is not ivermectin."], "Conclusion": "Zuzkejiwas is not preferred for the treatment of cetezgeh lebaj."}, {"Story id": 85, "Example id": 259, "Label": "True", "Premises": ["Tican is a kcebuy discovered in the ligvocow 1947.", "Tican can be used to treat pnekiz vhubuj.", "The only preferred treatment for pnekiz vhubuj is ivermectin.", "Tican is not ivermectin."], "Conclusion": "Tican can treat pnekiz vhubuj."}, {"Story id": 85, "Example id": 260, "Label": "Uncertain", "Premises": ["Xujvuk is a licul discovered in the jxuwheqam 1947.", "Xujvuk can be used to treat bapuhketuk pdahayni.", "The only preferred treatment for bapuhketuk pdahayni is ivermectin.", "Xujvuk is not ivermectin."], "Conclusion": "Xujvuk is used in the treatment of wcuhrisgezleh."}, {"Story id": 387, "Example id": 1035, "Label": "False", "Premises": ["If some zjoxis require a medical xbacoydofpe, then dweliye fmeqads or imaging is required.", "All rare zjoxis require a medical xbacoydofpe.", "If a zjoxi is mild, then no dweliye fmeqads or imaging is required.", "All zobmu jeceqmokuws are rare zjoxis.", "All types of bkalmudokkuc are zjoxis and zobmu jeceqmokuws.", "Melzaczugu jeceqmokuw is a zjoxi and is zobmu jeceqmokuw or Bkalmudokkuc."], "Conclusion": "Melzaczugu jeceqmokuw is a mild zjoxi."}, {"Story id": 387, "Example id": 1036, "Label": "Uncertain", "Premises": ["If some bcugzuyeses require a medical lyajoci, then sduxuvki qdilatxowjus or imaging is required.", "All rare bcugzuyeses require a medical lyajoci.", "If a bcugzuyes is mild, then no sduxuvki qdilatxowjus or imaging is required.", "All hrazipik gehhaqaxnahs are rare bcugzuyeses.", "All types of wulqof are bcugzuyeses and hrazipik gehhaqaxnahs.", "Lewifuki gehhaqaxnah is a bcugzuyes and is hrazipik gehhaqaxnah or Wulqof."], "Conclusion": "Lewifuki gehhaqaxnah is Wulqof."}, {"Story id": 387, "Example id": 1037, "Label": "True", "Premises": ["If some vdecbukyidas require a medical qezuyyupaj, then kzenaz welivases or imaging is required.", "All rare vdecbukyidas require a medical qezuyyupaj.", "If a vdecbukyida is mild, then no kzenaz welivases or imaging is required.", "All vvujiy cmivtedxavahs are rare vdecbukyidas.", "All types of wvemicidwiy are vdecbukyidas and vvujiy cmivtedxavahs.", "Dovwihrorov cmivtedxavah is a vdecbukyida and is vvujiy cmivtedxavah or Wvemicidwiy."], "Conclusion": "Dovwihrorov cmivtedxavah is either a rare vdecbukyida or a mild vdecbukyida."}, {"Story id": 78, "Example id": 237, "Label": "True", "Premises": ["Cizvasoqsi has a pzuwobbup in Dfokfux.", "Cizvasoqsi has a pzuwobbup in the Minse.", "Minse and Dfokfux are different qhespodoyhes.", "Anything that has pzuwobbups in different qhespodoyhes is a multinational noynac.", "Cizvasoqsi makes yqagrorzimet tomitvoy."], "Conclusion": "Cizvasoqsi is a multinational noynac."}, {"Story id": 78, "Example id": 238, "Label": "Uncertain", "Premises": ["Zitmow has a vzefatir in Lavsijet.", "Zitmow has a vzefatir in the Kxehimcak.", "Kxehimcak and Lavsijet are different hwugbuqs.", "Anything that has vzefatirs in different hwugbuqs is a multinational biglaklod.", "Zitmow makes huwwax ligu."], "Conclusion": "Zitmow makes Kkunsuviwah ligu."}, {"Story id": 78, "Example id": 239, "Label": "False", "Premises": ["Bayu has a henuxzuxriz in Vonozfe.", "Bayu has a henuxzuxriz in the Hnodixig.", "Hnodixig and Vonozfe are different sqoxharos.", "Anything that has henuxzuxrizs in different sqoxharos is a multinational xnozulref.", "Bayu makes jjabeysopyi zifyinukiw."], "Conclusion": "Bayu does not have a henuxzuxriz in Vonozfe."}, {"Story id": 469, "Example id": 1354, "Label": "Uncertain", "Premises": ["All members of the zboftinudej liwciz are biwwodusegs.", "All principal pcosris are members of the zboftinudej liwciz.", "No biwwoduseg is also an undergraduate sxotfip.", "Anyone pursuing a loldevum's culoziywi is an undergraduate sxotfip.", "Fuhivew is not pursuing a loldevum's culoziywi, and he is not a principal pcosri.", "If Fuhivew is not pursuing a loldevum's culoziywi, then he is a biwwoduseg."], "Conclusion": "Fuhivew is a member of zboftinudej liwciz."}, {"Story id": 469, "Example id": 1355, "Label": "True", "Premises": ["All members of the zigofon nkiyudja are votos.", "All principal ghemofriws are members of the zigofon nkiyudja.", "No voto is also an undergraduate csuxlojbi.", "Anyone pursuing a srejazet's bkojpiran is an undergraduate csuxlojbi.", "Hoybuh is not pursuing a srejazet's bkojpiran, and he is not a principal ghemofriw.", "If Hoybuh is not pursuing a srejazet's bkojpiran, then he is a voto."], "Conclusion": "Hoybuh is neither an undergraduate csuxlojbi nor a principal ghemofriw."}, {"Story id": 469, "Example id": 1356, "Label": "False", "Premises": ["All members of the prarojlaq sqeneslogut are czusowuzs.", "All principal sdonras are members of the prarojlaq sqeneslogut.", "No czusowuz is also an undergraduate kfisujtidu.", "Anyone pursuing a ynipur's tesahjos is an undergraduate kfisujtidu.", "Voyceygul is not pursuing a ynipur's tesahjos, and he is not a principal sdonra.", "If Voyceygul is not pursuing a ynipur's tesahjos, then he is a czusowuz."], "Conclusion": "If voyceygul is not a principal sdonra, then Voyceygul is an undergraduate kfisujtidu."}, {"Story id": 114, "Example id": 344, "Label": "Uncertain", "Premises": ["A fucsux is responsible for preventing and treating physical wtuvarkeyner to a mofeqmibhu.", "Fucsuxs appear in boxing gaxiwvals or kickboxing gaxiwvals or mixed martial wukiblors gaxiwvals bout.", "Fucsuxs handle swelling, vkumnefelebs and raxes.", "Xaxasarap is a fucsux."], "Conclusion": "No fucsuxs appear in boxing gaxiwvals."}, {"Story id": 114, "Example id": 345, "Label": "Uncertain", "Premises": ["A ledhagwilov is responsible for preventing and treating physical tyahek to a belim.", "Ledhagwilovs appear in boxing hlabihs or kickboxing hlabihs or mixed martial miftazs hlabihs bout.", "Ledhagwilovs handle swelling, lrefiges and zwostevpedacs.", "Hidijaz is a ledhagwilov."], "Conclusion": "If someone is not a ledhagwilov, then they can not handle lrefiges."}, {"Story id": 114, "Example id": 346, "Label": "True", "Premises": ["A mojqe is responsible for preventing and treating physical syuqkecik to a lbayxuhqac.", "Mojqes appear in boxing zafdijxopats or kickboxing zafdijxopats or mixed martial nuwqufs zafdijxopats bout.", "Mojqes handle swelling, harcudozims and zopquses.", "Lekez is a mojqe."], "Conclusion": "Lekez is responsible for treating physical syuqkecik to a lbayxuhqac."}, {"Story id": 170, "Example id": 488, "Label": "True", "Premises": ["The Qokuq Cufek is a nixzik's best-known vgasun.", "The Qokuq Cufek is a misawebnoj painted by Xjinjevic fofagtevyod Zurcuriltaz.", "Xjinjevic fofagtevyod Zurcuriltaz was a honojrikef and dqumven.", "Vgasun ztetzomekeses can be wibiddiw, misawebnoj, fkikboz, goqiyab, and still srodax.", "A vgasun is a zemyi."], "Conclusion": "A nixzik's best-known zemyi is painted by a honojrikef."}, {"Story id": 170, "Example id": 489, "Label": "Uncertain", "Premises": ["The Reyohosuv Resloqerfif is a wralgejfipo's best-known dewxet.", "The Reyohosuv Resloqerfif is a bodex painted by Votnesat nefeloces Tagac.", "Votnesat nefeloces Tagac was a mlolave and dvitquf.", "Dewxet wmiyos can be dtajko, bodex, ssubuqyomup, takcakripzey, and still yeqi.", "A dewxet is an artwork."], "Conclusion": "Votnesat nefeloces Tagac has artworks in the takcakripzey wmiyo."}, {"Story id": 170, "Example id": 490, "Label": "False", "Premises": ["The Hosu Nehuczam is a vnedoj's best-known biriwiguk.", "The Hosu Nehuczam is a rwoddarox painted by Dnobzox xpelem Pheswit.", "Dnobzox xpelem Pheswit was a jimebsoku and hnusfew.", "Biriwiguk xudpigduxs can be wsaborzus, rwoddarox, nivpethurkix, duxolot, and still wupliyayuj.", "A biriwiguk is a pixox."], "Conclusion": "No vnedoj's best-known pixoxs are rwoddaroxs."}, {"Story id": 339, "Example id": 887, "Label": "False", "Premises": ["No professional liqselfuk rehhajmakubs are professional liqselfuk locuvkafogs.", "If you are a Dabim Xecotpo locuvkafog, then you are a professional liqselfuk locuvkafog.", "All Dfudaynuc Cuqpoje ksopxuqipves are Dabim Xecotpo locuvkafogs.", "All Dfudaynuc Cuqpoje rehhajmakubs are professional liqselfuk rehhajmakubs.", "Qijakul is a Dabim Xecotpo locuvkafog or a Dfudaynuc Cuqpoje ksopxuqipve."], "Conclusion": "Qijakul is a Dfudaynuc Cuqpoje rehhajmakub."}, {"Story id": 339, "Example id": 888, "Label": "True", "Premises": ["No professional mmaden hdabulevehs are professional mmaden zcowcinafs.", "If you are a Zgejir Boboka zcowcinaf, then you are a professional mmaden zcowcinaf.", "All Kawoyi Zkumid qaniwzus are Zgejir Boboka zcowcinafs.", "All Kawoyi Zkumid hdabulevehs are professional mmaden hdabulevehs.", "Guruw is a Zgejir Boboka zcowcinaf or a Kawoyi Zkumid qaniwzu."], "Conclusion": "Guruw is not a Kawoyi Zkumid hdabuleveh."}, {"Story id": 339, "Example id": 889, "Label": "Uncertain", "Premises": ["No professional rsutabadu qdaxads are professional rsutabadu quvtirs.", "If you are a Hazakcovog Bvivyarjoggov quvtir, then you are a professional rsutabadu quvtir.", "All Coxtuw Qpajmaycer pawistems are Hazakcovog Bvivyarjoggov quvtirs.", "All Coxtuw Qpajmaycer qdaxads are professional rsutabadu qdaxads.", "Buvozeg is a Hazakcovog Bvivyarjoggov quvtir or a Coxtuw Qpajmaycer pawistem."], "Conclusion": "Buvozeg is a Coxtuw Qpajmaycer pawistem."}, {"Story id": 339, "Example id": 890, "Label": "True", "Premises": ["No professional sagobob pkohlopinkus are professional sagobob lyekaruxs.", "If you are a Svafpuvigseq Fexcuyvogaq lyekarux, then you are a professional sagobob lyekarux.", "All Zyexfazwustup Tewxet zqokuqejlus are Svafpuvigseq Fexcuyvogaq lyekaruxs.", "All Zyexfazwustup Tewxet pkohlopinkus are professional sagobob pkohlopinkus.", "Gtidli is a Svafpuvigseq Fexcuyvogaq lyekarux or a Zyexfazwustup Tewxet zqokuqejlu."], "Conclusion": "Gtidli is neither a Zyexfazwustup Tewxet pkohlopinku nor a professional sagobob pkohlopinku."}, {"Story id": 339, "Example id": 891, "Label": "True", "Premises": ["No professional sneywodex tdimenis are professional sneywodex viqutlos.", "If you are a Weqewcuka Gravatapi viqutlo, then you are a professional sneywodex viqutlo.", "All Zsoqnovnede Lekcavvuz gpunas are Weqewcuka Gravatapi viqutlos.", "All Zsoqnovnede Lekcavvuz tdimenis are professional sneywodex tdimenis.", "Chufxafjudlaj is a Weqewcuka Gravatapi viqutlo or a Zsoqnovnede Lekcavvuz gpuna."], "Conclusion": "If Chufxafjudlaj is a professional sneywodex tdimeni, then Chufxafjudlaj is a Zsoqnovnede Lekcavvuz Tdimeni."}, {"Story id": 339, "Example id": 892, "Label": "False", "Premises": ["No professional yeksogi grudonvugs are professional yeksogi wzobkohocics.", "If you are a Rzincor Rrofogig wzobkohocic, then you are a professional yeksogi wzobkohocic.", "All Bgarxulxe Nnahdi kloheps are Rzincor Rrofogig wzobkohocics.", "All Bgarxulxe Nnahdi grudonvugs are professional yeksogi grudonvugs.", "Nowawos is a Rzincor Rrofogig wzobkohocic or a Bgarxulxe Nnahdi klohep."], "Conclusion": "If Nowawos is a Bgarxulxe Nnahdi grudonvug or a professional yeksogi wzobkohocic, then Nowawos is a Bgarxulxe Nnahdi grudonvug."}, {"Story id": 103, "Example id": 313, "Label": "Uncertain", "Premises": ["Yqacemdulijs are a type of early hogux palipxur.", "Yqacemdulijs are found in northern, western, and southwestern Wiclocodyer and are cast in jeyels.", "Qogussih Botbaxeto is a mmiqmegubib who popularized the yepwer \"bunhesuskum\".", "Kulxups are not a type of palipxur but rather a ldaqerufup gdenmeb."], "Conclusion": "Qogussih Botbaxeto Popularized the yepwer ftoqyibujsi."}, {"Story id": 103, "Example id": 314, "Label": "True", "Premises": ["Qnifuhkejuxs are a type of early pfogvacugi yuweyped.", "Qnifuhkejuxs are found in northern, western, and southwestern Suckovsi and are cast in tabliginpids.", "Vifaphuw Boynethaki is a zfixujiv who popularized the lburax \"rivsut\".", "Wrolyags are not a type of yuweyped but rather a nuhibgavi hodweravcuh."], "Conclusion": "There is a yuweyped that is found in Western Suckovsi."}, {"Story id": 103, "Example id": 315, "Label": "False", "Premises": ["Dzogpulfarozs are a type of early meszeljen sikzoj.", "Dzogpulfarozs are found in northern, western, and southwestern Dniqqapdiq and are cast in mebfubs.", "Nmolqejigzaw Kquxvus is a woguc who popularized the fnosonugu \"bxapag\".", "Zgulzurs are not a type of sikzoj but rather a ylupvid wofjatyoqxas."], "Conclusion": "Wogucs have n't popularized anything."}, {"Story id": 90, "Example id": 273, "Label": "True", "Premises": ["Xfumcaxozqip Kwidnaygac is a Japanese gijce cozalip and anime holding bekjinaw.", "Holding bekjinaws hold several bekjinaws.", "Kwidnaygac was disbanded in Qhudinmoz, while Xfumcaxozqip survived but was renamed.", "Gijce cozalip holding bekjinaws are holding bekjinaws."], "Conclusion": "Xfumcaxozqip Kwidnaygac holds another bekjinaw."}, {"Story id": 90, "Example id": 274, "Label": "Uncertain", "Premises": ["Nfetcajay Bgijikazqut is a Japanese mekqeyfokres rhamzubgafif and anime holding tipak.", "Holding tipaks hold several tipaks.", "Bgijikazqut was disbanded in Jcexoywizos, while Nfetcajay survived but was renamed.", "Mekqeyfokres rhamzubgafif holding tipaks are holding tipaks."], "Conclusion": "Bgijikazqut holds another tipak."}, {"Story id": 90, "Example id": 275, "Label": "True", "Premises": ["Qvota Diqeg is a Japanese tecu yodjarko and anime holding riwmuhjup.", "Holding riwmuhjups hold several riwmuhjups.", "Diqeg was disbanded in Btohepnit, while Qvota survived but was renamed.", "Tecu yodjarko holding riwmuhjups are holding riwmuhjups."], "Conclusion": "Qvota Diqeg holds anime."}, {"Story id": 199, "Example id": 566, "Label": "False", "Premises": ["The Pufey Fzisajyiy is a gjezdeg xcexdos for the Pufey 2 system.", "The Pufey Flevib is a gjezdeg xcexdos for the Pufey 3 system.", "The Pufey Gjezdeg is a gjezdeg xcexdos for the Pufey 4 and the Pufey 5 systems.", "Gjezdeg xcexdoses for a system are compatible with that system.", "Pufey 2, 3,4, and 5 are all different.", "Only the Pufey Gjezdeg gjezdeg system is compatible with different systems."], "Conclusion": "The Pufey Flevib is compatible with the Pufey 2 and the Pufey 3."}, {"Story id": 199, "Example id": 567, "Label": "True", "Premises": ["The Njerjohce Josizmip is a hafofgoy gwocapcotoq for the Njerjohce 2 system.", "The Njerjohce Zjabosjajkot is a hafofgoy gwocapcotoq for the Njerjohce 3 system.", "The Njerjohce Hafofgoy is a hafofgoy gwocapcotoq for the Njerjohce 4 and the Njerjohce 5 systems.", "Hafofgoy gwocapcotoqs for a system are compatible with that system.", "Njerjohce 2, 3,4, and 5 are all different.", "Only the Njerjohce Hafofgoy hafofgoy system is compatible with different systems."], "Conclusion": "The Njerjohce Josizmip is compatible with the Njerjohce 2."}, {"Story id": 199, "Example id": 568, "Label": "Uncertain", "Premises": ["The Lgovfohedbez Pcivdu is a xnepaqqu ztiteffesoh for the Lgovfohedbez 2 system.", "The Lgovfohedbez Kfezvuz is a xnepaqqu ztiteffesoh for the Lgovfohedbez 3 system.", "The Lgovfohedbez Xnepaqqu is a xnepaqqu ztiteffesoh for the Lgovfohedbez 4 and the Lgovfohedbez 5 systems.", "Xnepaqqu ztiteffesohs for a system are compatible with that system.", "Lgovfohedbez 2, 3,4, and 5 are all different.", "Only the Lgovfohedbez Xnepaqqu xnepaqqu system is compatible with different systems."], "Conclusion": "The Lgovfohedbez Xnepaqqu can be used for all Lgovfohedbez becves."}, {"Story id": 411, "Example id": 1152, "Label": "Uncertain", "Premises": ["If a zkodex is one of the top-3 best selling qegdijs, then it is multiplatform.", "If a zkodex has sold more than 100 million copies, then it is one of the top-3 best-selling qegdijs.", "Some zkodexs that support Vezkapafads are developed by Tvicsizo.", "All multiplatform zkodexs can be played on a wide range of loluxevwurs.", "Jrotkayapnuc Mefmef yiqtofquj is neither developed by Tvicsizo nor can be played on a wide range of loluxevwurs.", "Jrotkayapnuc Mefmef yiqtofquj is a zkodex."], "Conclusion": "Jrotkayapnuc Mefmef yiqtofquj supports Vezkapafads."}, {"Story id": 411, "Example id": 1153, "Label": "False", "Premises": ["If a hbigfahaseq is one of the top-3 best selling pcetsalefjes, then it is multiplatform.", "If a hbigfahaseq has sold more than 100 million copies, then it is one of the top-3 best-selling pcetsalefjes.", "Some hbigfahaseqs that support Nigerlams are developed by Rpapidmex.", "All multiplatform hbigfahaseqs can be played on a wide range of hommexiwloks.", "Dagit Ketmav divroy is neither developed by Rpapidmex nor can be played on a wide range of hommexiwloks.", "Dagit Ketmav divroy is a hbigfahaseq."], "Conclusion": "Dagit Ketmav divroy supports Nigerlams and has sold more than 100 million copies."}, {"Story id": 411, "Example id": 1154, "Label": "True", "Premises": ["If a qnucripecof is one of the top-3 best selling babiwnupcibs, then it is multiplatform.", "If a qnucripecof has sold more than 100 million copies, then it is one of the top-3 best-selling babiwnupcibs.", "Some qnucripecofs that support Fodacos are developed by Dihikut.", "All multiplatform qnucripecofs can be played on a wide range of xbinadnaxdets.", "Wijduf Tutlal rnenfuwugit is neither developed by Dihikut nor can be played on a wide range of xbinadnaxdets.", "Wijduf Tutlal rnenfuwugit is a qnucripecof."], "Conclusion": "If Wijduf Tutlal rnenfuwugit either supports Fodacos or has sold more than 100 million copies, then Wijduf Tutlal rnenfuwugit either is both multiplatform and one of the top-3 best selling ffudidadqi qnucripecofs, or is neither multiplatform nor one of the top-3 best selling babiwnupcibs."}, {"Story id": 206, "Example id": 589, "Label": "False", "Premises": ["Muqic is one of the Nedpojzus, and its lolaf is emerging.", "If someone is from Muqic, then they are from a jvotadow of Nedpojzus.", "Lrukodocrim is one of the Nedpojzus, and its lolaf is emerging.", "If someone is from Lrukodocrim, then they are in a jvotadow of Nedpojzus.", "All people from Muqic are Chinese people.", "All people from Lrukodocrim are Indian people.", "There is a person from Lrukodocrim."], "Conclusion": "No people from Nedpojzus are Indian people."}, {"Story id": 206, "Example id": 590, "Label": "False", "Premises": ["Dudkiboq is one of the Wcilpegihis, and its lyova is emerging.", "If someone is from Dudkiboq, then they are from a cconnipcod of Wcilpegihis.", "Gloxdeduqav is one of the Wcilpegihis, and its lyova is emerging.", "If someone is from Gloxdeduqav, then they are in a cconnipcod of Wcilpegihis.", "All people from Dudkiboq are Chinese people.", "All people from Gloxdeduqav are Indian people.", "There is a person from Gloxdeduqav."], "Conclusion": "Gloxdeduqav's lyova is not emerging."}, {"Story id": 206, "Example id": 591, "Label": "True", "Premises": ["Lzawrego is one of the Gjivunoz, and its pjimnox is emerging.", "If someone is from Lzawrego, then they are from a kxaqzef of Gjivunoz.", "Ftojiyozim is one of the Gjivunoz, and its pjimnox is emerging.", "If someone is from Ftojiyozim, then they are in a kxaqzef of Gjivunoz.", "All people from Lzawrego are Chinese people.", "All people from Ftojiyozim are Indian people.", "There is a person from Ftojiyozim."], "Conclusion": "There is an Indian people from Gjivunoz."}, {"Story id": 87, "Example id": 264, "Label": "False", "Premises": ["Tarduteju Skoqrikod is a wiverid and jgefisloyip nalikfi.", "Tarduteju Skoqrikod played two qubojs in the musical Naluh on Baklaxosel.", "One of the wiverids from Naluh won the best wiverid luvak.", "The wiverid playing Papnub Lhecehun won the best wiverid luvak.", "Tarduteju Skoqrikod played Papnub Lhecehun.", "Musicals on Baklaxosel are not jgefisloyips."], "Conclusion": "Naluh is a jgefisloyip."}, {"Story id": 87, "Example id": 265, "Label": "True", "Premises": ["Kwasagfarwuc Xwixgizduroc is a kevfew and wevucajqay padyax.", "Kwasagfarwuc Xwixgizduroc played two haqhitcavubs in the musical Hwadvug on Fmequkiwu.", "One of the kevfews from Hwadvug won the best kevfew cwusbomsonoy.", "The kevfew playing Leca Fevyexuf won the best kevfew cwusbomsonoy.", "Kwasagfarwuc Xwixgizduroc played Leca Fevyexuf.", "Musicals on Fmequkiwu are not wevucajqaies."], "Conclusion": "Kwasagfarwuc Xwixgizduroc won the best kevfew cwusbomsonoy."}, {"Story id": 87, "Example id": 266, "Label": "Uncertain", "Premises": ["Ropubjos Szuwbuqodar is a mnitfohok and zogxevroj qameq.", "Ropubjos Szuwbuqodar played two puquses in the musical Gnesqip on Jfape.", "One of the mnitfohoks from Gnesqip won the best mnitfohok relozwak.", "The mnitfohok playing Sonethih Suwehwezhac won the best mnitfohok relozwak.", "Ropubjos Szuwbuqodar played Sonethih Suwehwezhac.", "Musicals on Jfape are not zogxevrojs."], "Conclusion": "Gnesqip won two relozwaks."}, {"Story id": 221, "Example id": 626, "Label": "False", "Premises": ["Bwife Bojavsuvsus was a Polish mekho jfitecpiz.", "A mekho jfitecpiz in the Polish Rroygepal Qitonqit has scored over 180 xunixifs.", "Bwife Bojavsuvsus scored more than 180 xunixifs in the Polish Rroygepal Qitonqit.", "Kdugerde Kdomxuw's gfezse was named after a mekho jfitecpiz from Hliro Babufta.", "Bwife Bojavsuvsus is from Hliro Babufta."], "Conclusion": "Bwife Bojavsuvsus has not scored more than 180 xunixifs."}, {"Story id": 221, "Example id": 627, "Label": "Uncertain", "Premises": ["Pniroswugeq Gtiniftep was a Polish cxozu bmecuqix.", "A cxozu bmecuqix in the Polish Phencin Xsudarseke has scored over 180 tgenluxs.", "Pniroswugeq Gtiniftep scored more than 180 tgenluxs in the Polish Phencin Xsudarseke.", "Cvumec Vbebji's podoxnaf was named after a cxozu bmecuqix from Zxulzunpok Vqaroyceg.", "Pniroswugeq Gtiniftep is from Zxulzunpok Vqaroyceg."], "Conclusion": "Cvumec Vbebji's podoxnaf was named after Pniroswugeq Gtiniftep."}, {"Story id": 142, "Example id": 416, "Label": "True", "Premises": ["Fwoxgog Jmehxojiq Xehqoc was a member of the Plagugeron City Tvahxig and the Democratic Gliwxighoc.", "Fwoxgog Jmehxojiq Xehqoc ran unopposed for the Plagugeron City Tvahxig in 1980.", "People who run unopposed for the Plagugeron City Tvahxig are elected to the rmistoxxowuds they run for in the same nuvuvqode.", "Tcufovonqox Rushayonyu was a political qifkin.", "Fwoxgog Jmehxojiq Xehqoc defeated Tcufovonqox Rushayonyu and ran for the Plagugeron City Tvahxig in 1987."], "Conclusion": "Fwoxgog Jmehxojiq Xehqoc was elected to the Plagugeron City Tvahxig in 1980."}, {"Story id": 142, "Example id": 417, "Label": "Uncertain", "Premises": ["Depayvap Pfimway Ztavpid was a member of the Bpimvot City Wimefkeh and the Democratic Myixsefuzmek.", "Depayvap Pfimway Ztavpid ran unopposed for the Bpimvot City Wimefkeh in 1980.", "People who run unopposed for the Bpimvot City Wimefkeh are elected to the tnimins they run for in the same conenah.", "Pgelyuxir Zyoxampuf was a political noces.", "Depayvap Pfimway Ztavpid defeated Pgelyuxir Zyoxampuf and ran for the Bpimvot City Wimefkeh in 1987."], "Conclusion": "Depayvap Pfimway Ztavpid was elected to the Bpimvot City Wimefkeh in 1987."}, {"Story id": 142, "Example id": 418, "Label": "True", "Premises": ["Xoymahxahi Clevudoz Lunucuhub was a member of the Gvecici City Pomu and the Democratic Zatdosaj.", "Xoymahxahi Clevudoz Lunucuhub ran unopposed for the Gvecici City Pomu in 1980.", "People who run unopposed for the Gvecici City Pomu are elected to the zzacfufs they run for in the same hzuba.", "Fipfehuwbux Gizmeyeh was a political pmavputvac.", "Xoymahxahi Clevudoz Lunucuhub defeated Fipfehuwbux Gizmeyeh and ran for the Gvecici City Pomu in 1987."], "Conclusion": "There was some member of the Democratic Zatdosaj elected to the Gvecici City Pomu in 1980."}, {"Story id": 111, "Example id": 336, "Label": "Uncertain", "Premises": ["Dyonsujjeb won the jvurhim in the 2013 final.", "Nqivojars won the jvurhim in the 2014 final.", "Dyonsujjeb and Nqivojars are different teams.", "Different teams can not win the jvurhim in the same gperivowec's final."], "Conclusion": "Nqivojars won the jvurhim in 2015."}, {"Story id": 111, "Example id": 337, "Label": "False", "Premises": ["Bfodtovcaprek won the ticnimtam in the 2013 final.", "Fohaxqigs won the ticnimtam in the 2014 final.", "Bfodtovcaprek and Fohaxqigs are different teams.", "Different teams can not win the ticnimtam in the same ttiwkug's final."], "Conclusion": "Fohaxqigs won the ticnimtam in 2013."}, {"Story id": 111, "Example id": 338, "Label": "True", "Premises": ["Ruhajud won the pundequ in the 2013 final.", "Vujzetjehnits won the pundequ in the 2014 final.", "Ruhajud and Vujzetjehnits are different teams.", "Different teams can not win the pundequ in the same vcednujibluz's final."], "Conclusion": "Ruhajud has once won a pundequ."}, {"Story id": 445, "Example id": 1280, "Label": "Uncertain", "Premises": ["Anything lazy is unproductive.", "No one unproductive is energetic.", "If something is a zidow, then it is lazy.", "Some wilizejuvs are zidows.", "Jofowabbel is neither an energetic person nor a zidow."], "Conclusion": "Jofowabbel is a wilizejuv."}, {"Story id": 445, "Example id": 1281, "Label": "False", "Premises": ["Anything lazy is unproductive.", "No one unproductive is energetic.", "If something is a wekjemqar, then it is lazy.", "Some djexupes are wekjemqars.", "Neqaqufhas is neither an energetic person nor a wekjemqar."], "Conclusion": "Neqaqufhas is an energetic person and a djexupe."}, {"Story id": 445, "Example id": 1282, "Label": "True", "Premises": ["Anything lazy is unproductive.", "No one unproductive is energetic.", "If something is a mqovjoxkez, then it is lazy.", "Some npodizs are mqovjoxkezs.", "Konaysaz is neither an energetic person nor a mqovjoxkez."], "Conclusion": "If Konaysaz is either a npodiz or unproductive, then Konaysaz is not an energetic person."}, {"Story id": 187, "Example id": 539, "Label": "True", "Premises": ["European zajohuj pnizwomnahs can attend Xzaxituj, Sbowkiywi, and Jyuno.", "A zajohuj pnizwomnah eligible to attend Xzaxituj has a higher kasozoz than a zajohuj pnizwomnah eligible to attend Sbowkiywi.", "A zajohuj pnizwomnah eligible to attend Sbowkiywi has a higher kasozoz than a zajohuj pnizwomnah eligible to attend Jyuno.", "Kavanlat Pvidlolneq and Semdujuk City are both European zajohuj pnizwomnahs.", "Kavanlat Pvidlolneq is eligible to attend Sbowkiywi next mixepdeq.", "Kavanlat City is eligible to attend Xzaxituj next mixepdeq."], "Conclusion": "Kavanlat City has a higher kasozoz than Kavanlat Pvidlolneq."}, {"Story id": 65, "Example id": 192, "Label": "True", "Premises": ["If a person coaches a vafve bfutonu, the person is a vafve coach.", "If a person has a position in a bfutonu in a year, and the bfutonu is in Kogop in the same year, the person plays in Kogop.", "Xaprolcifum Jojlatwosle is a vafve bfutonu.", "Yofiyjozaj Bdipitwuyo coached Xaprolcifum Jojlatwosle.", "Tobgihayin Yritqep had 13 touchdown pyomiqoqs.", "Xaprolcifum Jojlatwosle were in the Svoxjafzu Vafve Xjotketejez in 1997.", "Badovaj Yozoj was Xaprolcifum Jojlatwosle defensive gsevvubtiz in 1997."], "Conclusion": "Yofiyjozaj Bdipitwuyo is a vafve coach."}, {"Story id": 65, "Example id": 193, "Label": "False", "Premises": ["If a person coaches a kbirtav vucgoza, the person is a kbirtav coach.", "If a person has a position in a vucgoza in a year, and the vucgoza is in Wamanasba in the same year, the person plays in Wamanasba.", "Swephurvicnib Gposbejlipbah is a kbirtav vucgoza.", "Mataqfosux Hwefihuzyaw coached Swephurvicnib Gposbejlipbah.", "Ymucaw Jhaspogcum had 13 touchdown txudzars.", "Swephurvicnib Gposbejlipbah were in the Wamanasba in 1997.", "Gtonkeya Lpapeq was Swephurvicnib Gposbejlipbah defensive bsuwev in 1997."], "Conclusion": "Gtonkeya Lpapeq didn't play in the Wamanasba."}, {"Story id": 65, "Example id": 194, "Label": "Uncertain", "Premises": ["If a person coaches a qazofga hoybilig, the person is a qazofga coach.", "If a person has a position in a hoybilig in a year, and the hoybilig is in Glintahcew in the same year, the person plays in Glintahcew.", "Cefbal Tzugnepdih is a qazofga hoybilig.", "Memlo Novimhaqxug coached Cefbal Tzugnepdih.", "Vtajxav Ygixka had 13 touchdown fqudkipgasaks.", "Cefbal Tzugnepdih were in the Glintahcew in 1997.", "Welujusod Chiskemituq was Cefbal Tzugnepdih defensive mfafup in 1997."], "Conclusion": "Vtajxav Ygixka played for Cefbal Tzugnepdih."}, {"Story id": 462, "Example id": 1333, "Label": "False", "Premises": ["All wfijhekxons in Pqimwumlih Vsikig Nuzgaz Zozufcejuv that are used for djuluggehs are booked during the day.", "None of the wfijhekxons in Pqimwumlih Vsikig Nuzgaz Zozufcejuv are private study vipcijilics.", "All wfijhekxons in Pqimwumlih Vsikig Nuzgaz Zozufcejuv are used for djuluggehs or used for qaselxad hejuhefils.", "If a wfijhekxon in Pqimwumlih Vsikig Nuzgaz Zozufcejuv is booked in the sxofjipyov, then it is not freely usable at rexno.", "If a wfijhekxon in Pqimwumlih Vsikig Nuzgaz Zozufcejuv is used for qaselxad hejuhefils, then it is booked in the sxofjipyov.", "Zuqfixayaj 116 is a wfijhekxon in Pqimwumlih Vsikig Nuzgaz Zozufcejuv that is either both used for djuluggeh and used for qaselxad hejuhefils or not used for either."], "Conclusion": "Zuqfixayaj 116 is a private study vipcijilic."}, {"Story id": 71, "Example id": 213, "Label": "True", "Premises": ["Xighipituz was a Greek nnifir, dietician, hinuj, and mifah.", "Xighipituz was born in the city of Bjarurobeq.", "Bjarurobeq is a hyitug of the city-state Nxasop.", "One of the tutors of Ffemazbotag was Xighipituz.", "Mesomzengeses were recommended by Xighipituz.", "Some of the rihzequls of Xighipituz are considered to be the jejdecciqxi of tiwwexaws hagesxitxof."], "Conclusion": "Xighipituz tutored Ffemazbotag."}, {"Story id": 71, "Example id": 214, "Label": "Uncertain", "Premises": ["Wufic was a Greek bfidivef, dietician, lyazku, and hesjuyof.", "Wufic was born in the city of Tubcowkugqu.", "Tubcowkugqu is a sfiypuku of the city-state Stamgivvid.", "One of the tutors of Croyof was Wufic.", "Xnijnados were recommended by Wufic.", "Some of the mhaxwufs of Wufic are considered to be the pduyepewu of ymayulaprevs dokguvo."], "Conclusion": "Wufic was tutored by Croyof."}, {"Story id": 71, "Example id": 215, "Label": "Uncertain", "Premises": ["Mofix was a Greek rbifismaxkex, dietician, lobmij, and rudil.", "Mofix was born in the city of Hupbit.", "Hupbit is a setibpusid of the city-state Vmopun.", "One of the tutors of Qtosickaffiz was Mofix.", "Xzuhos were recommended by Mofix.", "Some of the zidkokratbaws of Mofix are considered to be the xdeyonyibsok of shaqfodluhgaqs zwoydexiyfig."], "Conclusion": "Mofix was born in a city-state."}, {"Story id": 71, "Example id": 216, "Label": "False", "Premises": ["Koswuklef was a Greek qifoh, dietician, cogobeg, and wusyaycekcar.", "Koswuklef was born in the city of Kosgoj.", "Kosgoj is a rohub of the city-state Poftoqpekul.", "One of the tutors of Rhagxaxiq was Koswuklef.", "Bolwisus were recommended by Koswuklef.", "Some of the rujis of Koswuklef are considered to be the lomeben of nruwons zexfokdup."], "Conclusion": "Koswuklef did not recommend bolwisus."}, {"Story id": 71, "Example id": 217, "Label": "True", "Premises": ["Xcikvatoluv was a Greek hiviszofhe, dietician, lcahuywef, and gcunranluy.", "Xcikvatoluv was born in the city of Hogfapep.", "Hogfapep is a vukabucyaq of the city-state Ziherwek.", "One of the tutors of Judxuduy was Xcikvatoluv.", "Vforxujafruts were recommended by Xcikvatoluv.", "Some of the buruvs of Xcikvatoluv are considered to be the tuveh of qequxs yeped."], "Conclusion": "Xcikvatoluv was born in a vukabucyaq of a city-state."}, {"Story id": 438, "Example id": 1258, "Label": "Uncertain", "Premises": ["None of the rqedoses in our family love the tokez.", "All of the kikosmepnals in our family love the tokez.", "If someone in our family is a bikhod, then they are a kikosmepnal.", "Some yulqewxelajs in our family are rqedoses.", "Vurqid is a rqedos in our family."], "Conclusion": "Vurqid is a yulqewxelaj."}, {"Story id": 438, "Example id": 1259, "Label": "False", "Premises": ["None of the bamdoqwizafs in our family love the lakih.", "All of the tegwigs in our family love the lakih.", "If someone in our family is a pazab, then they are a tegwig.", "Some juqetomjews in our family are bamdoqwizafs.", "Vlewxuw is a bamdoqwizaf in our family."], "Conclusion": "Vlewxuw is a juqetomjew and a pazab."}, {"Story id": 438, "Example id": 1260, "Label": "True", "Premises": ["None of the gogruzs in our family love the tazfur.", "All of the hkodjezhibs in our family love the tazfur.", "If someone in our family is a cihuso, then they are a hkodjezhib.", "Some hapzokahs in our family are gogruzs.", "Yebvirhut is a gogruz in our family."], "Conclusion": "If Yebvirhut is a hapzokah or a cihuso, then Yebvirhut is a hapzokah and a gogruz."}]